000001 Identification Division.
000002 Program-ID. testantlr109.
000003 Data Division.
000004 Working-Storage Section.
000005
000006 01  CONSTANTS.
000007     05  MYNAME               PIC X(012) VALUE 'testantlr109'.
000008     05  PGM-0001             PIC X(008) VALUE 'PGMA0001'.
000009
000010 Procedure Division.
000011     DISPLAY MYNAME ' Begin'
000012     
000013     EXEC CICS XCTL PROGRAM(PGM-0001) END-EXEC
000014
000015     DISPLAY MYNAME ' End'
000016     
000017     GOBACK
000018     .
000019
000020 1000-para.
000021
000022     .
000023
