000001 Identification Division.                                         00000001
000002 Program-ID. testantlr024.                                        00000002
000003 Data Division.                                                   00000003
000004 Working-Storage Section.                                         00000004
000005                                                                  00000005
000006*                                                                 00000006
000007*comment                                                          00000007
000008*                                                                 00000008
000009                                                                  00000009
000010 01  CONSTANTS.                                                   00000010
000011     05  MYNAME               PIC X(012) VALUE 'testantlr024'.    00000011
000012                                                                  00000012
000013*                                                                 00000013
000014                                                                  00000014
000015 01 WORK-AREAS.                                                   00000015
000016    05  A                     PIC A VALUE 'A'.                    00000016
000017    05  X                     PIC X VALUE 'X'.                    00000017
000018    05  V99                   PIC V99.                            00000018
000019    05  B9                    PIC B9.                             00000019
000020    05  Z                     PIC Z.                              00000020
000021    05  S9                    PIC S9.                             00000021
000022                                                                  00000022
000023 Procedure Division.                                              00000023
000024     DISPLAY MYNAME ' Begin'                                      00000024
000025                                                                  00000025
000026                                                                  00000026
000027     DISPLAY MYNAME ' End'                                        00000027
000028                                                                  00000028
000029     GOBACK                                                       00000029
000030     .                                                            00000030
000031                                                                  00000031
000032                                                                  00000032
