000001 PROCESS DEFINE(A=B'1'),DEFINE(B=B'0')
000002 ID Division.
000003 Program-ID. testantlr151.
000004 Procedure Division.
000005     >>IF A
000006     CALL 'PGM0001A'
000007     >>END-IF
000008
000009     >>IF B
000010     CALL 'PGM0001B'
000011     >>END-IF
000012
000013     >>DEFINE A B'0' OVERRIDE
000014     >>DEFINE B B'1' OVERRIDE
000015
000016     >>IF A
000017     CALL 'PGM0001C'
000018     >>END-IF
000019
000020     >>IF B
000021     CALL 'PGM0001D'
000022     >>END-IF
000023
000024     >>DEFINE A AS PARAMETER
000025     >>DEFINE B AS PARAMETER
000026
000027     >>IF A
000028     CALL 'PGM0001E'
000029     >>END-IF
000030
000031     >>IF B
000032     CALL 'PGM0001F'
000033     >>END-IF
000034
000035     >>IF A
000036     COPY testantlr151.cpy.
000037     >>END-IF
000038
000039     >>IF B
000040     CALL 'PGM0001G'
000041     >>END-IF
000042
000043     >>DEFINE B AS PARAMETER
000044
000045     >>IF B
000046     CALL 'PGM0001H'
000047     >>END-IF
000048
000049     GOBACK.
