>>SOURCE FORMAT IS FREE
Identification Division.
Program-ID. test9044.
Environment Division.
Configuration Section.
Data Division.
Working-Storage Section.
01  CONSTANTS.
    05  MYNAME                  PIC X(008) VALUE 'test9044'.

Procedure Division.
    DISPLAY MYNAME
    GOBACK.
End Program test9044.

