000001 Identification Division.                                         00000001
000002 Program-ID. testantlr321.                                        00000002
000003 Data Division.                                                   00000003
000004 Working-Storage Section.                                         00000004
000005                                                                  00000005
000006 REPLACE                                                          00000006
000007   =='PGMA0001'== BY =='PGMB0001'==                               00000007
000008   =='PGMA0002'== BY =='PGMB0002'==                               00000008
000009   .                                                              00000009
000010                                                                  00000010
000011*                                                                 00000011
000012*comment                                                          00000012
000013*                                                                 00000013
000014                                                                  00000014
000015 01  CONSTANTS.                                                   00000015
000016     05  MYNAME               PIC X(012) VALUE 'testantlr321'.    00000016
000017     05  PGM-0001             PIC X(008) VALUE 'PGMA0001'.        00000017
000018     05  PGM-0002             PIC X(008) VALUE 'PGMA0002'.        00000018
000019     05  PGM-0003             PIC X(008) VALUE 'PGMA0003'.        00000019
000020                                                                  00000020
000021*                                                                 00000021
000022                                                                  00000022
000023 REPLACE OFF                                                      00000023
000024 .                                                                00000024
000025                                                                  00000025
000026                                                                  00000026
000027 Procedure Division.                                              00000027
000028     DISPLAY MYNAME ' Begin'                                      00000028
000029                                                                  00000029
000030     CALL PGM-0001 USING MYNAME                                   00000030
000031                                                                  00000031
000032     DISPLAY MYNAME ' End'                                        00000032
000033                                                                  00000033
000034     GOBACK                                                       00000034
000035     .                                                            00000035
000036                                                                  00000036
000037                                                                  00000037
