000001 Identification Division.
000002 Program-ID. testantlr133.
000003 Data Division.
000004 Working-Storage Section.
000005 01  CONSTANTS.
000006     05  MYNAME               PIC X(012) VALUE 'testantlr133'.
000007
000008* 
000009 01  SOME-DATA.
000010     05  SD-001               PIC X(008).
000011     05  SD-002.
000012         10  SD-002-A         PIC X(001).
000013         10  SD-002-B         PIC X(001).
000014     05  SD-003               PIC X(008).
000015
000016 01  WS-BUF                   PIC X(100).
000017
000018 77  WS-COUNT                 PIC 9(008) COMP-5 VALUE 0.
000019
000020 Procedure Division.
000021     DISPLAY MYNAME ' Begin'
000022     
000023     JSON PARSE WS-BUF INTO SOME-DATA END-JSON
000024
000025     JSON PARSE
000026         WS-BUF INTO SOME-DATA
000027         DETAIL
000028         NAME SD-001 'ARTHUR'
000029              SD-002 'DENT'
000030         SUPPRESS 
000031              SD-001
000032              SD-002
000033         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000034         NOT ON EXCEPTION PERFORM 1000-para
000035     END-JSON
000036
000037     JSON PARSE
000038         WS-BUF INTO SOME-DATA
000039         WITH DETAIL
000040         NAME OF SD-001 IS 'ARTHUR'
000041                 SD-002 IS OMITTED
000042         SUPPRESS SD-001 SD-003
000043         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000044         NOT ON EXCEPTION PERFORM 1000-para
000045     END-JSON
000046
000047
000048     DISPLAY MYNAME ' End'
000049     
000050     GOBACK
000051     .
000052
000053 1000-para.
000054
000055     .
000056
