000001 Identification Division.
000002 Program-ID. testantlr126.
000003 Data Division.
000004 Working-Storage Section.
000005
000006*
000007*comment
000008*
000009
000010 01  CONSTANTS.
000011     05  MYNAME               PIC X(012) VALUE 'testantlr126'.
000012
000013*
000014
000015 01 WORK-AREAS.
000016    05  A                     PIC A USAGE IS DISPLAY.
000017    05  B                     PIC A USAGE IS DISPLAY-1.
000018    05  C                     PIC S9(4) USAGE IS COMP.
000019    05  S94USAGECOMP1         PIC S9(4) USAGE IS COMP-1.
000020    05  S95USAGECOMP3         PIC S9(005) USAGE IS COMP-3.
000021    05  S9SFLOAT              USAGE IS COMP-2.
000022    05  S9DFLOAT              USAGE IS COMP-4.
000023    05  S98USAGECOMP5         PIC S9(008) USAGE IS COMP-5.
000024    05  S99USAGEDISPLAY-V     PIC S99 USAGE IS DISPLAY VALUE +1.
000025    05  S99USAGEDISPLAY1-V    PIC S99 USAGE IS DISPLAY-1 VALUE +1.
000026    05  S94USAGECOMP-V        PIC S9(4) USAGE IS COMP VALUE +3.
000027    05  S94USAGECOMP1-V       PIC S9(4) USAGE IS COMP-1 VALUE -7.
000028    05  S95USAGECOMP3-V       PIC S9(005) USAGE IS COMP-3 
000029                              VALUE -14.
000030    05  S98USAGECOMP5-V       PIC S9(008) USAGE IS COMP-5 
000031                              VALUE +2.
000032    05  S94USAGECOMPU         PIC S9(4) USAGE IS COMPUTATIONAL.
000033    05  S94USAGECOMPU1        PIC S9(4) USAGE IS COMPUTATIONAL-1.
000034    05  S95USAGECOMPU3        PIC S9(005) USAGE IS 
000035                              COMPUTATIONAL-3.
000036    05  S9SFLOATU             USAGE COMPUTATIONAL-2.
000037    05  S9DFLOATU             USAGE COMPUTATIONAL-4.
000038    05  S98USAGECOMPU5        PIC S9(008) USAGE IS 
000039                              COMPUTATIONAL-5.
000040    05  S94USAGECOMPU-V       PIC S9(4) 
000041                              USAGE IS COMPUTATIONAL VALUE +3.
000042    05  S94USAGECOMPU1-V      PIC S9(4) 
000043                              USAGE IS COMPUTATIONAL-1 VALUE -7.
000044    05  S95USAGECOMPU3-V      PIC S9(005) 
000045                              USAGE IS COMPUTATIONAL-3 VALUE -14.
000046    05  S98USAGECOMPU5-V      PIC S9(008) 
000047                              USAGE IS COMPUTATIONAL-5 VALUE +2.
000048
000049
000050
000051 Procedure Division.
000052     DISPLAY MYNAME ' Begin'
000053     
000054
000055     DISPLAY MYNAME ' End'
000056     
000057     GOBACK
000058     .
000059
000060
