000001 Identification Division.
000002 Program-ID. testantlr132.
000003 Data Division.
000004 Working-Storage Section.
000005 01  CONSTANTS.
000006     05  MYNAME               PIC X(012) VALUE 'testantlr132'.
000007
000008 01  SWITCHES.
000009     05  SD-001-TRUTH-SW      PIC X(008).
000010         88  SD-001-TRUTH     VALUE 'ZAPHOD'.
000011
000012* 
000013 01  SOME-DATA.
000014     05  SD-001               PIC X(008).
000015     05  SD-002.
000016         10  SD-002-A         PIC X(001).
000017         10  SD-002-B         PIC X(001).
000018     05  SD-003               PIC X(008).
000019
000020 01  WS-BUF                   PIC X(100).
000021
000022 77  WS-COUNT                 PIC 9(008) COMP-5 VALUE 0.
000023
000024 Procedure Division.
000025     DISPLAY MYNAME ' Begin'
000026     
000027     JSON GENERATE WS-BUF FROM SOME-DATA END-JSON
000028
000029     JSON GENERATE WS-BUF FROM SOME-DATA 
000030         ENCODING 37
000031     END-JSON
000032
000033     JSON GENERATE WS-BUF FROM SOME-DATA 
000034         ENCODING WS-COUNT
000035     END-JSON
000036
000037     JSON GENERATE WS-BUF FROM SOME-DATA 
000038         ENCODING FROM CODEPAGE
000039     END-JSON
000040
000041     JSON GENERATE
000042         WS-BUF FROM SOME-DATA
000043         COUNT WS-COUNT
000044         NAME SD-001 'ARTHUR'
000045              SD-002 'DENT'
000046         SUPPRESS 
000047              SD-001
000048              SD-002
000049         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000050         NOT ON EXCEPTION PERFORM 1000-para
000051     END-JSON
000052
000053     JSON GENERATE
000054         WS-BUF FROM SOME-DATA
000055         COUNT IN WS-COUNT
000056         NAME OF SD-001 IS 'ARTHUR'
000057                 SD-002 IS 'DENT'
000058         SUPPRESS SD-001 SD-003
000059         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000060         NOT ON EXCEPTION PERFORM 1000-para
000061     END-JSON
000062
000063     JSON GENERATE
000064         WS-BUF FROM SOME-DATA
000065         COUNT IN WS-COUNT
000066         NAME OF SD-001 IS 'ARTHUR'
000067                 SD-002 IS 'DENT'
000068         SUPPRESS EVERY NUMERIC WHEN ZEROES
000069         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000070         NOT ON EXCEPTION PERFORM 1000-para
000071     END-JSON
000072
000073     JSON GENERATE
000074         WS-BUF FROM SOME-DATA
000075         COUNT IN WS-COUNT
000076         NAME OF SD-001 IS 'ARTHUR'
000077                 SD-002 IS 'DENT'
000078         SUPPRESS 
000079                 EVERY NUMERIC WHEN ZEROES
000080                 EVERY NONNUMERIC WHEN SPACES
000081                 EVERY NONNUMERIC WHEN LOW-VALUES
000082                 EVERY WHEN HIGH-VALUES OR HIGH-VALUE
000083         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000084         NOT ON EXCEPTION PERFORM 1000-para
000085     END-JSON
000086
000087     JSON GENERATE
000088         WS-BUF FROM SOME-DATA
000089         COUNT WS-COUNT
000090         NAME SD-001 'ARTHUR'
000091              SD-002 'DENT'
000092         SUPPRESS 
000093              SD-001 WHEN SPACES
000094              SD-002 WHEN LOW-VALUES
000095         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000096         NOT ON EXCEPTION PERFORM 1000-para
000097     END-JSON
000098
000099     JSON GENERATE
000100         WS-BUF FROM SOME-DATA
000101         COUNT WS-COUNT
000102         NAME SD-001 'ARTHUR'
000103              SD-002 'DENT'
000104         SUPPRESS 
000105              SD-001
000106              SD-002
000107         CONVERTING SD-001 TO JSON BOOLEAN USING SD-001-TRUTH
000108         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000109         NOT ON EXCEPTION PERFORM 1000-para
000110     END-JSON
000111
000112     JSON GENERATE
000113         WS-BUF FROM SOME-DATA
000114         COUNT WS-COUNT
000115         NAME SD-001 'ARTHUR'
000116              SD-002 'DENT'
000117         SUPPRESS 
000118              SD-001
000119              SD-002
000120         CONVERTING SD-001 JSON BOOLEAN USING SD-001-TRUTH
000121         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000122         NOT ON EXCEPTION PERFORM 1000-para
000123     END-JSON
000124
000125     JSON GENERATE
000126         WS-BUF FROM SOME-DATA
000127         COUNT WS-COUNT
000128         NAME SD-001 'ARTHUR'
000129              SD-002 'DENT'
000130         SUPPRESS 
000131              SD-001
000132              SD-002
000133         CONVERTING SD-001 BOOLEAN USING SD-001-TRUTH
000134         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000135         NOT ON EXCEPTION PERFORM 1000-para
000136     END-JSON
000137
000138     JSON GENERATE
000139         WS-BUF FROM SOME-DATA
000140         COUNT WS-COUNT
000141         NAME SD-001 'ARTHUR'
000142              SD-002 'DENT'
000143         SUPPRESS 
000144              SD-001
000145              SD-002
000146         CONVERTING SD-003 JSON NULL USING SPACES
000147         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000148         NOT ON EXCEPTION PERFORM 1000-para
000149     END-JSON
000150
000151     JSON GENERATE
000152         WS-BUF FROM SOME-DATA
000153         COUNT WS-COUNT
000154         NAME SD-001 'ARTHUR'
000155              SD-002 'DENT'
000156         SUPPRESS 
000157              SD-001
000158              SD-002
000159         CONVERTING SD-003 NULL USING SPACES
000160         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000161         NOT ON EXCEPTION PERFORM 1000-para
000162     END-JSON
000163
000164     JSON GENERATE
000165         WS-BUF FROM SOME-DATA
000166         COUNT WS-COUNT
000167         NAME SD-001 'ARTHUR'
000168              SD-002 'DENT'
000169         SUPPRESS 
000170              SD-001
000171              SD-002
000172         CONVERTING SD-001 BOOLEAN SD-001-TRUTH
000173         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000174         NOT ON EXCEPTION PERFORM 1000-para
000175     END-JSON
000176
000177     JSON GENERATE
000178         WS-BUF FROM SOME-DATA
000179         COUNT WS-COUNT
000180         NAME SD-001 'ARTHUR'
000181              SD-002 'DENT'
000182         SUPPRESS 
000183              SD-001
000184              SD-002
000185         CONVERTING SD-001 TO JSON BOOL USING SD-001-TRUTH
000186         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000187         NOT ON EXCEPTION PERFORM 1000-para
000188     END-JSON
000189
000190     JSON GENERATE
000191         WS-BUF FROM SOME-DATA
000192         COUNT WS-COUNT
000193         NAME SD-001 'ARTHUR'
000194              SD-002 'DENT'
000195         SUPPRESS 
000196              SD-001
000197              SD-002
000198         CONVERTING SD-001 TO JSON BOOLEAN USING 'FPREFECT'
000199         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000200         NOT ON EXCEPTION PERFORM 1000-para
000201     END-JSON
000202
000203     JSON GENERATE
000204         WS-BUF FROM SOME-DATA
000205         COUNT WS-COUNT
000206         NAME SD-001 'ARTHUR'
000207              SD-002 'DENT'
000208         SUPPRESS 
000209              SD-001
000210              SD-002
000211         CONVERTING 
000212              SD-001 TO JSON BOOLEAN USING 'FPREFECT'
000213              ALSO SD-002 BOOL '&&'
000214         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000215         NOT ON EXCEPTION PERFORM 1000-para
000216     END-JSON
000217
000218
000219     DISPLAY MYNAME ' End'
000220     
000221     GOBACK
000222     .
000223
000224 1000-para.
000225
000226     .
000227
