000001 ID Division.
000002 Program-ID. testantlr154.
000003 Procedure Division.
000004
000005 >>DEFINE VAR1 1
000006 >>DEFINE VAR2 2
000007 >>DEFINE VAR3 3
000008 >>DEFINE VAR4 4
000009
000010 >>EVALUATE VAR1
000011 >>WHEN VAR2
000012     EXEC CICS 
000013          LINK
000014          PROGRAM('PGM00001')
000015     END-EXEC
000016 >>WHEN VAR3
000017     EXEC CICS 
000018          LINK
000019          PROGRAM('PGM00002')
000020     END-EXEC
000021 >>WHEN VAR4
000022     EXEC CICS 
000023          LINK
000024          PROGRAM('PGM00003')
000025     END-EXEC
000026 >>WHEN OTHER
000027     EXEC CICS 
000028          LINK
000029          PROGRAM('PGM00004')
000030     END-EXEC
000031 >>END-EVALUATE
000032
000033 >>EVALUATE VAR1
000034 >>WHEN VAR2 - 1
000035     EXEC CICS 
000036          LINK
000037          PROGRAM('PGM00005')
000038     END-EXEC
000039 >>WHEN VAR3 - 1
000040     EXEC CICS 
000041          LINK
000042          PROGRAM('PGM00006')
000043     END-EXEC
000044 >>WHEN VAR4 - 1
000045     EXEC CICS 
000046          LINK
000047          PROGRAM('PGM00007')
000048     END-EXEC
000049 >>WHEN OTHER
000050     EXEC CICS 
000051          LINK
000052          PROGRAM('PGM00008')
000053     END-EXEC
000054 >>END-EVALUATE
000055
000056 >>IF VAR1 = VAR2 - 1
000057     EXEC CICS 
000058          LINK
000059          PROGRAM('PGM00009')
000060     END-EXEC
000061 >>END-IF
000062
000063 >>EVALUATE VAR1 + 1
000064 >>WHEN VAR2 - 1
000065     EXEC CICS 
000066          LINK
000067          PROGRAM('PGM00010')
000068     END-EXEC
000069 >>WHEN VAR3 - 1
000070     EXEC CICS 
000071          LINK
000072          PROGRAM('PGM00011')
000073     END-EXEC
000074 >>WHEN VAR4 - 1
000075     EXEC CICS 
000076          LINK
000077          PROGRAM('PGM00012')
000078     END-EXEC
000079 >>WHEN OTHER
000080     EXEC CICS 
000081          LINK
000082          PROGRAM('PGM00013')
000083     END-EXEC
000084 >>END-EVALUATE
000085
000086 >>EVALUATE TRUE
000087 >>WHEN VAR1 = VAR2
000088     EXEC CICS 
000089          LINK
000090          PROGRAM('PGM00014')
000091     END-EXEC
000092 >>WHEN VAR3 = VAR4
000093     EXEC CICS 
000094          LINK
000095          PROGRAM('PGM00015')
000096     END-EXEC
000097 >>WHEN VAR4 - 1 = VAR2 + 1
000098     EXEC CICS 
000099          LINK
000100          PROGRAM('PGM00016')
000101     END-EXEC
000102 >>WHEN OTHER
000103     EXEC CICS 
000104          LINK
000105          PROGRAM('PGM00017')
000106     END-EXEC
000107 >>END-EVALUATE
000108
000109 >>IF VAR4 - 1 = VAR2 + 1
000110     EXEC CICS 
000111          LINK
000112          PROGRAM('PGM00018')
000113     END-EXEC
000114 >>END-IF
000115
000116     GOBACK.
