000001 Identification Division.
000002 Program-ID. testantlr131.
000003 Environment Division.
000004 Configuration Section.
000005 Special-Names.
000006     XML-SCHEMA OSR-DATA-FILE IS OSRDATA1.
000007 Data Division.
000008 Working-Storage Section.
000009 01  CONSTANTS.
000010     05  MYNAME               PIC X(012) VALUE 'testantlr131'.
000011
000012* 
000013 01  SOME-DATA.
000014     05  SD-001               PIC X(008).
000015     05  SD-002.
000016         10  SD-002-A         PIC X(001).
000017         10  SD-002-B         PIC X(001).
000018     05  SD-003               PIC X(008).
000019
000020 01  WS-BUF                   PIC X(100).
000021
000022 01  OSR-DATA                 PIC X(1024).
000023
000024 77  WS-COUNT                 PIC 9(008) COMP-5 VALUE 0.
000025
000026 Procedure Division.
000027     DISPLAY MYNAME ' Begin'
000028     
000029     XML PARSE WS-BUF PROCESSING PROCEDURE 1000-para END-XML
000030
000031     XML PARSE
000032         WS-BUF
000033         ENCODING 37
000034         VALIDATING OSR-DATA
000035         PROCESSING PROCEDURE 1000-para
000036         EXCEPTION CALL 'CEE3ABD' END-CALL
000037         NOT EXCEPTION PERFORM 2000-para
000038     END-XML
000039
000040     XML PARSE
000041         WS-BUF
000042         WITH ENCODING 37
000043         RETURNING NATIONAL
000044         VALIDATING WITH OSR-DATA
000045         PROCESSING PROCEDURE IS 1000-para
000046         ON EXCEPTION CALL 'CEE3ABD'
000047         NOT ON EXCEPTION PERFORM 2000-para
000048     END-XML
000049
000050     XML PARSE
000051         WS-BUF
000052         WITH ENCODING 37
000053         RETURNING NATIONAL
000054         VALIDATING WITH FILE OSR-DATA-FILE
000055         PROCESSING PROCEDURE IS 1000-para
000056         ON EXCEPTION CALL 'CEE3ABD'
000057         NOT ON EXCEPTION PERFORM 2000-para
000058     END-XML
000059
000060     XML PARSE WS-BUF PROCESSING PROCEDURE 1000-para THRU 
000061     1001-end END-XML
000062
000063     XML PARSE
000064         WS-BUF
000065         ENCODING 37
000066         VALIDATING OSR-DATA
000067         PROCESSING PROCEDURE 1000-para THRU 1001-end
000068         EXCEPTION CALL 'CEE3ABD'
000069         NOT EXCEPTION PERFORM 2000-para
000070     END-XML
000071
000072     XML PARSE
000073         WS-BUF
000074         WITH ENCODING 37
000075         RETURNING NATIONAL
000076         VALIDATING WITH OSR-DATA
000077         PROCESSING PROCEDURE IS 1000-para THRU 1001-end
000078         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000079         NOT ON EXCEPTION PERFORM 2000-para
000080     END-XML
000081
000082     XML PARSE
000083         WS-BUF
000084         WITH ENCODING 37
000085         RETURNING NATIONAL
000086         VALIDATING WITH FILE OSR-DATA-FILE
000087         PROCESSING PROCEDURE IS 1000-para THRU 1001-end
000088         ON EXCEPTION CALL 'CEE3ABD'
000089         NOT ON EXCEPTION PERFORM 2000-para
000090     END-XML
000091
000092     DISPLAY MYNAME ' End'
000093     
000094     GOBACK
000095     .
000096
000097 1000-para.
000098
000099     .
000100
000101 1001-end.
000102
000103     .
000104
000105 2000-para.
000106
000107     .
000108
