       ID Division.
       >>DEFINE A B'1'
       >>DEFINE B B'0'
       >>DEFINE C B'1'
       >>DEFINE D B'0'
       >>IF A AND B 
       >>IF (((((A AND B))))) 
       >>IF A AND (B OR C)
       >>IF (A AND B) OR D  
       >>IF A AND (B AND (C OR D)) 
       >>IF B AND (C OR D)  
       >>IF (B AND C) OR D  
       >>IF A AND (B OR C) AND D 
       Program-ID. test9007.
       Procedure Division.
           GOBACK.
