000001 Identification Division.
000002 Program-ID. testantlr133.
000003 Data Division.
000004 Working-Storage Section.
000005 01  CONSTANTS.
000006     05  MYNAME               PIC X(012) VALUE 'testantlr133'.
000007
000008* 
000009 01  SWITCHES.
000010     05  SD-001-TRUTH-SW      PIC X(008).
000011         88  SD-001-TRUTH     VALUE 'ZAPHOD'.
000012         88  SD-001-ALSO-TRUE VALUE 'FPREFECT'.
000013
000014 01  SOME-DATA.
000015     05  SD-001               PIC X(008).
000016     05  SD-002.
000017         10  SD-002-A         PIC X(001).
000018         10  SD-002-B         PIC X(001).
000019     05  SD-003               PIC X(008).
000020
000021 01  WS-BUF                   PIC X(100).
000022
000023 77  WS-COUNT                 PIC 9(008) COMP-5 VALUE 0.
000024
000025 Procedure Division.
000026     DISPLAY MYNAME ' Begin'
000027     
000028     JSON PARSE WS-BUF INTO SOME-DATA END-JSON
000029
000030     JSON PARSE WS-BUF INTO SOME-DATA 
000031       ENCODING 37
000032     END-JSON
000033
000034     JSON PARSE WS-BUF INTO SOME-DATA 
000035       ENCODING WS-COUNT
000036     END-JSON
000037
000038     JSON PARSE WS-BUF INTO SOME-DATA 
000039       ENCODING FROM CODEPAGE
000040     END-JSON
000041
000042     JSON PARSE
000043         WS-BUF INTO SOME-DATA
000044         DETAIL
000045         NAME SD-001 'ARTHUR'
000046              SD-002 'DENT'
000047         SUPPRESS 
000048              SD-001
000049              SD-002
000050         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000051         NOT ON EXCEPTION PERFORM 1000-para
000052     END-JSON
000053
000054     JSON PARSE
000055         WS-BUF INTO SOME-DATA
000056         WITH DETAIL
000057         NAME OF SD-001 IS 'ARTHUR'
000058                 SD-002 IS OMITTED
000059         SUPPRESS SD-001 SD-003
000060         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000061         NOT ON EXCEPTION PERFORM 1000-para
000062     END-JSON
000063
000064     JSON PARSE
000065         WS-BUF INTO SOME-DATA
000066         WITH DETAIL
000067         NAME OF SD-001 IS 'ARTHUR'
000068                 SD-002 IS OMITTED
000069         SUPPRESS SD-001 SD-003
000070         CONVERTING SD-001 FROM JSON BOOLEAN USING SD-001-TRUTH
000071         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000072         NOT ON EXCEPTION PERFORM 1000-para
000073     END-JSON
000074
000075     JSON PARSE
000076         WS-BUF INTO SOME-DATA
000077         WITH DETAIL
000078         NAME OF SD-001 IS 'ARTHUR'
000079                 SD-002 IS OMITTED
000080         SUPPRESS SD-001 SD-003
000081         CONVERTING 
000082                SD-001 FROM JSON BOOLEAN 
000083                    USING SD-001-TRUTH AND SD-001-ALSO-TRUE
000084         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000085         NOT ON EXCEPTION PERFORM 1000-para
000086     END-JSON
000087
000088     JSON PARSE
000089         WS-BUF INTO SOME-DATA
000090         WITH DETAIL
000091         NAME OF SD-001 IS 'ARTHUR'
000092                 SD-002 IS OMITTED
000093         SUPPRESS SD-001 SD-003
000094         CONVERTING 
000095                SD-001 FROM JSON BOOLEAN 
000096                    USING 'TRILLIAN' AND 'MARVIN'
000097         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000098         NOT ON EXCEPTION PERFORM 1000-para
000099     END-JSON
000100
000101     JSON PARSE
000102         WS-BUF INTO SOME-DATA
000103         WITH DETAIL
000104         NAME OF SD-001 IS 'ARTHUR'
000105                 SD-002 IS OMITTED
000106         SUPPRESS SD-001 SD-003
000107         CONVERTING 
000108                SD-001 FROM JSON BOOLEAN 
000109                    USING SD-001-TRUTH AND SD-001-ALSO-TRUE
000110           ALSO
000111                SD-002 FROM BOOL USING '%%'
000112         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000113         NOT ON EXCEPTION PERFORM 1000-para
000114     END-JSON
000115
000116     JSON PARSE
000117         WS-BUF INTO SOME-DATA
000118         WITH DETAIL
000119         NAME OF SD-001 IS 'ARTHUR'
000120                 SD-002 IS OMITTED
000121         SUPPRESS SD-001 SD-003
000122         CONVERTING 
000123                SD-001 FROM JSON BOOLEAN 
000124                    USING SD-001-TRUTH AND SD-001-ALSO-TRUE
000125           ALSO
000126                SD-002 FROM BOOL USING '%%' AND '##'
000127         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000128         NOT ON EXCEPTION PERFORM 1000-para
000129     END-JSON
000130
000131     JSON PARSE
000132         WS-BUF INTO SOME-DATA
000133         WITH DETAIL
000134         NAME OF SD-001 IS 'ARTHUR'
000135                 SD-002 IS OMITTED
000136         SUPPRESS SD-001 SD-003
000137         CONVERTING SD-003 FROM JSON NULL USING SPACES
000138         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000139         NOT ON EXCEPTION PERFORM 1000-para
000140     END-JSON
000141
000142     JSON PARSE
000143         WS-BUF INTO SOME-DATA
000144         WITH DETAIL
000145         NAME OF SD-001 IS 'ARTHUR'
000146                 SD-002 IS OMITTED
000147         SUPPRESS SD-001 SD-003
000148         CONVERTING SD-003 FROM NULL USING SPACES
000149         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000150         NOT ON EXCEPTION PERFORM 1000-para
000151     END-JSON
000152
000153
000154     DISPLAY MYNAME ' End'
000155     
000156     GOBACK
000157     .
000158
000159 1000-para.
000160
000161     .
000162
