000001 Identification Division.
000002 Program-ID. testantlr130.
000003 Data Division.
000004 Working-Storage Section.
000005 01  CONSTANTS.
000006     05  MYNAME               PIC X(012) VALUE 'testantlr130'.
000007
000008* 
000009 01  SOME-DATA.
000010     05  SD-001               PIC X(008).
000011     05  SD-002.
000012         10  SD-002-A         PIC X(001).
000013         10  SD-002-B         PIC X(001).
000014     05  SD-003               PIC X(008).
000015
000016 01  WS-BUF                   PIC X(100).
000017
000018 77  WS-COUNT                 PIC 9(008) COMP-5 VALUE 0.
000019
000020 Procedure Division.
000021     DISPLAY MYNAME ' Begin'
000022     
000023     XML GENERATE WS-BUF FROM SOME-DATA END-XML
000024
000025     XML GENERATE
000026         WS-BUF FROM SOME-DATA
000027         COUNT WS-COUNT
000028         ENCODING 37
000029         XML-DECLARATION
000030         ATTRIBUTES
000031         NAMESPACE 'AEIOU'
000032         NAMESPACE-PREFIX 'ZZ9PLURALZA'
000033         NAME SD-001 'ARTHUR'
000034              SD-002 'DENT'
000035         TYPE SD-003 ELEMENT SD-002-A ATTRIBUTE SD-002-B CONTENT
000036         SUPPRESS EVERY NONNUMERIC ELEMENT WHEN LOW-VALUES
000037                  EVERY NUMERIC ELEMENT 
000038                        WHEN LOW-VALUES OR HIGH-VALUES
000039         ON EXCEPTION PERFORM 1000-para
000040         NOT ON EXCEPTION CALL 'CEE3ABD'
000041     END-XML
000042
000043     XML GENERATE
000044         WS-BUF FROM SOME-DATA
000045         COUNT IN WS-COUNT
000046         WITH ENCODING 37
000047         WITH XML-DECLARATION
000048         WITH ATTRIBUTES
000049         NAMESPACE IS 'AEIOU'
000050         NAMESPACE-PREFIX IS 'ZZ9PLURALZA'
000051         NAME OF SD-001 IS 'ARTHUR'
000052                 SD-002 IS 'DENT'
000053         TYPE OF SD-003 IS ELEMENT
000054                 SD-002-A IS ATTRIBUTE
000055                 SD-002-B IS CONTENT
000056         SUPPRESS EVERY NONNUMERIC ELEMENT WHEN LOW-VALUES
000057                  SD-001 WHEN ZERO OR ZEROES OR ZEROS
000058                  EVERY NUMERIC ELEMENT 
000059                        WHEN LOW-VALUES OR HIGH-VALUES
000060                  SD-003 WHEN HIGH-VALUES
000061         ON EXCEPTION PERFORM 1000-para
000062         NOT ON EXCEPTION CALL 'CEE3ABD'
000063     END-XML
000064
000065
000066     DISPLAY MYNAME ' End'
000067     
000068     GOBACK
000069     .
000070
000071 1000-para.
000072
000073     .
000074
