000001 Identification Division.
000002 Program-ID. testantlr148.
000003 Data Division.
000004 Working-Storage Section.
000005
000006 >>DEFINE JULIA 'WICKER'
000007 >>DEFINE ELIOT 'WAUGH'
000008 >>DEFINE PENNY 'ADIYODI'
000009 >>DEFINE MARGOT 'HANSON'
000010 >>DEFINE ALICE 'QUINN'
000011 >>DEFINE QUENTIN 'COLDWATER'
000012 >>DEFINE KADY 'ORLOFF-DIAZ'
000013 >>DEFINE JOSH 'HOBERMAN'
000014
000015 01  CONSTANTS.
000016     05  MYNAME               PIC X(012) VALUE 'testantlr148'.
000017     05  PGM-0001             PIC X(008) VALUE 'PGMA0001'.
000018     05  PGM-0002             PIC X(008) VALUE 'PGMA0002'.
000019     05  PGM-0003             PIC X(008) VALUE 'PGMA0003'.
000020     05  PGM-0004             PIC X(008) VALUE 'PGMA0004'.
000021     05  PGM-0005             PIC X(008) VALUE 'PGMA0005'.
000022     05  PGM-0006             PIC X(008) VALUE 'PGMA0006'.
000023     05  PGM-0007             PIC X(008) VALUE 'PGMA0007'.
000024     05  PGM-0008             PIC X(008) VALUE 'PGMA0008'.
000025     05  PGM-0009             PIC X(008) VALUE 'PGMA0009'.
000026
000027*
000028
000029 Procedure Division.
000030     DISPLAY MYNAME ' Begin'
000031
000032     >>EVALUATE TRUE
000033     >>WHEN JULIA = 'WICKER'
000034     CALL PGM-0001 USING
000035       MYNAME
000036     END-CALL
000037     >>WHEN ELIOT = 'WAUGH'
000038     CALL PGM-0002
000039       MYNAME
000040     END-CALL
000041     >>WHEN PENNY = 'ADIYODI'
000042     CALL PGM-0003
000043       MYNAME
000044     END-CALL
000045     >>WHEN MARGOT = 'HANSON'
000046     CALL PGM-0004
000047       MYNAME
000048     END-CALL
000049     >>WHEN ALICE = 'QUINN'
000050     CALL PGM-0005
000051       MYNAME
000052     END-CALL
000053     >>WHEN QUENTIN = 'COLDWATER'
000054     CALL PGM-0006
000055       MYNAME
000056     END-CALL
000057     >>WHEN KADY = 'ORLOFF-DIAZ'
000058     CALL PGM-0007
000059       MYNAME
000060     END-CALL
000061     >>WHEN JOSH = 'HOBERMAN'
000062     CALL PGM-0008
000063       MYNAME
000064     END-CALL
000065     >>WHEN OTHER
000066     CALL PGM-0009
000067       MYNAME
000068     END-CALL
000069     >>END-EVALUATE
000070
000071     DISPLAY MYNAME ' End'
000072     
000073     GOBACK
000074     .
000075
000076
