000001 Identification Division.
000002 Program-ID. testantlr105.
000003 Data Division.
000004 Working-Storage Section.
000005 01  CONSTANTS.
000006     05  MYNAME               PIC X(012) VALUE 'testantlr105'.
000007     05  PGM-0001             PIC X(008) VALUE 'PGMA0001'.
000008
000009 Procedure Division.
000010     DISPLAY MYNAME ' Begin'
000011     
000012     CALL PGM-0001 USING MYNAME END-CALL
000013     
000014     GOBACK
000015     .
000016
000017 1000-para.
000018
000019     .
000020
