       Identification Division.
       Program-ID.    test034a.
      * Permutations and combinations of OPTIONS paragraph.
       Options.
       Procedure Division.
           GOBACK.
       End Program test034a.

       Identification Division.
       Program-ID.    test034b.
      * Test lexing and parsing of OPTIONS paragraph.
       Options.
           Arithmetic Native
           Arithmetic Standard-Binary
           Arithmetic Standard-Decimal
           Arithmetic Is Native
           Arithmetic Is Standard-Binary
           Arithmetic Is Standard-Decimal
           Default Rounded Away-From-Zero
           Default Rounded Nearest-Away-From-Zero
           Default Rounded Nearest-Even
           Default Rounded Nearest-Toward-Zero
           Default Rounded Prohibited
           Default Rounded Toward-Greater
           Default Rounded Toward-Lesser
           Default Rounded Truncation
           Default Rounded Mode Away-From-Zero
           Default Rounded Mode Nearest-Away-From-Zero
           Default Rounded Mode Nearest-Even
           Default Rounded Mode Nearest-Toward-Zero
           Default Rounded Mode Prohibited
           Default Rounded Mode Toward-Greater
           Default Rounded Mode Toward-Lesser
           Default Rounded Mode Truncation
           Default Rounded Is Away-From-Zero
           Default Rounded Is Nearest-Away-From-Zero
           Default Rounded Is Nearest-Even
           Default Rounded Is Nearest-Toward-Zero
           Default Rounded Is Prohibited
           Default Rounded Is Toward-Greater
           Default Rounded Is Toward-Lesser
           Default Rounded Is Truncation
           Default Rounded Mode Is Away-From-Zero
           Default Rounded Mode Is Nearest-Away-From-Zero
           Default Rounded Mode Is Nearest-Even
           Default Rounded Mode Is Nearest-Toward-Zero
           Default Rounded Mode Is Prohibited
           Default Rounded Mode Is Toward-Greater
           Default Rounded Mode Is Toward-Lesser
           Default Rounded Mode Is Truncation
           Entry-Convention COBOL
           Entry-Convention MyOwn
           Entry-Convention Is COBOL
           Entry-Convention Is MyOwn
           Float-Binary High-Order-Left
           Float-Binary High-Order-Right
           Float-Binary Default High-Order-Left
           Float-Binary Default High-Order-Right
           Float-Binary Is High-Order-Left
           Float-Binary Is High-Order-Right
           Float-Binary Default Is High-Order-Left
           Float-Binary Default Is High-Order-Right
           Float-Decimal Binary-Encoding
           Float-Decimal Decimal-Encoding
           Float-Decimal High-Order-Left
           Float-Decimal High-Order-Right
           Float-Decimal Default Binary-Encoding
           Float-Decimal Default Decimal-Encoding
           Float-Decimal Default High-Order-Left
           Float-Decimal Default High-Order-Right
           Float-Decimal Is Binary-Encoding
           Float-Decimal Is Decimal-Encoding
           Float-Decimal Is High-Order-Left
           Float-Decimal Is High-Order-Right
           Float-Decimal Default Is Binary-Encoding
           Float-Decimal Default Is Decimal-Encoding
           Float-Decimal Default Is High-Order-Left
           Float-Decimal Default Is High-Order-Right
           Initialize All Binary Zeroes
           Initialize All x'81'
           Initialize All Spaces
           Initialize Local-Storage Binary Zeroes
           Initialize Local-Storage x'81'
           Initialize Local-Storage Spaces
           Initialize Screen Binary Zeroes
           Initialize Screen x'81'
           Initialize Screen Spaces
           Initialize Working-Storage Binary Zeroes
           Initialize Working-Storage x'81'
           Initialize Working-Storage Spaces
           Initialize All Section Binary Zeroes
           Initialize All Section x'81'
           Initialize All Section Spaces
           Initialize Local-Storage Section Binary Zeroes
           Initialize Local-Storage Section x'81'
           Initialize Local-Storage Section Spaces
           Initialize Screen Section Binary Zeroes
           Initialize Screen Section x'81'
           Initialize Screen Section Spaces
           Initialize Working-Storage Section Binary Zeroes
           Initialize Working-Storage Section x'81'
           Initialize Working-Storage Section Spaces
           Initialize All To Binary Zeroes
           Initialize All To x'81'
           Initialize All To Spaces
           Initialize Local-Storage To Binary Zeroes
           Initialize Local-Storage To x'81'
           Initialize Local-Storage To Spaces
           Initialize Screen To Binary Zeroes
           Initialize Screen To x'81'
           Initialize Screen To Spaces
           Initialize Working-Storage To Binary Zeroes
           Initialize Working-Storage To x'81'
           Initialize Working-Storage To Spaces
           Initialize All Section To Binary Zeroes
           Initialize All Section To x'81'
           Initialize All Section To Spaces
           Initialize Local-Storage Section To Binary Zeroes
           Initialize Local-Storage Section To x'81'
           Initialize Local-Storage Section To Spaces
           Initialize Screen Section To Binary Zeroes
           Initialize Screen Section To x'81'
           Initialize Screen Section To Spaces
           Initialize Working-Storage Section To Binary Zeroes
           Initialize Working-Storage Section To x'81'
           Initialize Working-Storage Section To Spaces
           .
       Procedure Division.
           GOBACK.
       End Program test034b.


