000001 Identification Division.
000002 Program-ID. testantlr120.
000003 Data Division.
000004 Working-Storage Section.
000005
000006 01  CONSTANTS.
000007     05  MYNAME               PIC X(012) VALUE 'testantlr120'.
000008
000009 01 WORK-AREAS.
000010    05  PGM-0004              PIC X(008) VALUE SPACES.
000011    05  PGM-0005              PIC X(008) VALUE SPACES.
000012        88  PGMB5                        VALUE 'PGMB0005'.
000013    05  PGM-0008-VAL          PIC X(008) VALUE 'PGMK0008'.
000014    05  PGM-0008 REDEFINES PGM-0008-VAL PIC X(008).
000015
000016 Procedure Division.
000017     DISPLAY MYNAME ' Begin'
000018     
000019     CALL PGM-0008
000020
000021     DISPLAY MYNAME ' End'
000022     
000023     GOBACK
000024     .
000025
000026
