>>SOURCE FORMAT IS FREE
       >>SOURCE FORMAT IS FIXED                                         00000001
       Identification Division.                                         00000002
       Program-ID. test9045a.                                           00000003
       Environment Division.                                            00000004
       Configuration Section.                                           00000005
       Data Division.                                                   00000006
       Working-Storage Section.                                         00000007
       01  CONSTANTS.                                                   00000008
           05  MYNAME                  PIC X(009) VALUE 'test9045a'.    00000009
                                                                        00000010
       Procedure Division.                                              00000011
           DISPLAY MYNAME                                               00000012
           GOBACK.                                                      00000013
       End Program test9045a.                                           00000014
>>SOURCE FORMAT IS FREE
Identification Division.
Program-ID. test9045b.
Environment Division.
Configuration Section.
Data Division.
Working-Storage Section.
01  CONSTANTS.
    05  MYNAME                  PIC X(009) VALUE 'test9045b'.

Procedure Division.
    DISPLAY MYNAME
    GOBACK.
End Program test9045b.
       >>SOURCE FORMAT IS FIXED                                         00000029
       Identification Division.                                         00000030
       Program-ID. test9045c.                                           00000031
       Environment Division.                                            00000032
       Configuration Section.                                           00000033
       Data Division.                                                   00000034
       Working-Storage Section.                                         00000035
       01  CONSTANTS.                                                   00000036
           05  MYNAME                  PIC X(009) VALUE 'test9045c'.    00000037
                                                                        00000038
       Procedure Division.                                              00000039
           DISPLAY MYNAME                                               00000040
           GOBACK.                                                      00000041
       End Program test9045c.                                           00000042
                                                                        >>SOURCE FORMAT IS FREE
                                                                        Identification Division.
                                                                        Program-ID. test9045d.
                                                                        Environment Division.
                                                                        Configuration Section.
                                                                        Data Division.
                                                                        Working-Storage Section.
                                                                        01  CONSTANTS.
                                                                            05  MYNAME                  PIC X(009) VALUE 'test9045d'.
                                                                        
                                                                        Procedure Division.
                                                                            DISPLAY MYNAME
                                                                            GOBACK.
                                                                        End Program test9045d.

