000001 Identification Division.
000002 Program-ID. testantlr129.
000003 Data Division.
000004 Working-Storage Section.
000005
000006 01  CONSTANTS.
000007     05  MYNAME               PIC X(012) VALUE 'testantlr129'.
000008
000009 01 WORK-AREAS.
000010    05  PGM-0004              PIC X(008) VALUE SPACES.
000011    05  PGM-0005              PIC X(008) VALUE SPACES.
000012        88  PGMB5                        VALUE 'PGMB0005'.
000013    05  PGM-0008-VAL          PIC X(008) VALUE 'PGMK0008'.
000014    05  PGM-0008 REDEFINES PGM-0008-VAL PIC X(008).
000015    05  ABC.
000016        10  PGM-0010          PIC X(008) VALUE 'PGMM0010'.
000017    05  DEF.
000018        10  PGM-0010          PIC X(008) VALUE 'PGMN0010'.
000019    05  GHI.
000020        10  ABC.
000021            15  PGM-0010      PIC X(008) VALUE 'PGMO0010'.
000022
000023 Procedure Division.
000024     DISPLAY MYNAME ' Begin'
000025     
000026     CALL PGM-0008
000027
000028     CALL PGM-0010 OF ABC OF GHI
000029
000030     MOVE 'PGMA0004' TO PGM-0004
000031     CALL PGM-0004
000032
000033     DISPLAY MYNAME ' End'
000034     
000035     GOBACK
000036     .
000037
000038 1000-para.
000039
000040     MOVE 'PGMB0004' TO PGM-0004
000041     CALL PGM-0004
000042
000043     .
000044
