000001 IDENTIFICATION DIVISION.                                         00000001
000002 PROGRAM-ID.                                                      00000002
000003     testantlr359.                                                00000003
000004 ENVIRONMENT DIVISION.                                            00000004
000005 CONFIGURATION SECTION.                                           00000005
000006 SOURCE-COMPUTER.                                                 00000006
000007     XXXXX082.                                                    00000007
000008 OBJECT-COMPUTER.                                                 00000008
000009     XXXXX083.                                                    00000009
000010 INPUT-OUTPUT SECTION.                                            00000010
000011 FILE-CONTROL.                                                    00000011
000012 DATA DIVISION.                                                   00000012
000013 FILE SECTION.                                                    00000013
000014 WORKING-STORAGE SECTION.                                         00000014
000015 01 WORK-AREAS.                                                   00000015
000016     05                                                           00000016
000017                                                                 C00000017
000018-                                                                O00000018
000019-                                                                U00000019
000020-                                                                N00000020
000021-                                                                T00000021
000022-                                                                E00000022
000023-                                                                R00000023
000024                                                                 P00000024
000025-                                                                I00000025
000026-                                                                C00000026
000027                                                                 S00000027
000028-                                                                900000028
000029-                                                                (00000029
000030-                                                                000000030
000031-                                                                000000031
000032-                                                                500000032
000033-                                                                )00000033
000034                                                                 C00000034
000035-                                                                O00000035
000036-                                                                M00000036
000037-                                                                P00000037
000038-                                                                -00000038
000039-                                                                300000039
000040                                                                 V00000040
000041-                                                                A00000041
000042-                                                                L00000042
000043-                                                                U00000043
000044-                                                                E00000044
000045                                                                 +00000045
000046-                                                                000000046
000047-                                                                .00000047
000048 PROCEDURE DIVISION.                                              00000048
000049 CCVS1 SECTION.                                                   00000049
000050 OPEN-FILES.                                                      00000050
000051     ADD 1 TO                                                    C00000051
000052-                                                                O00000052
000053-                                                                U00000053
000054-                                                                N00000054
000055-                                                                T00000055
000056-                                                                E00000056
000057-                                                                R00000057
000058                                                                  00000058
000059     ADD                                                          00000059
000060                                                                 100000060
000061-                                                                000000061
000062                                                                  00000062
000063     TO                                                           00000063
000064                                                                 C00000064
000065-                                                                O00000065
000066-                                                                U00000066
000067-                                                                N00000067
000068-                                                                T00000068
000069-                                                                E00000069
000070-                                                                R00000070
000071                                                                  00000071
000072                                                                  00000072
000073                                                               DIS00000073
000074-                                                             PLAY00000074
000075     COUNTER                                                      00000075
000076     GOBACK.                                                      00000076
000077                                                                  00000077
