       PROCESS DEFINE(SPECIAL-CODE=1)
       PROCESS DEFINE(SPECIAL-CODE='X')
       PROCESS DEFINE(SPECIAL-CODE=B'1')
       PROCESS DEFINE(SPECIAL-CODE=B'0')
       PROCESS DEFINE(SPECIAL-CODE=X'BADF00D1')
       PROCESS DEFINE(SPECIAL-CODE,1)
       PROCESS DEFINE(SPECIAL-CODE,'X')
       PROCESS DEFINE(SPECIAL-CODE,B'1')
       PROCESS DEFINE(SPECIAL-CODE,B'0')
       PROCESS DEFINE(SPECIAL-CODE,X'BADF00D1')
       PROCESS DEFINE(SPECIAL-CODE)
       ID Division.
       Program-ID. test9008.
       Procedure Division.
           GOBACK.
