000001 ID Division.
000002 Program-ID. testantlr150.
000003 Procedure Division.
000004
000005 >>DEFINE A 1
000006 >>DEFINE B 2
000007 >>DEFINE C 3
000008 >>DEFINE D A + B * C
000009 >>DEFINE E (A + B) * C
000010 >>DEFINE F A + (B * C)
000011
000012     >>EVALUATE D
000013     >>WHEN 9
000014     CALL 'D#IS#9'
000015     >>WHEN 7
000016     CALL 'D#IS#7'
000017     >>WHEN OTHER
000018     CALL 'WHATTHE#'
000019     >>END-EVALUATE
000020
000021     >>EVALUATE E
000022     >>WHEN 9
000023     CALL 'E#IS#9'
000024     >>WHEN 7
000025     CALL 'E#IS#7'
000026     >>WHEN OTHER
000027     CALL 'WHATTHE#'
000028     >>END-EVALUATE
000029
000030     >>EVALUATE F
000031     >>WHEN 9
000032     CALL 'F#IS#9'
000033     >>WHEN 7
000034     CALL 'F#IS#7'
000035     >>WHEN OTHER
000036     CALL 'WHATTHE#'
000037     >>END-EVALUATE
000038
000039
000040     GOBACK.
