       IDENTIFICATION DIVISION.
       PROGRAM-ID.
           testantlr059.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
           XXXXX082.
       OBJECT-COMPUTER.
           XXXXX083.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 WORK-AREAS.
           05
                                                                       C
      -                                                                O
      -                                                                U
      -                                                                N
      -                                                                T
      -                                                                E
      -                                                                R
                                                                       P
      -                                                                I
      -                                                                C
                                                                       S
      -                                                                9
      -                                                                (
      -                                                                0
      -                                                                0
      -                                                                5
      -                                                                )
                                                                       C
      -                                                                O
      -                                                                M
      -                                                                P
      -                                                                -
      -                                                                3
                                                                       V
      -                                                                A
      -                                                                L
      -                                                                U
      -                                                                E
                                                                       +
      -                                                                0
      -                                                                .
       PROCEDURE DIVISION.
       CCVS1 SECTION.
       OPEN-FILES.
           ADD 1 TO                                                    C
      -                                                                O
      -                                                                U
      -                                                                N
      -                                                                T
      -                                                                E
      -                                                                R

           ADD 
                                                                       1
      -                                                                0

           TO
                                                                       C
      -                                                                O
      -                                                                U
      -                                                                N
      -                                                                T
      -                                                                E
      -                                                                R


                                                                     DIS
      -                                                             PLAY 
           COUNTER
           GOBACK.

