000001 Identification Division.
000002 Program-ID. testantlr117.
000003 Data Division.
000004 Working-Storage Section.
000005
000006 01  CONSTANTS.
000007     05  MYNAME               PIC X(012) VALUE 'testantlr117'.
000008
000009 01 WORK-AREAS.
000010    05  PGM-0004              PIC X(008) VALUE SPACES.
000011    05  PGM-0005              PIC X(008) VALUE SPACES.
000012        88  PGMB5                        VALUE 'PGMB0005'.
000013    05  PGM-0008-VAL          PIC X(008) VALUE 'PGMK0008'.
000014    05  PGM-0008 REDEFINES PGM-0008-VAL PIC X(008).
000015    05  ABC.
000016        10  PGM-0010          PIC X(008) VALUE 'PGMM0010'.
000017    05  DEF.
000018        10  PGM-0010          PIC X(008) VALUE 'PGMN0010'.
000019    05  GHI.
000020        10  ABC.
000021            15  PGM-0010      PIC X(008) VALUE 'PGMO0010'.
000022
000023 Procedure Division.
000024     DISPLAY MYNAME ' Begin'
000025     
000026
000027     DISPLAY MYNAME ' End'
000028     
000029     GOBACK
000030     .
000031
000032 1000-para.
000033
000034     SET PGMB5 TO TRUE
000035     CALL PGM-0005
000036
000037     .
000038
