       Identification Division.
       Class-ID. test32aa.

       Identification Division.
       Factory.
       Procedure Division.
           GOBACK.

       Identification Division.
       Method-ID. someMethod.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. someOtherMethod As "SOMEOTHERMETHOD".
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. Get Property Stuff.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. Set Property Stuff.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. someMethod Override.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. someOtherMethod As "SOMEOTHERMETHOD" Override.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. Get Property Stuff Override.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. Set Property Stuff Override.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. someMethod Final.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. someOtherMethod As "SOMEOTHERMETHOD" Final.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. Get Property Stuff Final.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. Set Property Stuff Final.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. someMethod Is Final.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. someOtherMethod As "SOMEOTHERMETHOD" Is Final.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. Get Property Stuff Is Final.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. Set Property Stuff Is Final.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. someMethod Override Final.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. someOtherMethod As "SOMEOTHERMETHOD" Override Final.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. Get Property Stuff Override Final.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. Set Property Stuff Override Final.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. someMethod Override Is Final.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. someOtherMethod As "SOMEOTHERMETHOD" 
           Override Is Final.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. Get Property Stuff Override Is Final.
       Procedure Division.
           GOBACK.
       End Method.
       
       Identification Division.
       Method-ID. Set Property Stuff Override Is Final.
       Procedure Division.
           GOBACK.
       End Method.
       
       End Factory.

       Identification Division.
       Factory. Implements InterfaceMcInterfaceFace.
       Procedure Division.
           GOBACK.
       End Factory.

       Identification Division.
       Object.
       Procedure Division.
           GOBACK.
       End Object.
       
       End Class test32aa.


