       Identification Division.
       Program-ID.    test036a.
      * Permutations and combinations of SPECIAL-NAMES paragraph.
       Environment Division.
       Configuration Section.
       Special-Names.
       Procedure Division.
           GOBACK.
       End Program test036a.

       Identification Division.
       Program-ID.    test036ab
      * Permutations and combinations of SPECIAL-NAMES paragraph.
       Environment Division.
       Configuration Section.
       Special-Names.
           Alphabet Farscape Locale
           Alphabet Farscape Locale UnchartedTerritories
           Alphabet Farscape Native
           Alphabet Farscape Standard-1
           Alphabet Farscape Standard-2
           Alphabet Farscape TormentedSpace
           Alphabet Farscape 'a' Through 'z'
           Alphabet Farscape 'a' Thru 'z'
           Alphabet Farscape 'a' Also 'b' Also 'c'
           Alphabet Farscape Is Locale
           Alphabet Farscape Is Locale UnchartedTerritories
           Alphabet Farscape Is Native
           Alphabet Farscape Is Standard-1
           Alphabet Farscape Is Standard-2
           Alphabet Farscape Is TormentedSpace
           Alphabet Farscape Is 'a' Through 'z'
           Alphabet Farscape Is 'a' Thru 'z'
           Alphabet Farscape Is 'a' Also 'b' Also 'c'
           Alphabet Farscape Alphanumeric Locale
           Alphabet Farscape Alphanumeric Locale UnchartedTerritories
           Alphabet Farscape Alphanumeric Native
           Alphabet Farscape Alphanumeric Standard-1
           Alphabet Farscape Alphanumeric Standard-2
           Alphabet Farscape Alphanumeric TormentedSpace
           Alphabet Farscape Alphanumeric 'a' Through 'z'
           Alphabet Farscape Alphanumeric 'a' Thru 'z'
           Alphabet Farscape Alphanumeric 'a' Also 'b' Also 'c'
           Alphabet Farscape For Alphanumeric Locale
           Alphabet Farscape For Alphanumeric 
               Locale UnchartedTerritories
           Alphabet Farscape For Alphanumeric Native
           Alphabet Farscape For Alphanumeric Standard-1
           Alphabet Farscape For Alphanumeric Standard-2
           Alphabet Farscape For Alphanumeric TormentedSpace
           Alphabet Farscape For Alphanumeric 'a' Through 'z'
           Alphabet Farscape For Alphanumeric 'a' Thru 'z'
           Alphabet Farscape For Alphanumeric 'a' Also 'b' Also 'c'
           Alphabet Farscape For Alphanumeric Is Locale
           Alphabet Farscape For Alphanumeric Is 
               Locale UnchartedTerritories
           Alphabet Farscape For Alphanumeric Is Native
           Alphabet Farscape For Alphanumeric Is Standard-1
           Alphabet Farscape For Alphanumeric Is Standard-2
           Alphabet Farscape For Alphanumeric Is TormentedSpace
           Alphabet Farscape For Alphanumeric Is 'a' Through 'z'
           Alphabet Farscape For Alphanumeric Is 'a' Thru 'z'
           Alphabet Farscape For Alphanumeric Is 'a' Also 'b' Also 'c'
           .
       Procedure Division.
           GOBACK.
       End Program test036b.

