       Identification Division.
       Program-ID.  test9041.
       Data Division.
       Working-Storage Section.
       01  Work-Areas.
       copy test9041.cpy replacing 
           ==(VARIABLENAME)== by ==Aeryn==.
       copy test9041.cpy replacing 
           ==(VARIABLENAME)== by ==Crichton==.
       copy test9041.cpy replacing 
           ==(VARIABLENAME)== by ==Dargo==.
       copy test9041.cpy replacing 
           ==(VARIABLENAME)== by ==Dominar-Rygel-The-XVI==.
       copy test9041.cpy replacing 
           ==(VARIABLENAME)== by ==Stark==.
       Procedure Division.
           Goback.
