000001 Identification Division.
000002 Program-ID. testantlr141.
000003 Data Division.
000004 Working-Storage Section.
000005
000006 01  CONSTANTS.
000007     05  MYNAME               PIC X(012) VALUE 'testantlr141'.
000008     >>EVALUATE TRUE
000009     >>WHEN X = 3
000010     05  PGM-0001             PIC X(008) VALUE 'PGMA0001'.
000011     >>WHEN OTHER
000012     05  PGM-0001             PIC X(008) VALUE 'PGMA0002'.
000013     >>END-EVALUATE
000014
000015*
000016
000017 Procedure Division.
000018     DISPLAY MYNAME ' Begin'
000019     CALL PGM-0001
000020
000021     DISPLAY MYNAME ' End'
000022     
000023     GOBACK
000024     .
000025
000026
