       >>SOURCE FORMAT IS FIXED
       Identification Division.
       Program-ID. test9045a.
       Environment Division.
       Configuration Section.
       Data Division.
       Working-Storage Section.
       01  CONSTANTS.
           05  MYNAME                  PIC X(009) VALUE 'test9045a'.

       Procedure Division.
           DISPLAY MYNAME
           GOBACK.
       End Program test9045a.
>>SOURCE FORMAT IS FREE
Identification Division.
Program-ID. test9045b.
Environment Division.
Configuration Section.
Data Division.
Working-Storage Section.
01  CONSTANTS.
    05  MYNAME                  PIC X(009) VALUE 'test9045b'.

Procedure Division.
    DISPLAY MYNAME
    GOBACK.
End Program test9045b.
       >>SOURCE FORMAT IS FIXED
       Identification Division.
       Program-ID. test9045c.
       Environment Division.
       Configuration Section.
       Data Division.
       Working-Storage Section.
       01  CONSTANTS.
           05  MYNAME                  PIC X(009) VALUE 'test9045c'.

       Procedure Division.
           DISPLAY MYNAME
           GOBACK.
       End Program test9045c.
                                                                        >>SOURCE FORMAT IS FREE
                                                                        Identification Division.
                                                                        Program-ID. test9045d.
                                                                        Environment Division.
                                                                        Configuration Section.
                                                                        Data Division.
                                                                        Working-Storage Section.
                                                                        01  CONSTANTS.
                                                                            05  MYNAME                  PIC X(009) VALUE 'test9045d'.
                                                                        
                                                                        Procedure Division.
                                                                            DISPLAY MYNAME
                                                                            GOBACK.
                                                                        End Program test9045d.

