       Identification Division.
       Program-ID.    test035a.
      * Permutations and combinations of OBJECT-COMPUTER paragraph.
       Environment Division.
       Configuration Section.
       Object-Computer.
       Procedure Division.
           GOBACK.
       End Program test035a.

       Identification Division.
       Program-ID.    test035ab
      * Permutations and combinations of OBJECT-COMPUTER paragraph.
       Environment Division.
       Configuration Section.
       Object-Computer.
           NCC1701
           Classification StarTrekTOS
           Classification Locale
           Classification System-Default
           Classification User-Default
           Classification StarTrekTOS StarTrekTOS
           Classification StarTrekTOS Locale
           Classification StarTrekTOS System-Default
           Classification StarTrekTOS User-Default
           Classification Locale StarTrekTOS
           Classification Locale Locale
           Classification Locale System-Default
           Classification Locale User-Default
           Classification System-Default StarTrekTOS
           Classification System-Default Locale
           Classification System-Default System-Default
           Classification System-Default User-Default
           Classification User-Default StarTrekTOS
           Classification User-Default Locale
           Classification User-Default System-Default
           Classification User-Default User-Default
           Classification Is StarTrekTOS
           Classification Is Locale
           Classification Is System-Default
           Classification Is User-Default
           Classification Is StarTrekTOS StarTrekTOS
           Classification Is StarTrekTOS Locale
           Classification Is StarTrekTOS System-Default
           Classification Is StarTrekTOS User-Default
           Classification Is Locale StarTrekTOS
           Classification Is Locale Locale
           Classification Is Locale System-Default
           Classification Is Locale User-Default
           Classification Is System-Default StarTrekTOS
           Classification Is System-Default Locale
           Classification Is System-Default System-Default
           Classification Is System-Default User-Default
           Classification Is User-Default StarTrekTOS
           Classification Is User-Default Locale
           Classification Is User-Default System-Default
           Classification Is User-Default User-Default
           Character Classification StarTrekTOS
           Character Classification Locale
           Character Classification System-Default
           Character Classification User-Default
           Character Classification StarTrekTOS StarTrekTOS
           Character Classification StarTrekTOS Locale
           Character Classification StarTrekTOS System-Default
           Character Classification StarTrekTOS User-Default
           Character Classification Locale StarTrekTOS
           Character Classification Locale Locale
           Character Classification Locale System-Default
           Character Classification Locale User-Default
           Character Classification System-Default StarTrekTOS
           Character Classification System-Default Locale
           Character Classification System-Default System-Default
           Character Classification System-Default User-Default
           Character Classification User-Default StarTrekTOS
           Character Classification User-Default Locale
           Character Classification User-Default System-Default
           Character Classification User-Default User-Default
           Character Classification Is StarTrekTOS
           Character Classification Is Locale
           Character Classification Is System-Default
           Character Classification Is User-Default
           Character Classification Is StarTrekTOS StarTrekTOS
           Character Classification Is StarTrekTOS Locale
           Character Classification Is StarTrekTOS System-Default
           Character Classification Is StarTrekTOS User-Default
           Character Classification Is Locale StarTrekTOS
           Character Classification Is Locale Locale
           Character Classification Is Locale System-Default
           Character Classification Is Locale User-Default
           Character Classification Is System-Default StarTrekTOS
           Character Classification Is System-Default Locale
           Character Classification Is System-Default System-Default
           Character Classification Is System-Default User-Default
           Character Classification Is User-Default StarTrekTOS
           Character Classification Is User-Default Locale
           Character Classification Is User-Default System-Default
           Character Classification Is User-Default User-Default
           Classification Alphanumeric StarTrekTOS
           Classification National StarTrekTOS
           Classification Alphanumeric Is StarTrekTOS
           Classification National Is StarTrekTOS
           Classification For Alphanumeric StarTrekTOS
           Classification For National StarTrekTOS
           Classification For Alphanumeric Is StarTrekTOS
           Classification For National Is StarTrekTOS
           Character Classification Alphanumeric StarTrekTOS
           Character Classification National StarTrekTOS
           Character Classification Alphanumeric Is StarTrekTOS
           Character Classification National Is StarTrekTOS
           Character Classification For Alphanumeric StarTrekTOS
           Character Classification For National StarTrekTOS
           Character Classification For Alphanumeric Is StarTrekTOS
           Character Classification For National Is StarTrekTOS
           Sequence StarTrekTOS
           Sequence StarTrekTOS StarTrekTOS
           Sequence Is StarTrekTOS
           Sequence Is StarTrekTOS StarTrekTOS
           Collating Sequence StarTrekTOS
           Collating Sequence StarTrekTOS StarTrekTOS
           Program Sequence StarTrekTOS
           Program Sequence StarTrekTOS StarTrekTOS
           Collating Sequence Is StarTrekTOS
           Collating Sequence Is StarTrekTOS StarTrekTOS
           Program Sequence Is StarTrekTOS
           Program Sequence Is StarTrekTOS StarTrekTOS
           Program Collating Sequence Is StarTrekTOS
           Program Collating Sequence Is StarTrekTOS StarTrekTOS
           Sequence Alphanumeric StarTrekTOS
           Sequence National StarTrekTOS
           Sequence Alphanumeric Is StarTrekTOS
           Sequence National Is StarTrekTOS
           Sequence For Alphanumeric StarTrekTOS
           Sequence For National StarTrekTOS
           Collating Sequence Alphanumeric StarTrekTOS
           Collating Sequence National StarTrekTOS
           Program Sequence Alphanumeric StarTrekTOS
           Program Sequence National StarTrekTOS
           Sequence For Alphanumeric Is StarTrekTOS
           Sequence For National Is StarTrekTOS
           Collating Sequence Alphanumeric Is StarTrekTOS
           Collating Sequence National Is StarTrekTOS
           Program Sequence Alphanumeric Is StarTrekTOS
           Program Sequence National Is StarTrekTOS
           Collating Sequence For Alphanumeric Is StarTrekTOS
           Collating Sequence For National Is StarTrekTOS
           Program Sequence For Alphanumeric Is StarTrekTOS
           Program Sequence For National Is StarTrekTOS
           Program Collating Sequence For Alphanumeric Is StarTrekTOS
           Program Collating Sequence For National Is StarTrekTOS
           Collating Sequence For Alphanumeric StarTrekTOS
           Collating Sequence For National StarTrekTOS
           Program Sequence For Alphanumeric StarTrekTOS
           Program Sequence For National StarTrekTOS
           Program Collating Sequence For Alphanumeric StarTrekTOS
           Program Collating Sequence For National StarTrekTOS
           .
       Procedure Division.
           GOBACK.
       End Program test035b.

