000001 ID Division.                                                     00000001
000002 Program-ID. testantlr358.                                        00000002
000003 Data Division.                                                   00000003
000004 Working-Storage Section.                                         00000004
000005 01  copy         'testantlr358a.cpy'.                            00000005
000006                                          copy testantlr358b.cpy. 00000006
000007                                           copy testantlr358c.cpy 00000007
000008 replacing ==%comp1le error%== by ====                            00000008
000009                                                                . 00000009
000010                                           copy testantlr358c.cpy 00000010
000011 replacing % by ====                                              00000011
000012  comp1le by ====                                                 00000012
000013  error by ====                                                   00000013
000014  ADD by SUBTRACT                                                 00000014
000015  ==MULTIPLY== BY ==DIVIDE==                                      00000015
000016  ONE AND TWO AND THREE BY FOUR AND FIVE AND SIX                  00000016
000017                                                                . 00000017
000018                                           copy testantlr358d.cpy 00000018
000019 replacing ==%comp1le error1%== by ====                           00000019
000020           ==%comp1le error2%== by ====                           00000020
000021                                                                . 00000021
000022                                           copy testantlr358e.cpy 00000022
000023 replacing ==:TAG1:== by ==WS-==                                  00000023
000024 ==:TAG2:== by ==W1-==                                          . 00000024
000025 Procedure Division.                                              00000025
000026     DISPLAY 'Julia'. copy testantlr358f.cpy. DISPLAY 'Wicker'    00000026
000027     DISPLAY 'Eliot'. copy testantlr358f.cpy                      00000027
000028     replacing ==:Hello:== by ==:Howdy:==                         00000028
000029     ==:World:== by ==:Planet:==. DISPLAY 'Waugh'                 00000029
000030     GOBACK.                                                      00000030
