       CONSTANTS.                                                       00000001
           05  MYNAME PIC X(012) VALUE 'testantlr058'.                  00000002
           05  ONE    PIC S9(004) COMP VALUE +1.                        00000003
