       01  :TAG1:WORK-AREAS.                                            00000001
           05  :TAG2:TEXT01 PIC X(080) VALUE 'Alice Quinn'.             00000002
           05  :TAG1:TEXT02 PIC X(080) VALUE 'Margo Hanson'.            00000003
           05  :TAG2:TEXT03 PIC X(080) VALUE 'Eliot Waugh'.             00000004
