000001 Process DEFINE(GRAYZA,'PGM00001')                                00000001
000002 Identification Division.                                         00000002
000003 Program-ID.    testantlr366.                                     00000003
000004 Data Division.                                                   00000004
000005 Working-Storage Section.                                         00000005
000006 01  PGM1 Constant From GRAYZA.                                   00000006
000007 01  PGM2 Constant As   'PGM00002'.                               00000007
000008 Procedure Division.                                              00000008
000009     Call PGM1                                                    00000009
000010     Call PGM2                                                    00000010
000011     Goback                                                       00000011
000012     .                                                            00000012
000013                                                                  00000013
