000001 PROCESS DEFINE(X)
000002 Identification Division.
000003 Program-ID. testantlr134.
000004 Data Division.
000005 Working-Storage Section.
000006
000007 01  CONSTANTS.
000008     05  MYNAME               PIC X(012) VALUE 'testantlr134'.
000009     >>IF X DEFINED
000010     05  PGM-0001             PIC X(008) VALUE 'PGMA0001'.
000011     >>ELSE
000012     05  PGM-0001             PIC X(008) VALUE 'PGMA0002'.
000013     >>END-IF
000014
000015*
000016
000017 Procedure Division.
000018     DISPLAY MYNAME ' Begin'
000019     CALL PGM-0001
000020
000021     DISPLAY MYNAME ' End'
000022     
000023     GOBACK
000024     .
000025
000026
