000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID.
000003     testantlr159.
000004 ENVIRONMENT DIVISION.
000005 CONFIGURATION SECTION.
000006 SOURCE-COMPUTER.
000007     XXXXX082.
000008 OBJECT-COMPUTER.
000009     XXXXX083.
000010 INPUT-OUTPUT SECTION.
000011 FILE-CONTROL.
000012 DATA DIVISION.
000013 FILE SECTION.
000014 WORKING-STORAGE SECTION.
000015 01 WORK-AREAS.
000016     05
000017                                                                 C
000018-                                                                O
000019-                                                                U
000020-                                                                N
000021-                                                                T
000022-                                                                E
000023-                                                                R
000024                                                                 P
000025-                                                                I
000026-                                                                C
000027                                                                 S
000028-                                                                9
000029-                                                                (
000030-                                                                0
000031-                                                                0
000032-                                                                5
000033-                                                                )
000034                                                                 C
000035-                                                                O
000036-                                                                M
000037-                                                                P
000038-                                                                -
000039-                                                                3
000040                                                                 V
000041-                                                                A
000042-                                                                L
000043-                                                                U
000044-                                                                E
000045                                                                 +
000046-                                                                0
000047-                                                                .
000048 PROCEDURE DIVISION.
000049 CCVS1 SECTION.
000050 OPEN-FILES.
000051     ADD 1 TO                                                    C
000052-                                                                O
000053-                                                                U
000054-                                                                N
000055-                                                                T
000056-                                                                E
000057-                                                                R
000058
000059     ADD 
000060                                                                 1
000061-                                                                0
000062
000063     TO
000064                                                                 C
000065-                                                                O
000066-                                                                U
000067-                                                                N
000068-                                                                T
000069-                                                                E
000070-                                                                R
000071
000072
000073                                                               DIS
000074-                                                             PLAY 
000075     COUNTER
000076     GOBACK.
000077
