000001 Identification Division.                                         00000001
000002 Program-ID. testantlr323.                                        00000002
000003 Data Division.                                                   00000003
000004 Working-Storage Section.                                         00000004
000005                                                                  00000005
000006*                                                                 00000006
000007*comment                                                          00000007
000008*                                                                 00000008
000009                                                                  00000009
000010 01  CONSTANTS.                                                   00000010
000011     05  MYNAME               PIC X(012) VALUE 'testantlr323'.    00000011
000012     05  PGM-0001             PIC X(008) VALUE 'PGMA0001'.        00000012
000013     05  PGM-0002             PIC X(008) VALUE 'PGMA0002'.        00000013
000014     05  PGM-0003             PIC X(008) VALUE 'PGMA0003'.        00000014
000015                                                                  00000015
000016*                                                                 00000016
000017                                                                  00000017
000018 01 WORK-AREAS.                                        COPY TA023.00000018
000019                                                                  00000019
000020 Procedure Division.                                              00000020
000021     DISPLAY MYNAME ' Begin'                                      00000021
000022                                                                  00000022
000023     MOVE 'PGMB0004' TO PGM-0004                                  00000023
000024     MOVE PGM-0001   TO PGM-0004                                  00000024
000025                                                                  00000025
000026     DISPLAY MYNAME ' End'                                        00000026
000027                                                                  00000027
000028     GOBACK                                                       00000028
000029     .                                                            00000029
000030                                                                  00000030
000031 1000-para.                                                       00000031
000032                                                                  00000032
000033     CALL PGM-0004                                                00000033
000034                                                                  00000034
000035     .                                                            00000035
000036                                                                  00000036
