000001 CONSTANTS.                                                       00000001
000002     05  MYNAME PIC X(012) VALUE 'testantlr058'.                  00000002
000003     05  ONE    PIC S9(004) COMP VALUE +1.                        00000003
