000001 Identification Division.
000002 Program-ID. testantlr125.
000003 Author.
000004     This is the author paragraph
000005 Installation.
000006     This is line 01 of the Installation paragraph.
000007     This is line 02 of the installation paragraph no period
000008     Identification of the Installation paragraph extending to xxx
000009 Date-Written.
000010     In this Environment on this Source-Computer
000011     is recorded the Date-Written.
000012 Date-Compiled.
000013 Security.                                                   None.
000014 Data Division.
000015 Working-Storage Section.
000016
000017*
000018*comment
000019*
000020
000021 01  CONSTANTS.
000022     05  MYNAME               PIC X(012) VALUE 'testantlr125'.
000023
000024*
000025
000026 01 WORK-AREAS.
000027    05  A                     PIC A VALUE 'A'.
000028    05  X                     PIC X VALUE 'X'.
000029    05  V99                   PIC V99.
000030    05  B9                    PIC B9.
000031    05  Z                     PIC Z.
000032    05  S9                    PIC S9.       
000033    05  S99DISPLAY            PIC S99 DISPLAY.
000034    05  S99USAGEDISPLAY       PIC S99 USAGE DISPLAY.
000035    05  S99DISPLAY1           PIC S99 DISPLAY-1.
000036    05  S99USAGEDISPLAY1      PIC S99 USAGE DISPLAY-1.
000037    05  S94COMP               PIC S9(4) COMP.
000038    05  S94USAGECOMP          PIC S9(4) USAGE COMP.
000039    05  S94COMP1              PIC S9(4) COMP-1.
000040    05  S94USAGECOMP1         PIC S9(4) USAGE COMP-1.
000041    05  S95COMP3              PIC S9(005) COMP-3.
000042    05  S95USAGECOMP3         PIC S9(005) USAGE COMP-3.
000043    05  S9SFLOAT              USAGE COMP-2.
000044    05  S9DFLOAT              USAGE COMP-4.
000045    05  S98COMP5              PIC S9(008) COMP-5.
000046    05  S98USAGECOMP5         PIC S9(008) USAGE COMP-5.
000047    05  S99DISPLAY-V          PIC S99 DISPLAY VALUE 1.
000048    05  S99USAGEDISPLAY-V     PIC S99 USAGE DISPLAY VALUE +1.
000049    05  S99DISPLAY1-V         PIC S99 DISPLAY-1 VALUE 1.
000050    05  S99USAGEDISPLAY1-V    PIC S99 USAGE DISPLAY-1 VALUE +1.
000051    05  S94COMP-V             PIC S9(4) COMP VALUE 3.
000052    05  S94USAGECOMP-V        PIC S9(4) USAGE COMP VALUE +3.
000053    05  S94COMP1-V            PIC S9(4) COMP-1 VALUE -3.
000054    05  S94USAGECOMP1-V       PIC S9(4) USAGE COMP-1 VALUE -7.
000055    05  S95COMP3-V            PIC S9(005) COMP-3 VALUE +14.
000056    05  S95USAGECOMP3-V       PIC S9(005) USAGE COMP-3 VALUE -14.
000057    05  S98COMP5-V            PIC S9(008) COMP-5 VALUE 2.
000058    05  S98USAGECOMP5-V       PIC S9(008) USAGE COMP-5 VALUE +2.
000059    05  S94COMPU              PIC S9(4) COMPUTATIONAL.
000060    05  S94USAGECOMPU         PIC S9(4) USAGE COMPUTATIONAL.
000061    05  S94COMPU1             PIC S9(4) COMPUTATIONAL-1.
000062    05  S94USAGECOMPU1        PIC S9(4) USAGE COMPUTATIONAL-1.
000063    05  S95COMPU3             PIC S9(005) COMPUTATIONAL-3.
000064    05  S95USAGECOMPU3        PIC S9(005) USAGE COMPUTATIONAL-3.
000065    05  S9SFLOATU             USAGE COMPUTATIONAL-2.
000066    05  S9DFLOATU             USAGE COMPUTATIONAL-4.
000067    05  S98COMPU5             PIC S9(008) COMPUTATIONAL-5.
000068    05  S98USAGECOMPU5        PIC S9(008) USAGE COMPUTATIONAL-5.
000069    05  S94COMPU-V            PIC S9(4) COMPUTATIONAL VALUE 3.
000070    05  S94USAGECOMPU-V       PIC S9(4) 
000071                              USAGE COMPUTATIONAL VALUE +3.
000072    05  S94COMPU1-V           PIC S9(4) COMPUTATIONAL-1 VALUE -3.
000073    05  S94USAGECOMPU1-V      PIC S9(4) 
000074                              USAGE COMPUTATIONAL-1 VALUE -7.
000075    05  S95COMPU3-V           PIC S9(005) 
000076                              COMPUTATIONAL-3 VALUE +1.
000077    05  S95USAGECOMPU3-V      PIC S9(005) 
000078                              USAGE COMPUTATIONAL-3 VALUE -14.
000079    05  S98COMPU5-V           PIC S9(008) COMPUTATIONAL-5 VALUE 2.
000080    05  S98USAGECOMPU5-V      PIC S9(008) 
000081                              USAGE COMPUTATIONAL-5 VALUE +2.
000082
000083
000084
000085 Procedure Division.
000086     DISPLAY MYNAME ' Begin'
000087     
000088
000089     DISPLAY MYNAME ' End'
000090     
000091     GOBACK
000092     .
000093
000094
