       Identification Division.
       Program-ID. test31aa.
       Procedure Division.
           GOBACK.
       End Program test31aa.

       Identification Division.
       Program-ID. test31ab As 'TEST31AB'.
       Procedure Division.
           GOBACK.
       End Program test31ab.

       Identification Division.
       Program-ID. test31ac Common.
       Procedure Division.
           GOBACK.
       End Program test31ac.

       Identification Division.
       Program-ID. test31ad Initial.
       Procedure Division.
           GOBACK.
       End Program test31ad.

       Identification Division.
       Program-ID. test31ae Recursive.
       Procedure Division.
           GOBACK.
       End Program test31ae.

       Identification Division.
       Program-ID. test31af Is Common.
       Procedure Division.
           GOBACK.
       End Program test31af.

       Identification Division.
       Program-ID. test31ag Is Initial.
       Procedure Division.
           GOBACK.
       End Program test31ag.

       Identification Division.
       Program-ID. test31ah Is Recursive.
       Procedure Division.
           GOBACK.
       End Program test31ah.

       Identification Division.
       Program-ID. test31ai As 'TEST31AI' Common.
       Procedure Division.
           GOBACK.
       End Program test31ai.

       Identification Division.
       Program-ID. test31aj As 'TEST31AJ' Initial.
       Procedure Division.
           GOBACK.
       End Program test31aj.

       Identification Division.
       Program-ID. test31ak As 'TEST31AK' Recursive.
       Procedure Division.
           GOBACK.
       End Program test31ak.

       Identification Division.
       Program-ID. test31al As 'TEST31AL' Is Common.
       Procedure Division.
           GOBACK.
       End Program test31al.

       Identification Division.
       Program-ID. test31am As 'TEST31AM' Is Initial.
       Procedure Division.
           GOBACK.
       End Program test31am.

       Identification Division.
       Program-ID. test31an As 'TEST31AN' Is Recursive.
       Procedure Division.
           GOBACK.
       End Program test31an.

       Identification Division.
       Program-ID. test31ao Common Program.
       Procedure Division.
           GOBACK.
       End Program test31ao.

       Identification Division.
       Program-ID. test31ap Initial Program.
       Procedure Division.
           GOBACK.
       End Program test31ap.

       Identification Division.
       Program-ID. test31aq Recursive Program.
       Procedure Division.
           GOBACK.
       End Program test31aq.

       Identification Division.
       Program-ID. test31ar Is Common Program.
       Procedure Division.
           GOBACK.
       End Program test31ar.

       Identification Division.
       Program-ID. test31as Is Initial Program.
       Procedure Division.
           GOBACK.
       End Program test31as.

       Identification Division.
       Program-ID. test31at Is Recursive Program.
       Procedure Division.
           GOBACK.
       End Program test31at.

       Identification Division.
       Program-ID. test31au As 'TEST31AU' Common Program.
       Procedure Division.
           GOBACK.
       End Program test31au.

       Identification Division.
       Program-ID. test31av As 'TEST31AV' Initial Program.
       Procedure Division.
           GOBACK.
       End Program test31av.

       Identification Division.
       Program-ID. test31aw As 'TEST31AW' Recursive Program.
       Procedure Division.
           GOBACK.
       End Program test31aw.

       Identification Division.
       Program-ID. test31ax As 'TEST31AX' Is Common Program.
       Procedure Division.
           GOBACK.
       End Program test31ax.

       Identification Division.
       Program-ID. test31ay As 'TEST31AY' Is Initial Program.
       Procedure Division.
           GOBACK.
       End Program test31ay.

       Identification Division.
       Program-ID. test31az As 'TEST31AZ' Is Recursive Program.
       Procedure Division.
           GOBACK.
       End Program test31az.


