       ID Division.
       Program-ID. test9005.
       Procedure Division.
       >>INLINE ON
           PERFORM 1000-PARA
           >>INLINE OFF
           PERFORM 1000-PARA
          >>INLINE ON
           PERFORM 1000-PARA
            >>INLINE OFF
           PERFORM 1000-PARA
           GOBACK. 
