000001 ID Division.
000002 Program-ID. testantlr157.
000003 Data Division.
000004 Working-Storage Section.
000005 01  WORK-AREAS.
000006     05  WS-POINTER            POINTER VALUE NULL.
000007     05  WS-COUNT              PIC S9(5) COMP-3 VALUE +0.
000008
000009 Linkage Section.
000010 01  SOME-DATA                 PIC X(1024).
000011 Procedure Division.
000012
000013     ALLOCATE
000014       SOME-DATA
000015
000016     FREE SOME-DATA
000017
000018     ALLOCATE
000019       SOME-DATA
000020       RETURNING WS-POINTER
000021
000022     FREE SOME-DATA WS-POINTER
000023
000024     MOVE LENGTH OF SOME-DATA TO WS-COUNT
000025     ALLOCATE
000026       WS-COUNT CHARACTERS
000027       RETURNING WS-POINTER
000028
000029     FREE WS-POINTER
000030
000031     ALLOCATE
000032       SOME-DATA
000033       INITIALIZED
000034
000035     FREE SOME-DATA
000036
000037     ALLOCATE
000038       SOME-DATA
000039       INITIALIZED
000040       RETURNING WS-POINTER
000041
000042     FREE SOME-DATA WS-POINTER
000043
000044     MOVE LENGTH OF SOME-DATA TO WS-COUNT
000045     ALLOCATE
000046       WS-COUNT CHARACTERS
000047       INITIALIZED
000048       RETURNING WS-POINTER
000049
000050     FREE WS-POINTER
000051
000052     ALLOCATE
000053       SOME-DATA
000054       LOC 24
000055
000056     FREE SOME-DATA
000057
000058     ALLOCATE
000059       SOME-DATA
000060       LOC 24
000061       RETURNING WS-POINTER
000062
000063     FREE SOME-DATA WS-POINTER
000064
000065     MOVE LENGTH OF SOME-DATA TO WS-COUNT
000066     ALLOCATE
000067       WS-COUNT CHARACTERS
000068       LOC 24
000069       RETURNING WS-POINTER
000070
000071     FREE WS-POINTER
000072
000073     ALLOCATE
000074       SOME-DATA
000075       LOC 31
000076
000077     FREE SOME-DATA
000078
000079     ALLOCATE
000080       SOME-DATA
000081       LOC 31
000082       RETURNING WS-POINTER
000083
000084    FREE SOME-DATA WS-POINTER
000085
000086    MOVE LENGTH OF SOME-DATA TO WS-COUNT
000087     ALLOCATE
000088       WS-COUNT CHARACTERS
000089       LOC 31
000090       RETURNING WS-POINTER
000091
000092     FREE WS-POINTER
000093
000094     ALLOCATE
000095       SOME-DATA
000096       LOC 64
000097
000098     FREE SOME-DATA
000099
000100     ALLOCATE
000101       SOME-DATA
000102       LOC 64
000103       RETURNING WS-POINTER
000104
000105     FREE SOME-DATA WS-POINTER
000106
000107     MOVE LENGTH OF SOME-DATA TO WS-COUNT
000108     ALLOCATE
000109       WS-COUNT CHARACTERS
000110       LOC 64
000111       RETURNING WS-POINTER
000112
000113     FREE WS-POINTER
000114
000115     ALLOCATE
000116       SOME-DATA
000117       INITIALIZED
000118       LOC 64
000119
000120     FREE SOME-DATA
000121
000122     ALLOCATE
000123       SOME-DATA
000124       INITIALIZED
000125       LOC 64
000126       RETURNING WS-POINTER
000127
000128     FREE SOME-DATA WS-POINTER
000129
000130     MOVE LENGTH OF SOME-DATA TO WS-COUNT
000131     ALLOCATE
000132       WS-COUNT CHARACTERS
000133       INITIALIZED
000134       LOC 64
000135       RETURNING WS-POINTER
000136
000137     FREE WS-POINTER
000138
000139     GOBACK.
