000001 77  ZELDA-SCHIFF %comp1le error1% PIC S9(016) COMP     VALUE +4. 00000001
000002 77  HENRY-FOGG %comp1le error2% PIC S9(016) COMP       VALUE +8. 00000002
