000001 ID Division.
000002 Program-ID. testantlr153.
000003 Procedure Division.
000004
000005     >>DEFINE A B'1'
000006     >>DEFINE B B'0'
000007     >>DEFINE C B'1'
000008     >>DEFINE D B'0'
000009
000010     >>IF A AND B
000011     CALL 'PGM00001'
000012     >>END-IF
000013
000014     >>IF (((((A AND B)))))
000015     CALL 'PGM00002'
000016     >>END-IF
000017
000018     >>IF A AND (B OR C)
000019     CALL 'PGM00003'
000020     >>END-IF
000021
000022     >>IF (A AND B) OR D
000023     CALL 'PGM00004'
000024     >>END-IF
000025
000026     >>IF A AND (B AND (C OR D))
000027     CALL 'PGM00005'
000028     >>END-IF
000029
000030     >>IF B AND (C OR D)
000031     CALL 'PGM00006'
000032     >>END-IF
000033
000034     >>IF (B AND C) OR D
000035     CALL 'PGM00007'
000036     >>END-IF
000037
000038     >>IF A AND (B OR C) AND D
000039     CALL 'PGM00008'
000040     >>END-IF
000041
000042     >>IF (A OR D) AND (B OR C)
000043     CALL 'PGM00009'
000044     >>END-IF
000045
000046     GOBACK.
