000001 Identification Division.
000002 Program-ID. testantlr127.
000003 Data Division.
000004 Working-Storage Section.
000005
000006*
000007*comment
000008*
000009
000010 01  CONSTANTS.
000011     05  MYNAME               PIC X(012) VALUE 'testantlr127'.
000012
000013*
000014
000015 01 WORK-AREAS.
000016    05  X                     PIC X USAGE IS DISPLAY VALUE IS 'ABC
000017-'DEFGHIJKLMNOPQRSTUVWXYZ";:,./<>?1234567890-=!@#$%^&*()_+\|abcdef
000018-'ghijklmnopqrstuvwxyz '.
000019    05  A                     PIC X USAGE IS DISPLAY VALUE IS "ABC
000020-"DEFGHIJKLMNOPQRSTUVWXYZ';:,./<>?1234567890-=!@#$%^&*()_+\|abcdef
000021-"ghijklmnopqrstuvwxyz ".
000022
000023 Procedure Division.
000024     DISPLAY MYNAME ' Begin'
000025
000026     IF X = "ABCDEFGHIJKLMNOPQRSTUVWXYZ';:,./<>?\|1234567890!@#$%^
000027-"&*()-=_+ ." DISPLAY MYNAME 'IS EQUAL' END-IF
000028
000029     IF A EQUAL TO 'ABCDEFGHIJKLMNOPQRSTUVWXYZ";:,./<>?\|123456789
000030-'0!@#$%^&*()-=_+ .' DISPLAY MYNAME 'IS EQUAL' END-IF
000031     
000032
000033     DISPLAY MYNAME ' End'
000034     
000035     GOBACK
000036     .
000037
000038
