000001 PROCESS DEFINE(X=3)
000002 Identification Division.
000003 Program-ID. testantlr138.
000004 Data Division.
000005 Working-Storage Section.
000006
000007 01  CONSTANTS.
000008     05  MYNAME               PIC X(012) VALUE 'testantlr138'.
000009     >>EVALUATE X
000010     >>WHEN 3
000011     05  PGM-0001             PIC X(008) VALUE 'PGMA0001'.
000012     >>WHEN OTHER
000013     05  PGM-0001             PIC X(008) VALUE 'PGMA0002'.
000014     >>END-EVALUATE
000015
000016*
000017
000018 Procedure Division.
000019     DISPLAY MYNAME ' Begin'
000020     CALL PGM-0001
000021
000022     DISPLAY MYNAME ' End'
000023     
000024     GOBACK
000025     .
000026
000027
