000001 Identification Division.
000002 Program-ID. testantlr149.
000003 Data Division.
000004 Working-Storage Section.
000005
000006 >>DEFINE JULIA 'WICKER'
000007 >>DEFINE ELIOT 'WAUGH'
000008 >>DEFINE PENNY 'ADIYODI'
000009 >>DEFINE MARGOT 'HANSON'
000010 >>DEFINE ALICE 'QUINN'
000011 >>DEFINE QUENTIN 'COLDWATER'
000012 >>DEFINE KADY 'ORLOFF-DIAZ'
000013 >>DEFINE JOSH 'HOBERMAN'
000014
000015 01  CONSTANTS.
000016     05  MYNAME               PIC X(012) VALUE 'testantlr149'.
000017     05  PGM-0001             PIC X(008) VALUE 'PGMA0001'.
000018     05  PGM-0002             PIC X(008) VALUE 'PGMA0002'.
000019     05  PGM-0003             PIC X(008) VALUE 'PGMA0003'.
000020     05  PGM-0004             PIC X(008) VALUE 'PGMA0004'.
000021     05  PGM-0005             PIC X(008) VALUE 'PGMA0005'.
000022     05  PGM-0006             PIC X(008) VALUE 'PGMA0006'.
000023     05  PGM-0007             PIC X(008) VALUE 'PGMA0007'.
000024     05  PGM-0008             PIC X(008) VALUE 'PGMA0008'.
000025     05  PGM-0009             PIC X(008) VALUE 'PGMA0009'.
000026
000027*
000028
000029 Procedure Division.
000030     DISPLAY MYNAME ' Begin'
000031
000032     >>IF JULIA = 'WICKER'
000033     CALL PGM-0001 USING
000034       MYNAME
000035     END-CALL
000036     >>END-IF
000037     >>IF ELIOT = 'WAUGH'
000038     CALL PGM-0002 USING
000039       MYNAME
000040     END-CALL
000041     >>END-IF
000042     >>IF PENNY = 'ADIYODI'
000043     CALL PGM-0003 USING
000044       MYNAME
000045     END-CALL
000046     >>END-IF
000047     >>IF MARGOT = 'HANSON'
000048     CALL PGM-0004 USING
000049       MYNAME
000050     END-CALL
000051     >>END-IF
000052     >>IF ALICE = 'QUINN'
000053     CALL PGM-0005 USING
000054       MYNAME
000055     END-CALL
000056     >>END-IF
000057     >>IF QUENTIN = 'COLDWATER'
000058     CALL PGM-0006 USING
000059       MYNAME
000060     END-CALL
000061     >>END-IF
000062     >>IF KADY = 'ORLOFF-DIAZ'
000063     CALL PGM-0007 USING
000064       MYNAME
000065     END-CALL
000066     >>END-IF
000067     >>IF JOSH = 'HOBERMAN'
000068     CALL PGM-0008 USING
000069       MYNAME
000070     END-CALL
000071     >>END-IF
000072     >>IF ELIOT = 'QUENTIN'
000073     CALL PGM-0009 USING
000074       MYNAME
000075     END-CALL
000076     >>END-IF
000077
000078     >>IF JULIA = 'WICKER'
000079         CALL 'JULIA' USING
000080           MYNAME
000081         END-CALL
000082         >>IF ELIOT = 'WAUGH'
000083             CALL 'ELIOT' USING
000084               MYNAME
000085             END-CALL
000086             >>IF PENNY = 'ADIYODI'
000087                 CALL 'PENNY' USING
000088                   MYNAME
000089                 END-CALL
000090             >>END-IF
000091         >>END-IF
000092         >>IF MARGOT = 'WAUGH'
000093             CALL 'WAUGH' USING
000094               MYNAME
000095             END-CALL
000096         >>ELSE
000097             CALL 'MARGOT' USING
000098               MYNAME
000099             END-CALL
000100             >>IF ALICE = 'QUINN'
000101                 CALL 'ALICE' USING
000102                   MYNAME
000103                 END-CALL
000104             >>ELSE
000105                 CALL 'QUINN' USING
000106                   MYNAME
000107                 END-CALL
000108             >>END-IF
000109         >>END-IF
000110     >>ELSE
000111         CALL 'WICKER' USING
000112           MYNAME
000113         END-CALL
000114     >>END-IF
000115
000116
000117     DISPLAY MYNAME ' End'
000118     
000119     GOBACK
000120     .
000121
000122
