       Identification Division.
       Program-ID.    test9039.
       Data Division.
       Working-Storage Section.
       01  Crichton Picture Is X 
           Editing X Is 'Y'.
       01  Scorpius PIC XYZ
           Editing X For Negative Is '-'
                         Positive Is '+'.
       01  Sikozu PIC X Locale Is Farscape Size Is 1.
       Procedure Division.
           Goback
           .

