       CBL NODYNAM
       ID Division.
       Program-ID. test9004.
       Procedure Division.
           CALL 'MOYA'
           >>CALLINTERFACE DYNAMIC
           CALL 'AERYN'
           >>CALLINT
           CALL 'CRICHTON'
           >>CALLINT DLL
           CALL 'ZHAAN'
           >>CALLINTERFACE
           CALL 'RYGEL'
           >>CALLINTERFACE STATIC
           CALL 'CHIANA'
           >>CALLINT DLL
           CALL 'DARGO'
           >>CALLINTERFACE
           CALL 'PILOT'
           GOBACK. 
