000001 01  :TAG1:WORK-AREAS.
000002     05  :TAG2:TEXT01 PIC X(080) VALUE 'Alice Quinn'.
000003     05  :TAG1:TEXT02 PIC X(080) VALUE 'Margo Hanson'.
000004     05  :TAG2:TEXT03 PIC X(080) VALUE 'Eliot Waugh'.
