       Identification Division.
       Program-ID.    test9018.
      *
      * Test all the parameters of all the CICS CVDA values.
      * This code definitely won't compile cleanly.
      * It's just here to test parsing.
      *
      * Current as of CICS TS 6.1
      *
       Procedure Division.
           MOVE DFHVALUE(ABEND) TO WS-VAL
           MOVE DFHVALUE(ACQFAIL) TO WS-VAL
           MOVE DFHVALUE(ACQUIRED) TO WS-VAL
           MOVE DFHVALUE(ACQUIRING) TO WS-VAL
           MOVE DFHVALUE(ACTIVE) TO WS-VAL
           MOVE DFHVALUE(ACTIVITY) TO WS-VAL
           MOVE DFHVALUE(ADD) TO WS-VAL
           MOVE DFHVALUE(ADDABLE) TO WS-VAL
           MOVE DFHVALUE(ADDFAIL) TO WS-VAL
           MOVE DFHVALUE(ADDRESS) TO WS-VAL
           MOVE DFHVALUE(ADVANCE) TO WS-VAL
           MOVE DFHVALUE(AINIT) TO WS-VAL
           MOVE DFHVALUE(ALARM) TO WS-VAL
           MOVE DFHVALUE(ALL) TO WS-VAL
           MOVE DFHVALUE(ALLCONN) TO WS-VAL
           MOVE DFHVALUE(ALLOCATD) TO WS-VAL
           MOVE DFHVALUE(ALLQUERY) TO WS-VAL
           MOVE DFHVALUE(ALLVALUES) TO WS-VAL
           MOVE DFHVALUE(ALTERABLE) TO WS-VAL
           MOVE DFHVALUE(ALTERNATE) TO WS-VAL
           MOVE DFHVALUE(ALTPRTCOPY) TO WS-VAL
           MOVE DFHVALUE(ANALYZER) TO WS-VAL
           MOVE DFHVALUE(AND) TO WS-VAL
           MOVE DFHVALUE(ANY) TO WS-VAL
           MOVE DFHVALUE(APLKYBD) TO WS-VAL
           MOVE DFHVALUE(APLTEXT) TO WS-VAL
           MOVE DFHVALUE(APPC) TO WS-VAL
           MOVE DFHVALUE(APPCPARALLEL) TO WS-VAL
           MOVE DFHVALUE(APPCSINGLE) TO WS-VAL
           MOVE DFHVALUE(APPEND) TO WS-VAL
           MOVE DFHVALUE(APPLICATION) TO WS-VAL
           MOVE DFHVALUE(APPLID) TO WS-VAL
           MOVE DFHVALUE(APPLNAME) TO WS-VAL
           MOVE DFHVALUE(ASACTL) TO WS-VAL
           MOVE DFHVALUE(ASCII7) TO WS-VAL
           MOVE DFHVALUE(ASCII8) TO WS-VAL
           MOVE DFHVALUE(ASRUNTRAN) TO WS-VAL
           MOVE DFHVALUE(ASSEMBLER) TO WS-VAL
           MOVE DFHVALUE(ASSERTED) TO WS-VAL
           MOVE DFHVALUE(ASYNCHRONOUS) TO WS-VAL
           MOVE DFHVALUE(ATI) TO WS-VAL
           MOVE DFHVALUE(ATOM) TO WS-VAL
           MOVE DFHVALUE(ATOMSERVICE) TO WS-VAL
           MOVE DFHVALUE(ATTACH) TO WS-VAL
           MOVE DFHVALUE(ATTENTION) TO WS-VAL
           MOVE DFHVALUE(ATTLSAWARE) TO WS-VAL
           MOVE DFHVALUE(AUDALARM) TO WS-VAL
           MOVE DFHVALUE(AUTOACTIVE) TO WS-VAL
           MOVE DFHVALUE(AUTOARCH) TO WS-VAL
           MOVE DFHVALUE(AUTOAUTH) TO WS-VAL
           MOVE DFHVALUE(AUTOCONN) TO WS-VAL
           MOVE DFHVALUE(AUTOINACTIVE) TO WS-VAL
           MOVE DFHVALUE(AUTOINIT) TO WS-VAL
           MOVE DFHVALUE(AUTOINSTALL) TO WS-VAL
           MOVE DFHVALUE(AUTOPAGE) TO WS-VAL
           MOVE DFHVALUE(AUTOREGISTER) TO WS-VAL
           MOVE DFHVALUE(AUTOSTART) TO WS-VAL
           MOVE DFHVALUE(AUTOTERMID) TO WS-VAL
           MOVE DFHVALUE(AUXILIARY) TO WS-VAL
           MOVE DFHVALUE(AUXPAUSE) TO WS-VAL
           MOVE DFHVALUE(AUXSTART) TO WS-VAL
           MOVE DFHVALUE(AUXSTOP) TO WS-VAL
           MOVE DFHVALUE(AVAILABLE) TO WS-VAL
           MOVE DFHVALUE(BACKOUT) TO WS-VAL
           MOVE DFHVALUE(BACKTRANS) TO WS-VAL
           MOVE DFHVALUE(BACKUPNONBWO) TO WS-VAL
           MOVE DFHVALUE(BASE) TO WS-VAL
           MOVE DFHVALUE(BASEAPI) TO WS-VAL
           MOVE DFHVALUE(BASESPACE) TO WS-VAL
           MOVE DFHVALUE(BASE64) TO WS-VAL
           MOVE DFHVALUE(BASICAUTH) TO WS-VAL
           MOVE DFHVALUE(BDAM) TO WS-VAL
           MOVE DFHVALUE(BEGINSESSION) TO WS-VAL
           MOVE DFHVALUE(BELOW) TO WS-VAL
           MOVE DFHVALUE(BGAM) TO WS-VAL
           MOVE DFHVALUE(BINARY) TO WS-VAL
           MOVE DFHVALUE(BINIT) TO WS-VAL
           MOVE DFHVALUE(BIT) TO WS-VAL
           MOVE DFHVALUE(BLK) TO WS-VAL
           MOVE DFHVALUE(BLOCKED) TO WS-VAL
           MOVE DFHVALUE(BOTH) TO WS-VAL
           MOVE DFHVALUE(BRIDGE) TO WS-VAL
           MOVE DFHVALUE(BROWSABLE) TO WS-VAL
           MOVE DFHVALUE(BSAM) TO WS-VAL
           MOVE DFHVALUE(BTAM) TO WS-VAL
           MOVE DFHVALUE(BUNDLE) TO WS-VAL
           MOVE DFHVALUE(BUSY) TO WS-VAL
           MOVE DFHVALUE(C) TO WS-VAL
           MOVE DFHVALUE(CACHE) TO WS-VAL
           MOVE DFHVALUE(CANCEL) TO WS-VAL
           MOVE DFHVALUE(CANCELLED) TO WS-VAL
           MOVE DFHVALUE(CANCELLING) TO WS-VAL
           MOVE DFHVALUE(CAPTURESPEC) TO WS-VAL
           MOVE DFHVALUE(CATEGORY) TO WS-VAL
           MOVE DFHVALUE(CBE) TO WS-VAL
           MOVE DFHVALUE(CBER) TO WS-VAL
           MOVE DFHVALUE(CCE) TO WS-VAL
           MOVE DFHVALUE(CD) TO WS-VAL
           MOVE DFHVALUE(CEDF) TO WS-VAL
           MOVE DFHVALUE(CERTIFICAUTH) TO WS-VAL
           MOVE DFHVALUE(CERTUSER) TO WS-VAL
           MOVE DFHVALUE(CFTABLE) TO WS-VAL
           MOVE DFHVALUE(CFE) TO WS-VAL
           MOVE DFHVALUE(CGROUP) TO WS-VAL
           MOVE DFHVALUE(CHANNEL) TO WS-VAL
           MOVE DFHVALUE(CHAR) TO WS-VAL
           MOVE DFHVALUE(CHUNKEND) TO WS-VAL
           MOVE DFHVALUE(CHUNKNO) TO WS-VAL
           MOVE DFHVALUE(CHUNKYES) TO WS-VAL
           MOVE DFHVALUE(CICS) TO WS-VAL
           MOVE DFHVALUE(CICSAPI) TO WS-VAL
           MOVE DFHVALUE(CICSDATAKEY) TO WS-VAL
           MOVE DFHVALUE(CICSECURITY) TO WS-VAL
           MOVE DFHVALUE(CICSEXECKEY) TO WS-VAL
           MOVE DFHVALUE(CICSTABLE) TO WS-VAL
           MOVE DFHVALUE(CKOPEN) TO WS-VAL
           MOVE DFHVALUE(CLASSCACHE) TO WS-VAL
           MOVE DFHVALUE(CLEAR) TO WS-VAL
           MOVE DFHVALUE(CLICONVERT) TO WS-VAL
           MOVE DFHVALUE(CLIENT) TO WS-VAL
           MOVE DFHVALUE(CLIENTAUTH) TO WS-VAL
           MOVE DFHVALUE(CLIENTCERT) TO WS-VAL
           MOVE DFHVALUE(CLOSE) TO WS-VAL
           MOVE DFHVALUE(CLOSED) TO WS-VAL
           MOVE DFHVALUE(CLOSEFAILED) TO WS-VAL
           MOVE DFHVALUE(CLOSELEAVE) TO WS-VAL
           MOVE DFHVALUE(CLOSEREQ) TO WS-VAL
           MOVE DFHVALUE(CLOSING) TO WS-VAL
           MOVE DFHVALUE(CLOUD) TO WS-VAL
           MOVE DFHVALUE(CMDPROT) TO WS-VAL
           MOVE DFHVALUE(CMDSECEXT) TO WS-VAL
           MOVE DFHVALUE(CMDSECNO) TO WS-VAL
           MOVE DFHVALUE(CMDSECYES) TO WS-VAL
           MOVE DFHVALUE(COBOL) TO WS-VAL
           MOVE DFHVALUE(COBOLII) TO WS-VAL
           MOVE DFHVALUE(COLD) TO WS-VAL
           MOVE DFHVALUE(COLDACQ) TO WS-VAL
           MOVE DFHVALUE(COLDQUERY) TO WS-VAL
           MOVE DFHVALUE(COLDSTART) TO WS-VAL
           MOVE DFHVALUE(COLLECTION) TO WS-VAL
           MOVE DFHVALUE(COLOR) TO WS-VAL
           MOVE DFHVALUE(COMMAREA) TO WS-VAL
           MOVE DFHVALUE(COMMIT) TO WS-VAL
           MOVE DFHVALUE(COMMITFAIL) TO WS-VAL
           MOVE DFHVALUE(COMPAT) TO WS-VAL
           MOVE DFHVALUE(COMPLETE) TO WS-VAL
           MOVE DFHVALUE(COMPOSITE) TO WS-VAL
           MOVE DFHVALUE(COMPRESS) TO WS-VAL
           MOVE DFHVALUE(CONFFREE) TO WS-VAL
           MOVE DFHVALUE(CONFIG) TO WS-VAL
           MOVE DFHVALUE(CONFRECV) TO WS-VAL
           MOVE DFHVALUE(CONFSEND) TO WS-VAL
           MOVE DFHVALUE(CONNECT) TO WS-VAL
           MOVE DFHVALUE(CONNECTED) TO WS-VAL
           MOVE DFHVALUE(CONNECTING) TO WS-VAL
           MOVE DFHVALUE(CONNECTION) TO WS-VAL
           MOVE DFHVALUE(CONSISTENT) TO WS-VAL
           MOVE DFHVALUE(CONSOLE) TO WS-VAL
           MOVE DFHVALUE(CONTAINER) TO WS-VAL
           MOVE DFHVALUE(CONTENTION) TO WS-VAL
           MOVE DFHVALUE(CONTEXT) TO WS-VAL
           MOVE DFHVALUE(CONTROLSHUT) TO WS-VAL
           MOVE DFHVALUE(CONVERSE) TO WS-VAL
           MOVE DFHVALUE(CONVIDLE) TO WS-VAL
           MOVE DFHVALUE(COORDINATOR) TO WS-VAL
           MOVE DFHVALUE(COPID) TO WS-VAL
           MOVE DFHVALUE(COPY) TO WS-VAL
           MOVE DFHVALUE(CORBA) TO WS-VAL
           MOVE DFHVALUE(CORBASERVER) TO WS-VAL
           MOVE DFHVALUE(CPLUSPLUS) TO WS-VAL
           MOVE DFHVALUE(CREATE) TO WS-VAL
           MOVE DFHVALUE(CREATESPI) TO WS-VAL
           MOVE DFHVALUE(CRITICAL) TO WS-VAL
           MOVE DFHVALUE(CSDAPI) TO WS-VAL
           MOVE DFHVALUE(CSDBATCH) TO WS-VAL
           MOVE DFHVALUE(CSIGN) TO WS-VAL
           MOVE DFHVALUE(CTERM) TO WS-VAL
           MOVE DFHVALUE(CTLGALL) TO WS-VAL
           MOVE DFHVALUE(CTLGMODIFY) TO WS-VAL
           MOVE DFHVALUE(CTLGNONE) TO WS-VAL
           MOVE DFHVALUE(CTRLABLE) TO WS-VAL
           MOVE DFHVALUE(CTX) TO WS-VAL
           MOVE DFHVALUE(CURRENT) TO WS-VAL
           MOVE DFHVALUE(CURRENTPGM) TO WS-VAL
           MOVE DFHVALUE(CUSERID) TO WS-VAL
           MOVE DFHVALUE(CUSTOM) TO WS-VAL
           MOVE DFHVALUE(DAEOPT) TO WS-VAL
           MOVE DFHVALUE(DATA) TO WS-VAL
           MOVE DFHVALUE(DATASET) TO WS-VAL
           MOVE DFHVALUE(DATASETFULL) TO WS-VAL
           MOVE DFHVALUE(DATASTREAM) TO WS-VAL
           MOVE DFHVALUE(DB2CONN) TO WS-VAL
           MOVE DFHVALUE(DB2ENTRY) TO WS-VAL
           MOVE DFHVALUE(DB2TRAN) TO WS-VAL
           MOVE DFHVALUE(DEADLOCK) TO WS-VAL
           MOVE DFHVALUE(DEBUG) TO WS-VAL
           MOVE DFHVALUE(DEC) TO WS-VAL
           MOVE DFHVALUE(DEFAULT) TO WS-VAL
           MOVE DFHVALUE(DEFAULTUSER) TO WS-VAL
           MOVE DFHVALUE(DEFINITION) TO WS-VAL
           MOVE DFHVALUE(DEFRESP1) TO WS-VAL
           MOVE DFHVALUE(DEFRESP1OR2) TO WS-VAL
           MOVE DFHVALUE(DEFRESP2) TO WS-VAL
           MOVE DFHVALUE(DEFRESP3) TO WS-VAL
           MOVE DFHVALUE(DELAY) TO WS-VAL
           MOVE DFHVALUE(DELETABLE) TO WS-VAL
           MOVE DFHVALUE(DELETE) TO WS-VAL
           MOVE DFHVALUE(DELETEFAIL) TO WS-VAL
           MOVE DFHVALUE(DELEXITERROR) TO WS-VAL
           MOVE DFHVALUE(DEREGERROR) TO WS-VAL
           MOVE DFHVALUE(DEREGISTERED) TO WS-VAL
           MOVE DFHVALUE(DEST) TO WS-VAL
           MOVE DFHVALUE(DIAGNOSTICS) TO WS-VAL
           MOVE DFHVALUE(DISABLED) TO WS-VAL
           MOVE DFHVALUE(DISABLEDHOST) TO WS-VAL
           MOVE DFHVALUE(DISABLING) TO WS-VAL
           MOVE DFHVALUE(DISCARDFAIL) TO WS-VAL
           MOVE DFHVALUE(DISCARDING) TO WS-VAL
           MOVE DFHVALUE(DISCONNING) TO WS-VAL
           MOVE DFHVALUE(DISCREQ) TO WS-VAL
           MOVE DFHVALUE(DISK1) TO WS-VAL
           MOVE DFHVALUE(DISK2) TO WS-VAL
           MOVE DFHVALUE(DISK2PAUSE) TO WS-VAL
           MOVE DFHVALUE(DISPATCHABLE) TO WS-VAL
           MOVE DFHVALUE(DISPATCHER) TO WS-VAL
           MOVE DFHVALUE(DJAR) TO WS-VAL
           MOVE DFHVALUE(DOCDELETE) TO WS-VAL
           MOVE DFHVALUE(DOCTEMPLATE) TO WS-VAL
           MOVE DFHVALUE(DOESNOTEQUAL) TO WS-VAL
           MOVE DFHVALUE(DOESNOTEXIST) TO WS-VAL
           MOVE DFHVALUE(DOESNOTSTART) TO WS-VAL
           MOVE DFHVALUE(DORMANT) TO WS-VAL
           MOVE DFHVALUE(DPLSUBSET) TO WS-VAL
           MOVE DFHVALUE(DRAINING) TO WS-VAL
           MOVE DFHVALUE(DREPAPI) TO WS-VAL
           MOVE DFHVALUE(DREPBATCH) TO WS-VAL
           MOVE DFHVALUE(DS3270) TO WS-VAL
           MOVE DFHVALUE(DSIE) TO WS-VAL
           MOVE DFHVALUE(DUALCASE) TO WS-VAL
           MOVE DFHVALUE(DUMMY) TO WS-VAL
           MOVE DFHVALUE(DUMP) TO WS-VAL
           MOVE DFHVALUE(DUMPCODE) TO WS-VAL
           MOVE DFHVALUE(DUPERROR) TO WS-VAL
           MOVE DFHVALUE(DUPNOREPLACE) TO WS-VAL
           MOVE DFHVALUE(DUPREPLACE) TO WS-VAL
           MOVE DFHVALUE(DYNAMIC) TO WS-VAL
           MOVE DFHVALUE(EB) TO WS-VAL
           MOVE DFHVALUE(EBCDIC) TO WS-VAL
           MOVE DFHVALUE(ECI) TO WS-VAL
           MOVE DFHVALUE(EJB) TO WS-VAL
           MOVE DFHVALUE(EMERGENCY) TO WS-VAL
           MOVE DFHVALUE(EMPTY) TO WS-VAL
           MOVE DFHVALUE(EMPTYREQ) TO WS-VAL
           MOVE DFHVALUE(ENABLED) TO WS-VAL
           MOVE DFHVALUE(ENABLING) TO WS-VAL
           MOVE DFHVALUE(ENDAFFINITY) TO WS-VAL
           MOVE DFHVALUE(ENQMODEL) TO WS-VAL
           MOVE DFHVALUE(ENQUEUE) TO WS-VAL
           MOVE DFHVALUE(ENTRYPOINT) TO WS-VAL
           MOVE DFHVALUE(EPADAPTER) TO WS-VAL
           MOVE DFHVALUE(EPADAPTERSET) TO WS-VAL
           MOVE DFHVALUE(EQUAL) TO WS-VAL
           MOVE DFHVALUE(EQUALS) TO WS-VAL
           MOVE DFHVALUE(ESDS) TO WS-VAL
           MOVE DFHVALUE(EVENT) TO WS-VAL
           MOVE DFHVALUE(EVENTBINDING) TO WS-VAL
           MOVE DFHVALUE(EVENTPROCESS) TO WS-VAL
           MOVE DFHVALUE(EVENTUAL) TO WS-VAL
           MOVE DFHVALUE(EXCEPT) TO WS-VAL
           MOVE DFHVALUE(EXCEPTRESP) TO WS-VAL
           MOVE DFHVALUE(EXCI) TO WS-VAL
           MOVE DFHVALUE(EXCTL) TO WS-VAL
           MOVE DFHVALUE(EXECENQ) TO WS-VAL
           MOVE DFHVALUE(EXECENQADDR) TO WS-VAL
           MOVE DFHVALUE(EXECINSTALL) TO WS-VAL
           MOVE DFHVALUE(EXISTS) TO WS-VAL
           MOVE DFHVALUE(EXIT) TO WS-VAL
           MOVE DFHVALUE(EXITTRACE) TO WS-VAL
           MOVE DFHVALUE(EXPECT) TO WS-VAL
           MOVE DFHVALUE(EXPIRED) TO WS-VAL
           MOVE DFHVALUE(EXPORT) TO WS-VAL
           MOVE DFHVALUE(EXTENDED) TO WS-VAL
           MOVE DFHVALUE(EXTENDEDDS) TO WS-VAL
           MOVE DFHVALUE(EXTRA) TO WS-VAL
           MOVE DFHVALUE(EXTSECURITY) TO WS-VAL
           MOVE DFHVALUE(FAILED) TO WS-VAL
           MOVE DFHVALUE(FAILEDBKOUT) TO WS-VAL
           MOVE DFHVALUE(FAILINGBKOUT) TO WS-VAL
           MOVE DFHVALUE(FAULTTOEPR) TO WS-VAL
           MOVE DFHVALUE(FCLOSE) TO WS-VAL
           MOVE DFHVALUE(FEED) TO WS-VAL
           MOVE DFHVALUE(FILE) TO WS-VAL
           MOVE DFHVALUE(FINALQ) TO WS-VAL
           MOVE DFHVALUE(FINPUT) TO WS-VAL
           MOVE DFHVALUE(FIRED) TO WS-VAL
           MOVE DFHVALUE(FIRSTINIT) TO WS-VAL
           MOVE DFHVALUE(FIRSTQ) TO WS-VAL
           MOVE DFHVALUE(FIXED) TO WS-VAL
           MOVE DFHVALUE(FLUSH) TO WS-VAL
           MOVE DFHVALUE(FMH) TO WS-VAL
           MOVE DFHVALUE(FMHPARM) TO WS-VAL
           MOVE DFHVALUE(FOPEN) TO WS-VAL
           MOVE DFHVALUE(FORCE) TO WS-VAL
           MOVE DFHVALUE(FORCECANCEL) TO WS-VAL
           MOVE DFHVALUE(FORCECLOSE) TO WS-VAL
           MOVE DFHVALUE(FORCED) TO WS-VAL
           MOVE DFHVALUE(FORCEPURGE) TO WS-VAL
           MOVE DFHVALUE(FORCLOSING) TO WS-VAL
           MOVE DFHVALUE(FORMATEDF) TO WS-VAL
           MOVE DFHVALUE(FORMATTED) TO WS-VAL
           MOVE DFHVALUE(FORMFEED) TO WS-VAL
           MOVE DFHVALUE(FOUTPUT) TO WS-VAL
           MOVE DFHVALUE(FREE) TO WS-VAL
           MOVE DFHVALUE(FREEING) TO WS-VAL
           MOVE DFHVALUE(FROMEPR) TO WS-VAL
           MOVE DFHVALUE(FULL) TO WS-VAL
           MOVE DFHVALUE(FULLAPI) TO WS-VAL
           MOVE DFHVALUE(FULLAUTO) TO WS-VAL
           MOVE DFHVALUE(FWDRECOVABLE) TO WS-VAL
           MOVE DFHVALUE(GATHER) TO WS-VAL
           MOVE DFHVALUE(GENERIC) TO WS-VAL
           MOVE DFHVALUE(GET) TO WS-VAL
           MOVE DFHVALUE(GMT) TO WS-VAL
           MOVE DFHVALUE(GOHIGHERTHAN) TO WS-VAL
           MOVE DFHVALUE(GOINGOUT) TO WS-VAL
           MOVE DFHVALUE(GOLOWERTHAN) TO WS-VAL
           MOVE DFHVALUE(GREATERTHAN) TO WS-VAL
           MOVE DFHVALUE(GROUP) TO WS-VAL
           MOVE DFHVALUE(GROUPRESYNC) TO WS-VAL
           MOVE DFHVALUE(GRPLIST) TO WS-VAL
           MOVE DFHVALUE(GTFSTART) TO WS-VAL
           MOVE DFHVALUE(GTFSTOP) TO WS-VAL
           MOVE DFHVALUE(HEAD) TO WS-VAL
           MOVE DFHVALUE(HEAP) TO WS-VAL
           MOVE DFHVALUE(HEURBACKOUT) TO WS-VAL
           MOVE DFHVALUE(HEURCOMMIT) TO WS-VAL
           MOVE DFHVALUE(HEX) TO WS-VAL
           MOVE DFHVALUE(HFORM) TO WS-VAL
           MOVE DFHVALUE(HFSFILE) TO WS-VAL
           MOVE DFHVALUE(HIGH) TO WS-VAL
           MOVE DFHVALUE(HILIGHT) TO WS-VAL
           MOVE DFHVALUE(HOLD) TO WS-VAL
           MOVE DFHVALUE(HOME) TO WS-VAL
           MOVE DFHVALUE(HOSTNAME) TO WS-VAL
           MOVE DFHVALUE(HTTP) TO WS-VAL
           MOVE DFHVALUE(HTTPNO) TO WS-VAL
           MOVE DFHVALUE(HTTPS) TO WS-VAL
           MOVE DFHVALUE(HTTPYES) TO WS-VAL
           MOVE DFHVALUE(IDENTIFY) TO WS-VAL
           MOVE DFHVALUE(IDNTY) TO WS-VAL
           MOVE DFHVALUE(IGNORE) TO WS-VAL
           MOVE DFHVALUE(IGNORERR) TO WS-VAL
           MOVE DFHVALUE(IIOP) TO WS-VAL
           MOVE DFHVALUE(IMMCLOSE) TO WS-VAL
           MOVE DFHVALUE(IMMCLOSING) TO WS-VAL
           MOVE DFHVALUE(IMMEDIATE) TO WS-VAL
           MOVE DFHVALUE(IMMQUIESCED) TO WS-VAL
           MOVE DFHVALUE(IMPORT) TO WS-VAL
           MOVE DFHVALUE(INACTIVE) TO WS-VAL
           MOVE DFHVALUE(INBOUND) TO WS-VAL
           MOVE DFHVALUE(INCOMPLETE) TO WS-VAL
           MOVE DFHVALUE(INDEXRECFULL) TO WS-VAL
           MOVE DFHVALUE(INDIRECT) TO WS-VAL
           MOVE DFHVALUE(INDOUBT) TO WS-VAL
           MOVE DFHVALUE(INFLIGHT) TO WS-VAL
           MOVE DFHVALUE(INITCOMPLETE) TO WS-VAL
           MOVE DFHVALUE(INITIAL) TO WS-VAL
           MOVE DFHVALUE(INITING) TO WS-VAL
           MOVE DFHVALUE(INOUT) TO WS-VAL
           MOVE DFHVALUE(INPUT) TO WS-VAL
           MOVE DFHVALUE(INSERVICE) TO WS-VAL
           MOVE DFHVALUE(INSTALLED) TO WS-VAL
           MOVE DFHVALUE(INSTALLFAIL) TO WS-VAL
           MOVE DFHVALUE(INTERNAL) TO WS-VAL
           MOVE DFHVALUE(INTRA) TO WS-VAL
           MOVE DFHVALUE(INTSTART) TO WS-VAL
           MOVE DFHVALUE(INTSTOP) TO WS-VAL
           MOVE DFHVALUE(INVALID) TO WS-VAL
           MOVE DFHVALUE(IOERROR) TO WS-VAL
           MOVE DFHVALUE(IPCONN) TO WS-VAL
           MOVE DFHVALUE(IPECI) TO WS-VAL
           MOVE DFHVALUE(IPIC) TO WS-VAL
           MOVE DFHVALUE(IPV4) TO WS-VAL
           MOVE DFHVALUE(IPV6) TO WS-VAL
           MOVE DFHVALUE(IRC) TO WS-VAL
           MOVE DFHVALUE(ISNOTGREATER) TO WS-VAL
           MOVE DFHVALUE(ISNOTLESS) TO WS-VAL
           MOVE DFHVALUE(ISOLATE) TO WS-VAL
           MOVE DFHVALUE(JAVA) TO WS-VAL
           MOVE DFHVALUE(JAVACORE) TO WS-VAL
           MOVE DFHVALUE(JOURNALMODEL) TO WS-VAL
           MOVE DFHVALUE(JOURNALNAME) TO WS-VAL
           MOVE DFHVALUE(JOURNALNUM) TO WS-VAL
           MOVE DFHVALUE(JVM) TO WS-VAL
           MOVE DFHVALUE(JVMPOOL) TO WS-VAL
           MOVE DFHVALUE(JVMPROFILE) TO WS-VAL
           MOVE DFHVALUE(JVMPROGRAM) TO WS-VAL
           MOVE DFHVALUE(JVMSERVER) TO WS-VAL
           MOVE DFHVALUE(JWT) TO WS-VAL
           MOVE DFHVALUE(KATAKANA) TO WS-VAL
           MOVE DFHVALUE(KEEP) TO WS-VAL
           MOVE DFHVALUE(KERBEROS) TO WS-VAL
           MOVE DFHVALUE(KEYED) TO WS-VAL
           MOVE DFHVALUE(KILL) TO WS-VAL
           MOVE DFHVALUE(KSDS) TO WS-VAL
           MOVE DFHVALUE(LCKSTRUCFULL) TO WS-VAL
           MOVE DFHVALUE(LEAVE) TO WS-VAL
           MOVE DFHVALUE(LESSTHAN) TO WS-VAL
           MOVE DFHVALUE(LE370) TO WS-VAL
           MOVE DFHVALUE(LIBERTY) TO WS-VAL
           MOVE DFHVALUE(LIBRARY) TO WS-VAL
           MOVE DFHVALUE(LIC) TO WS-VAL
           MOVE DFHVALUE(LIGHTPEN) TO WS-VAL
           MOVE DFHVALUE(LINK) TO WS-VAL
           MOVE DFHVALUE(LOAD) TO WS-VAL
           MOVE DFHVALUE(LOC24) TO WS-VAL
           MOVE DFHVALUE(LOC31) TO WS-VAL
           MOVE DFHVALUE(LOCAL) TO WS-VAL
           MOVE DFHVALUE(LOCKING) TO WS-VAL
           MOVE DFHVALUE(LOG) TO WS-VAL
           MOVE DFHVALUE(LOGICAL) TO WS-VAL
           MOVE DFHVALUE(LOGREPLICATE) TO WS-VAL
           MOVE DFHVALUE(LOGTERM) TO WS-VAL
           MOVE DFHVALUE(LOSE) TO WS-VAL
           MOVE DFHVALUE(LOW) TO WS-VAL
           MOVE DFHVALUE(LPA) TO WS-VAL
           MOVE DFHVALUE(LSRPOOL) TO WS-VAL
           MOVE DFHVALUE(LUP) TO WS-VAL
           MOVE DFHVALUE(LUSTAT) TO WS-VAL
           MOVE DFHVALUE(LUW) TO WS-VAL
           MOVE DFHVALUE(LU61) TO WS-VAL
           MOVE DFHVALUE(MAIN) TO WS-VAL
           MOVE DFHVALUE(MAP) TO WS-VAL
           MOVE DFHVALUE(MAPSET) TO WS-VAL
           MOVE DFHVALUE(MCHCTL) TO WS-VAL
           MOVE DFHVALUE(MDT) TO WS-VAL
           MOVE DFHVALUE(METADATA) TO WS-VAL
           MOVE DFHVALUE(MESSAGEID) TO WS-VAL
           MOVE DFHVALUE(MIXED) TO WS-VAL
           MOVE DFHVALUE(MNPS) TO WS-VAL
           MOVE DFHVALUE(MOD) TO WS-VAL
           MOVE DFHVALUE(MODEANY) TO WS-VAL
           MOVE DFHVALUE(MODEL) TO WS-VAL
           MOVE DFHVALUE(MODE24) TO WS-VAL
           MOVE DFHVALUE(MODE31) TO WS-VAL
           MOVE DFHVALUE(MONITOR) TO WS-VAL
           MOVE DFHVALUE(MORE) TO WS-VAL
           MOVE DFHVALUE(MQCONN) TO WS-VAL
           MOVE DFHVALUE(MRO) TO WS-VAL
           MOVE DFHVALUE(MSRCONTROL) TO WS-VAL
           MOVE DFHVALUE(MTOM) TO WS-VAL
           MOVE DFHVALUE(MTOMNOXOP) TO WS-VAL
           MOVE DFHVALUE(MVS) TO WS-VAL
           MOVE DFHVALUE(MVSTCB) TO WS-VAL
           MOVE DFHVALUE(NEGATIVE) TO WS-VAL
           MOVE DFHVALUE(NEW) TO WS-VAL
           MOVE DFHVALUE(NEWCOPY) TO WS-VAL
           MOVE DFHVALUE(NEWSESSION) TO WS-VAL
           MOVE DFHVALUE(NOALARM) TO WS-VAL
           MOVE DFHVALUE(NOALTPRTCOPY) TO WS-VAL
           MOVE DFHVALUE(NOANALYZER) TO WS-VAL
           MOVE DFHVALUE(NOAPLKYBD) TO WS-VAL
           MOVE DFHVALUE(NOAPLTEXT) TO WS-VAL
           MOVE DFHVALUE(NOAPPEND) TO WS-VAL
           MOVE DFHVALUE(NOAPPLNAME) TO WS-VAL
           MOVE DFHVALUE(NOATI) TO WS-VAL
           MOVE DFHVALUE(NOAUDALARM) TO WS-VAL
           MOVE DFHVALUE(NOAUTHENTIC) TO WS-VAL
           MOVE DFHVALUE(NOAUTO) TO WS-VAL
           MOVE DFHVALUE(NOAUTOARCH) TO WS-VAL
           MOVE DFHVALUE(NOAUTOSTART) TO WS-VAL
           MOVE DFHVALUE(NOBACKOUT) TO WS-VAL
           MOVE DFHVALUE(NOBACKTRANS) TO WS-VAL
           MOVE DFHVALUE(NOCEDF) TO WS-VAL
           MOVE DFHVALUE(NOCLASSCACHE) TO WS-VAL
           MOVE DFHVALUE(NOCLEAR) TO WS-VAL
           MOVE DFHVALUE(NOCLICONVERT) TO WS-VAL
           MOVE DFHVALUE(NOCLOSE) TO WS-VAL
           MOVE DFHVALUE(NOCMDPROT) TO WS-VAL
           MOVE DFHVALUE(NOCOLOR) TO WS-VAL
           MOVE DFHVALUE(NOCOMPAT) TO WS-VAL
           MOVE DFHVALUE(NOCOMPRESS) TO WS-VAL
           MOVE DFHVALUE(NOCONNECT) TO WS-VAL
           MOVE DFHVALUE(NOCONV) TO WS-VAL
           MOVE DFHVALUE(NOCONVERSE) TO WS-VAL
           MOVE DFHVALUE(NOCONVERT) TO WS-VAL
           MOVE DFHVALUE(NOCOPY) TO WS-VAL
           MOVE DFHVALUE(NOCREATE) TO WS-VAL
           MOVE DFHVALUE(NOCTL) TO WS-VAL
           MOVE DFHVALUE(NODAEOPT) TO WS-VAL
           MOVE DFHVALUE(NODE) TO WS-VAL
           MOVE DFHVALUE(NODEBUG) TO WS-VAL
           MOVE DFHVALUE(NODEJSAPP) TO WS-VAL
           MOVE DFHVALUE(NODISCREQ) TO WS-VAL
           MOVE DFHVALUE(NODOCDELETE) TO WS-VAL
           MOVE DFHVALUE(NODUALCASE) TO WS-VAL
           MOVE DFHVALUE(NOEMPTYREQ) TO WS-VAL
           MOVE DFHVALUE(NOEVENT) TO WS-VAL
           MOVE DFHVALUE(NOEXCEPT) TO WS-VAL
           MOVE DFHVALUE(NOEXCTL) TO WS-VAL
           MOVE DFHVALUE(NOEXIT) TO WS-VAL
           MOVE DFHVALUE(NOEXITTRACE) TO WS-VAL
           MOVE DFHVALUE(NOEXTENDEDDS) TO WS-VAL
           MOVE DFHVALUE(NOFMH) TO WS-VAL
           MOVE DFHVALUE(NOFMHPARM) TO WS-VAL
           MOVE DFHVALUE(NOFORCE) TO WS-VAL
           MOVE DFHVALUE(NOFORMATEDF) TO WS-VAL
           MOVE DFHVALUE(NOFORMFEED) TO WS-VAL
           MOVE DFHVALUE(NOHFORM) TO WS-VAL
           MOVE DFHVALUE(NOHILIGHT) TO WS-VAL
           MOVE DFHVALUE(NOHOLD) TO WS-VAL
           MOVE DFHVALUE(NOIDNTY) TO WS-VAL
           MOVE DFHVALUE(NOINCONVERT) TO WS-VAL
           MOVE DFHVALUE(NOISOLATE) TO WS-VAL
           MOVE DFHVALUE(NOJVM) TO WS-VAL
           MOVE DFHVALUE(NOKATAKANA) TO WS-VAL
           MOVE DFHVALUE(NOKEEP) TO WS-VAL
           MOVE DFHVALUE(NOLIGHTPEN) TO WS-VAL
           MOVE DFHVALUE(NOLOAD) TO WS-VAL
           MOVE DFHVALUE(NOLOG) TO WS-VAL
           MOVE DFHVALUE(NOLOGREPLICA) TO WS-VAL
           MOVE DFHVALUE(NOLOSTLOCKS) TO WS-VAL
           MOVE DFHVALUE(NOMDT) TO WS-VAL
           MOVE DFHVALUE(NOMSGJRNL) TO WS-VAL
           MOVE DFHVALUE(NOMSRCONTROL) TO WS-VAL
           MOVE DFHVALUE(NOMTOM) TO WS-VAL
           MOVE DFHVALUE(NOMTOMNOXOP) TO WS-VAL
           MOVE DFHVALUE(NONAUTOCONN) TO WS-VAL
           MOVE DFHVALUE(NONCICS) TO WS-VAL
           MOVE DFHVALUE(NONCRITICAL) TO WS-VAL
           MOVE DFHVALUE(NONE) TO WS-VAL
           MOVE DFHVALUE(NONLE370) TO WS-VAL
           MOVE DFHVALUE(NONRESIDENT) TO WS-VAL
           MOVE DFHVALUE(NONTRANS) TO WS-VAL
           MOVE DFHVALUE(NOOBFORMAT) TO WS-VAL
           MOVE DFHVALUE(NOOBOPERID) TO WS-VAL
           MOVE DFHVALUE(NOOUTCONVERT) TO WS-VAL
           MOVE DFHVALUE(NOOUTLINE) TO WS-VAL
           MOVE DFHVALUE(NOPARTITIONS) TO WS-VAL
           MOVE DFHVALUE(NOPERF) TO WS-VAL
           MOVE DFHVALUE(NOPHASEOUT) TO WS-VAL
           MOVE DFHVALUE(NOPRESETSEC) TO WS-VAL
           MOVE DFHVALUE(NOPRINTADAPT) TO WS-VAL
           MOVE DFHVALUE(NOPROGSYMBOL) TO WS-VAL
           MOVE DFHVALUE(NOPRTCOPY) TO WS-VAL
           MOVE DFHVALUE(NOPS) TO WS-VAL
           MOVE DFHVALUE(NOQUERY) TO WS-VAL
           MOVE DFHVALUE(NORECOVDATA) TO WS-VAL
           MOVE DFHVALUE(NOREENTPROT) TO WS-VAL
           MOVE DFHVALUE(NORELEASE) TO WS-VAL
           MOVE DFHVALUE(NORELREQ) TO WS-VAL
           MOVE DFHVALUE(NOREPLICATOR) TO WS-VAL
           MOVE DFHVALUE(NORESRCE) TO WS-VAL
           MOVE DFHVALUE(NORESYNC) TO WS-VAL
           MOVE DFHVALUE(NORETAINED) TO WS-VAL
           MOVE DFHVALUE(NOREUSE) TO WS-VAL
           MOVE DFHVALUE(NORMAL) TO WS-VAL
           MOVE DFHVALUE(NORMALBKOUT) TO WS-VAL
           MOVE DFHVALUE(NORMALRESP) TO WS-VAL
           MOVE DFHVALUE(NORMI) TO WS-VAL
           MOVE DFHVALUE(NOROLLBACK) TO WS-VAL
           MOVE DFHVALUE(NOSECURITY) TO WS-VAL
           MOVE DFHVALUE(NOSENDMTOM) TO WS-VAL
           MOVE DFHVALUE(NOSHUTDOWN) TO WS-VAL
           MOVE DFHVALUE(NOSOSI) TO WS-VAL
           MOVE DFHVALUE(NOSPI) TO WS-VAL
           MOVE DFHVALUE(NOSRVCONVERT) TO WS-VAL
           MOVE DFHVALUE(NOSSL) TO WS-VAL
           MOVE DFHVALUE(NOSTSN) TO WS-VAL
           MOVE DFHVALUE(NOSWITCH) TO WS-VAL
           MOVE DFHVALUE(NOSYNCPOINT) TO WS-VAL
           MOVE DFHVALUE(NOSYSDUMP) TO WS-VAL
           MOVE DFHVALUE(NOSYSLOG) TO WS-VAL
           MOVE DFHVALUE(NOTADDABLE) TO WS-VAL
           MOVE DFHVALUE(NOTALLOWED) TO WS-VAL
           MOVE DFHVALUE(NOTALTERABLE) TO WS-VAL
           MOVE DFHVALUE(NOTAPPLIC) TO WS-VAL
           MOVE DFHVALUE(NOTASKSTART) TO WS-VAL
           MOVE DFHVALUE(NOTBRWBLE) TO WS-VAL
           MOVE DFHVALUE(NOTBUSY) TO WS-VAL
           MOVE DFHVALUE(NOTCDEB) TO WS-VAL
           MOVE DFHVALUE(NOTCONNECTED) TO WS-VAL
           MOVE DFHVALUE(NOTCTRLABLE) TO WS-VAL
           MOVE DFHVALUE(NOTDEFINED) TO WS-VAL
           MOVE DFHVALUE(NOTDELBLE) TO WS-VAL
           MOVE DFHVALUE(NOTDYNAMIC) TO WS-VAL
           MOVE DFHVALUE(NOTEMPTY) TO WS-VAL
           MOVE DFHVALUE(NOTEXTENDED) TO WS-VAL
           MOVE DFHVALUE(NOTERMINAL) TO WS-VAL
           MOVE DFHVALUE(NOTEXTKYBD) TO WS-VAL
           MOVE DFHVALUE(NOTEXTPRINT) TO WS-VAL
           MOVE DFHVALUE(NOTFIRED) TO WS-VAL
           MOVE DFHVALUE(NOTFWDRCVBLE) TO WS-VAL
           MOVE DFHVALUE(NOTHOTPOOL) TO WS-VAL
           MOVE DFHVALUE(NOTINBOUND) TO WS-VAL
           MOVE DFHVALUE(NOTINIT) TO WS-VAL
           MOVE DFHVALUE(NOTINSTALLED) TO WS-VAL
           MOVE DFHVALUE(NOTKEYED) TO WS-VAL
           MOVE DFHVALUE(NOTLPA) TO WS-VAL
           MOVE DFHVALUE(NOTPENDING) TO WS-VAL
           MOVE DFHVALUE(NOTPURGEABLE) TO WS-VAL
           MOVE DFHVALUE(NOTRANDUMP) TO WS-VAL
           MOVE DFHVALUE(NOTREADABLE) TO WS-VAL
           MOVE DFHVALUE(NOTREADY) TO WS-VAL
           MOVE DFHVALUE(NOTRECOVABLE) TO WS-VAL
           MOVE DFHVALUE(NOTREQUIRED) TO WS-VAL
           MOVE DFHVALUE(NOTRLS) TO WS-VAL
           MOVE DFHVALUE(NOTROUTABLE) TO WS-VAL
           MOVE DFHVALUE(NOTSOS) TO WS-VAL
           MOVE DFHVALUE(NOTSUPPORTED) TO WS-VAL
           MOVE DFHVALUE(NOTSUSPENDED) TO WS-VAL
           MOVE DFHVALUE(NOTTABLE) TO WS-VAL
           MOVE DFHVALUE(NOTTI) TO WS-VAL
           MOVE DFHVALUE(NOTUPDBLE) TO WS-VAL
           MOVE DFHVALUE(NOTWAIT) TO WS-VAL
           MOVE DFHVALUE(NOUCTRAN) TO WS-VAL
           MOVE DFHVALUE(NOUSER) TO WS-VAL
           MOVE DFHVALUE(NOVALIDATION) TO WS-VAL
           MOVE DFHVALUE(NOVFORM) TO WS-VAL
           MOVE DFHVALUE(NOWAIT) TO WS-VAL
           MOVE DFHVALUE(NOWRITE) TO WS-VAL
           MOVE DFHVALUE(NOXOPDIRECT) TO WS-VAL
           MOVE DFHVALUE(NOXOPSUPPORT) TO WS-VAL
           MOVE DFHVALUE(NOZCPTRACE) TO WS-VAL
           MOVE DFHVALUE(NRS) TO WS-VAL
           MOVE DFHVALUE(N906) TO WS-VAL
           MOVE DFHVALUE(N906D) TO WS-VAL
           MOVE DFHVALUE(OBFORMAT) TO WS-VAL
           MOVE DFHVALUE(OBOPERID) TO WS-VAL
           MOVE DFHVALUE(OBTAINING) TO WS-VAL
           MOVE DFHVALUE(OFF) TO WS-VAL
           MOVE DFHVALUE(OK) TO WS-VAL
           MOVE DFHVALUE(OLD) TO WS-VAL
           MOVE DFHVALUE(OLDCOPY) TO WS-VAL
           MOVE DFHVALUE(OLDSESSION) TO WS-VAL
           MOVE DFHVALUE(ON) TO WS-VAL
           MOVE DFHVALUE(OPEN) TO WS-VAL
           MOVE DFHVALUE(OPENAPI) TO WS-VAL
           MOVE DFHVALUE(OPENERROR) TO WS-VAL
           MOVE DFHVALUE(OPENING) TO WS-VAL
           MOVE DFHVALUE(OPENINPUT) TO WS-VAL
           MOVE DFHVALUE(OPENOUTPUT) TO WS-VAL
           MOVE DFHVALUE(OPID) TO WS-VAL
           MOVE DFHVALUE(OPTIONAL) TO WS-VAL
           MOVE DFHVALUE(OPTIONS) TO WS-VAL
           MOVE DFHVALUE(OR) TO WS-VAL
           MOVE DFHVALUE(OSGI) TO WS-VAL
           MOVE DFHVALUE(OTS) TO WS-VAL
           MOVE DFHVALUE(OUTLINE) TO WS-VAL
           MOVE DFHVALUE(OUTPUT) TO WS-VAL
           MOVE DFHVALUE(OUTSERVICE) TO WS-VAL
           MOVE DFHVALUE(OVERRIDE) TO WS-VAL
           MOVE DFHVALUE(OWNER) TO WS-VAL
           MOVE DFHVALUE(PAGEABLE) TO WS-VAL
           MOVE DFHVALUE(PARTITIONS) TO WS-VAL
           MOVE DFHVALUE(PARTITIONSET) TO WS-VAL
           MOVE DFHVALUE(PARTNER) TO WS-VAL
           MOVE DFHVALUE(PATCH) TO WS-VAL
           MOVE DFHVALUE(PATH) TO WS-VAL
           MOVE DFHVALUE(PAUSED) TO WS-VAL
           MOVE DFHVALUE(PDSMEMBER) TO WS-VAL
           MOVE DFHVALUE(PENDBEGIN) TO WS-VAL
           MOVE DFHVALUE(PENDDATA) TO WS-VAL
           MOVE DFHVALUE(PENDFREE) TO WS-VAL
           MOVE DFHVALUE(PENDING) TO WS-VAL
           MOVE DFHVALUE(PENDINIT) TO WS-VAL
           MOVE DFHVALUE(PENDPASS) TO WS-VAL
           MOVE DFHVALUE(PENDRECEIVE) TO WS-VAL
           MOVE DFHVALUE(PENDRELEASE) TO WS-VAL
           MOVE DFHVALUE(PENDRESOLVE) TO WS-VAL
           MOVE DFHVALUE(PENDSTART) TO WS-VAL
           MOVE DFHVALUE(PENDSTSN) TO WS-VAL
           MOVE DFHVALUE(PENDUNSOL) TO WS-VAL
           MOVE DFHVALUE(PERF) TO WS-VAL
           MOVE DFHVALUE(PERMANENT) TO WS-VAL
           MOVE DFHVALUE(PHASEIN) TO WS-VAL
           MOVE DFHVALUE(PHASEOUT) TO WS-VAL
           MOVE DFHVALUE(PHYSICAL) TO WS-VAL
           MOVE DFHVALUE(PIPELINE) TO WS-VAL
           MOVE DFHVALUE(PLI) TO WS-VAL
           MOVE DFHVALUE(PL1) TO WS-VAL
           MOVE DFHVALUE(POLICY) TO WS-VAL
           MOVE DFHVALUE(POLICYRULE) TO WS-VAL
           MOVE DFHVALUE(POLICYSCOPE) TO WS-VAL
           MOVE DFHVALUE(POOL) TO WS-VAL
           MOVE DFHVALUE(POSITIVE) TO WS-VAL
           MOVE DFHVALUE(POST) TO WS-VAL
           MOVE DFHVALUE(POSTCOMMAND) TO WS-VAL
           MOVE DFHVALUE(PRECOMMAND) TO WS-VAL
           MOVE DFHVALUE(PRESETSEC) TO WS-VAL
           MOVE DFHVALUE(PRIMARY) TO WS-VAL
           MOVE DFHVALUE(PRINCIPAL) TO WS-VAL
           MOVE DFHVALUE(PRINTADAPT) TO WS-VAL
           MOVE DFHVALUE(PRIVATE) TO WS-VAL
           MOVE DFHVALUE(PROCESS) TO WS-VAL
           MOVE DFHVALUE(PROCESSTYPE) TO WS-VAL
           MOVE DFHVALUE(PROFILE) TO WS-VAL
           MOVE DFHVALUE(PROGAUTO) TO WS-VAL
           MOVE DFHVALUE(PROGRAM) TO WS-VAL
           MOVE DFHVALUE(PROGRAMDEF) TO WS-VAL
           MOVE DFHVALUE(PROGRAMINIT) TO WS-VAL
           MOVE DFHVALUE(PROGSYMBOL) TO WS-VAL
           MOVE DFHVALUE(PROTECTED) TO WS-VAL
           MOVE DFHVALUE(PROVIDER) TO WS-VAL
           MOVE DFHVALUE(PRTCOPY) TO WS-VAL
           MOVE DFHVALUE(PUBLISH) TO WS-VAL
           MOVE DFHVALUE(PURGE) TO WS-VAL
           MOVE DFHVALUE(PURGEABLE) TO WS-VAL
           MOVE DFHVALUE(PUT) TO WS-VAL
           MOVE DFHVALUE(QR) TO WS-VAL
           MOVE DFHVALUE(QUASIRENT) TO WS-VAL
           MOVE DFHVALUE(QUEUE) TO WS-VAL
           MOVE DFHVALUE(QUIESCED) TO WS-VAL
           MOVE DFHVALUE(QUIESCING) TO WS-VAL
           MOVE DFHVALUE(READABLE) TO WS-VAL
           MOVE DFHVALUE(READBACK) TO WS-VAL
           MOVE DFHVALUE(READONLY) TO WS-VAL
           MOVE DFHVALUE(READY) TO WS-VAL
           MOVE DFHVALUE(REBUILD) TO WS-VAL
           MOVE DFHVALUE(RECEIVE) TO WS-VAL
           MOVE DFHVALUE(RECEIVER) TO WS-VAL
           MOVE DFHVALUE(RECONNECT) TO WS-VAL
           MOVE DFHVALUE(RECOVDATA) TO WS-VAL
           MOVE DFHVALUE(RECOVERABLE) TO WS-VAL
           MOVE DFHVALUE(RECOVERED) TO WS-VAL
           MOVE DFHVALUE(RECOVERLOCKS) TO WS-VAL
           MOVE DFHVALUE(RECOVERY) TO WS-VAL
           MOVE DFHVALUE(REENTPROT) TO WS-VAL
           MOVE DFHVALUE(REFPARMS) TO WS-VAL
           MOVE DFHVALUE(REFRESH) TO WS-VAL
           MOVE DFHVALUE(REFRESHPKGS) TO WS-VAL
           MOVE DFHVALUE(REGERROR) TO WS-VAL
           MOVE DFHVALUE(REGION) TO WS-VAL
           MOVE DFHVALUE(REGISTERED) TO WS-VAL
           MOVE DFHVALUE(REJECT) TO WS-VAL
           MOVE DFHVALUE(RELATED) TO WS-VAL
           MOVE DFHVALUE(RELEASE) TO WS-VAL
           MOVE DFHVALUE(RELEASED) TO WS-VAL
           MOVE DFHVALUE(RELEASING) TO WS-VAL
           MOVE DFHVALUE(RELOAD) TO WS-VAL
           MOVE DFHVALUE(RELOADING) TO WS-VAL
           MOVE DFHVALUE(RELREQ) TO WS-VAL
           MOVE DFHVALUE(REMLOSTLOCKS) TO WS-VAL
           MOVE DFHVALUE(REMOTE) TO WS-VAL
           MOVE DFHVALUE(REMOVE) TO WS-VAL
           MOVE DFHVALUE(REMSESSION) TO WS-VAL
           MOVE DFHVALUE(REMTABLE) TO WS-VAL
           MOVE DFHVALUE(REPEATABLE) TO WS-VAL
           MOVE DFHVALUE(REPLICATOR) TO WS-VAL
           MOVE DFHVALUE(REPLYTOEPR) TO WS-VAL
           MOVE DFHVALUE(REQCONTEXT) TO WS-VAL
           MOVE DFHVALUE(REQUEST) TO WS-VAL
           MOVE DFHVALUE(REQUESTER) TO WS-VAL
           MOVE DFHVALUE(REQUESTMODEL) TO WS-VAL
           MOVE DFHVALUE(REQUIRED) TO WS-VAL
           MOVE DFHVALUE(REREAD) TO WS-VAL
           MOVE DFHVALUE(RESET) TO WS-VAL
           MOVE DFHVALUE(RESETLOCKS) TO WS-VAL
           MOVE DFHVALUE(RESIDENT) TO WS-VAL
           MOVE DFHVALUE(RESOLVED) TO WS-VAL
           MOVE DFHVALUE(RESOLVING) TO WS-VAL
           MOVE DFHVALUE(RESPCONTEXT) TO WS-VAL
           MOVE DFHVALUE(RESPECTED) TO WS-VAL
           MOVE DFHVALUE(RESRCE) TO WS-VAL
           MOVE DFHVALUE(RESSECEXT) TO WS-VAL
           MOVE DFHVALUE(RESSECINT) TO WS-VAL
           MOVE DFHVALUE(RESSECNO) TO WS-VAL
           MOVE DFHVALUE(RESSECYES) TO WS-VAL
           MOVE DFHVALUE(RESUMED) TO WS-VAL
           MOVE DFHVALUE(RESYNC) TO WS-VAL
           MOVE DFHVALUE(RETAINED) TO WS-VAL
           MOVE DFHVALUE(RETRACT) TO WS-VAL
           MOVE DFHVALUE(RETRY) TO WS-VAL
           MOVE DFHVALUE(REUSE) TO WS-VAL
           MOVE DFHVALUE(REVERTED) TO WS-VAL
           MOVE DFHVALUE(RFC1123) TO WS-VAL
           MOVE DFHVALUE(RFC3339) TO WS-VAL
           MOVE DFHVALUE(RLS) TO WS-VAL
           MOVE DFHVALUE(RLSACTIVE) TO WS-VAL
           MOVE DFHVALUE(RLSGONE) TO WS-VAL
           MOVE DFHVALUE(RLSINACTIVE) TO WS-VAL
           MOVE DFHVALUE(RLSSERVER) TO WS-VAL
           MOVE DFHVALUE(RMI) TO WS-VAL
           MOVE DFHVALUE(ROLLBACK) TO WS-VAL
           MOVE DFHVALUE(ROUTABLE) TO WS-VAL
           MOVE DFHVALUE(ROUTE) TO WS-VAL
           MOVE DFHVALUE(RPG) TO WS-VAL
           MOVE DFHVALUE(RRCOMMITFAIL) TO WS-VAL
           MOVE DFHVALUE(RRDS) TO WS-VAL
           MOVE DFHVALUE(RREPL) TO WS-VAL
           MOVE DFHVALUE(RRINDOUBT) TO WS-VAL
           MOVE DFHVALUE(RRMS) TO WS-VAL
           MOVE DFHVALUE(RRSUR) TO WS-VAL
           MOVE DFHVALUE(RTR) TO WS-VAL
           MOVE DFHVALUE(RU) TO WS-VAL
           MOVE DFHVALUE(RUNNING) TO WS-VAL
           MOVE DFHVALUE(RZINSTOR) TO WS-VAL
           MOVE DFHVALUE(SAMESENDMTOM) TO WS-VAL
           MOVE DFHVALUE(SCAN) TO WS-VAL
           MOVE DFHVALUE(SCHEDULER) TO WS-VAL
           MOVE DFHVALUE(SCS) TO WS-VAL
           MOVE DFHVALUE(SECERROR) TO WS-VAL
           MOVE DFHVALUE(SECONDINIT) TO WS-VAL
           MOVE DFHVALUE(SECURITY) TO WS-VAL
           MOVE DFHVALUE(SECUSER) TO WS-VAL
           MOVE DFHVALUE(SEND) TO WS-VAL
           MOVE DFHVALUE(SENDER) TO WS-VAL
           MOVE DFHVALUE(SENDMTOM) TO WS-VAL
           MOVE DFHVALUE(SERVER) TO WS-VAL
           MOVE DFHVALUE(SERVERDUMP) TO WS-VAL
           MOVE DFHVALUE(SERVICE) TO WS-VAL
           MOVE DFHVALUE(SESSION) TO WS-VAL
           MOVE DFHVALUE(SESSIONFAIL) TO WS-VAL
           MOVE DFHVALUE(SESSIONLOST) TO WS-VAL
           MOVE DFHVALUE(SESSIONS) TO WS-VAL
           MOVE DFHVALUE(SETFAIL) TO WS-VAL
           MOVE DFHVALUE(SHARE) TO WS-VAL
           MOVE DFHVALUE(SHARED) TO WS-VAL
           MOVE DFHVALUE(SHUNTED) TO WS-VAL
           MOVE DFHVALUE(SHUTDISABLED) TO WS-VAL
           MOVE DFHVALUE(SHUTDOWN) TO WS-VAL
           MOVE DFHVALUE(SHUTENABLED) TO WS-VAL
           MOVE DFHVALUE(SIGN) TO WS-VAL
           MOVE DFHVALUE(SIGNEDOFF) TO WS-VAL
           MOVE DFHVALUE(SIGNEDON) TO WS-VAL
           MOVE DFHVALUE(SINGLEOFF) TO WS-VAL
           MOVE DFHVALUE(SINGLEON) TO WS-VAL
           MOVE DFHVALUE(SKIP) TO WS-VAL
           MOVE DFHVALUE(SMF) TO WS-VAL
           MOVE DFHVALUE(SNAPTRACE) TO WS-VAL
           MOVE DFHVALUE(SNPS) TO WS-VAL
           MOVE DFHVALUE(SOAP) TO WS-VAL
           MOVE DFHVALUE(SOCKET) TO WS-VAL
           MOVE DFHVALUE(SOMEAVAIL) TO WS-VAL
           MOVE DFHVALUE(SOS) TO WS-VAL
           MOVE DFHVALUE(SOSABOVE) TO WS-VAL
           MOVE DFHVALUE(SOSBELOW) TO WS-VAL
           MOVE DFHVALUE(SOSI) TO WS-VAL
           MOVE DFHVALUE(SPECIAL) TO WS-VAL
           MOVE DFHVALUE(SPECIFIC) TO WS-VAL
           MOVE DFHVALUE(SPECTRACE) TO WS-VAL
           MOVE DFHVALUE(SPI) TO WS-VAL
           MOVE DFHVALUE(SPRSTRACE) TO WS-VAL
           MOVE DFHVALUE(SQLCODE) TO WS-VAL
           MOVE DFHVALUE(SRVCONVERT) TO WS-VAL
           MOVE DFHVALUE(SSL) TO WS-VAL
           MOVE DFHVALUE(STACKTRACE) TO WS-VAL
           MOVE DFHVALUE(STANDARD) TO WS-VAL
           MOVE DFHVALUE(STANDBY) TO WS-VAL
           MOVE DFHVALUE(STANTRACE) TO WS-VAL
           MOVE DFHVALUE(START) TO WS-VAL
           MOVE DFHVALUE(STARTED) TO WS-VAL
           MOVE DFHVALUE(STARTING) TO WS-VAL
           MOVE DFHVALUE(STARTTERM) TO WS-VAL
           MOVE DFHVALUE(STARTING) TO WS-VAL
           MOVE DFHVALUE(STARTSWITH) TO WS-VAL
           MOVE DFHVALUE(STARTUP) TO WS-VAL
           MOVE DFHVALUE(STATIC) TO WS-VAL
           MOVE DFHVALUE(STATS) TO WS-VAL
           MOVE DFHVALUE(STOPPED) TO WS-VAL
           MOVE DFHVALUE(STOPPING) TO WS-VAL
           MOVE DFHVALUE(STORAGE) TO WS-VAL
           MOVE DFHVALUE(STREAMNAME) TO WS-VAL
           MOVE DFHVALUE(STSN) TO WS-VAL
           MOVE DFHVALUE(STSNSET) TO WS-VAL
           MOVE DFHVALUE(STSNTEST) TO WS-VAL
           MOVE DFHVALUE(SUBORDINATE) TO WS-VAL
           MOVE DFHVALUE(SUBPOOL) TO WS-VAL
           MOVE DFHVALUE(SUBSPACE) TO WS-VAL
           MOVE DFHVALUE(SUMMUNLIKE) TO WS-VAL
           MOVE DFHVALUE(SUPPORTED) TO WS-VAL
           MOVE DFHVALUE(SURROGATE) TO WS-VAL
           MOVE DFHVALUE(SUSPENDED) TO WS-VAL
           MOVE DFHVALUE(SWITCH) TO WS-VAL
           MOVE DFHVALUE(SWITCHALL) TO WS-VAL
           MOVE DFHVALUE(SWITCHING) TO WS-VAL
           MOVE DFHVALUE(SWITCHNEXT) TO WS-VAL
           MOVE DFHVALUE(SYNCFREE) TO WS-VAL
           MOVE DFHVALUE(SYNCHRONOUS) TO WS-VAL
           MOVE DFHVALUE(SYNCPOINT) TO WS-VAL
           MOVE DFHVALUE(SYNCRECV) TO WS-VAL
           MOVE DFHVALUE(SYNCSEND) TO WS-VAL
           MOVE DFHVALUE(SYSCONNECT) TO WS-VAL
           MOVE DFHVALUE(SYSDUMP) TO WS-VAL
           MOVE DFHVALUE(SYSDUMPCODE) TO WS-VAL
           MOVE DFHVALUE(SYSLOG) TO WS-VAL
           MOVE DFHVALUE(SYSPLEX) TO WS-VAL
           MOVE DFHVALUE(SYSTEM) TO WS-VAL
           MOVE DFHVALUE(SYSTEMOFF) TO WS-VAL
           MOVE DFHVALUE(SYSTEMON) TO WS-VAL
           MOVE DFHVALUE(TABLE) TO WS-VAL
           MOVE DFHVALUE(TABLEMGR) TO WS-VAL
           MOVE DFHVALUE(TABLEONLY) TO WS-VAL
           MOVE DFHVALUE(TAKEOVER) TO WS-VAL
           MOVE DFHVALUE(TAPE1) TO WS-VAL
           MOVE DFHVALUE(TAPE2) TO WS-VAL
           MOVE DFHVALUE(TASK) TO WS-VAL
           MOVE DFHVALUE(TASKSUBPOOL) TO WS-VAL
           MOVE DFHVALUE(TASKSTART) TO WS-VAL
           MOVE DFHVALUE(TCAM) TO WS-VAL
           MOVE DFHVALUE(TCAMSNA) TO WS-VAL
           MOVE DFHVALUE(TCEXITALL) TO WS-VAL
           MOVE DFHVALUE(TCEXITALLOFF) TO WS-VAL
           MOVE DFHVALUE(TCEXITNONE) TO WS-VAL
           MOVE DFHVALUE(TCEXITSYSTEM) TO WS-VAL
           MOVE DFHVALUE(TCLASS) TO WS-VAL
           MOVE DFHVALUE(TCPIP) TO WS-VAL
           MOVE DFHVALUE(TCPIPSERVICE) TO WS-VAL
           MOVE DFHVALUE(TDQ) TO WS-VAL
           MOVE DFHVALUE(TDQUEUE) TO WS-VAL
           MOVE DFHVALUE(TEMPLATENAME) TO WS-VAL
           MOVE DFHVALUE(TEMPORARY) TO WS-VAL
           MOVE DFHVALUE(TERM) TO WS-VAL
           MOVE DFHVALUE(TERMINAL) TO WS-VAL
           MOVE DFHVALUE(TERMINATE) TO WS-VAL
           MOVE DFHVALUE(TEXTKYBD) TO WS-VAL
           MOVE DFHVALUE(TEXTPRINT) TO WS-VAL
           MOVE DFHVALUE(THIRDINIT) TO WS-VAL
           MOVE DFHVALUE(THREADSAFE) TO WS-VAL
           MOVE DFHVALUE(TIME) TO WS-VAL
           MOVE DFHVALUE(TIMEOUT) TO WS-VAL
           MOVE DFHVALUE(TIMER) TO WS-VAL
           MOVE DFHVALUE(TOEPR) TO WS-VAL
           MOVE DFHVALUE(TPOOL) TO WS-VAL
           MOVE DFHVALUE(TPS55M2) TO WS-VAL
           MOVE DFHVALUE(TPS55M3) TO WS-VAL
           MOVE DFHVALUE(TPS55M4) TO WS-VAL
           MOVE DFHVALUE(TPS55M5) TO WS-VAL
           MOVE DFHVALUE(TRACE) TO WS-VAL
           MOVE DFHVALUE(TRAN) TO WS-VAL
           MOVE DFHVALUE(TRANCLASS) TO WS-VAL
           MOVE DFHVALUE(TRANDATA) TO WS-VAL
           MOVE DFHVALUE(TRANDUMP) TO WS-VAL
           MOVE DFHVALUE(TRANDUMPCODE) TO WS-VAL
           MOVE DFHVALUE(TRANIDONLY) TO WS-VAL
           MOVE DFHVALUE(TRANS) TO WS-VAL
           MOVE DFHVALUE(TRANSACTION) TO WS-VAL
           MOVE DFHVALUE(TRANSTART) TO WS-VAL
           MOVE DFHVALUE(TSMODEL) TO WS-VAL
           MOVE DFHVALUE(TSQ) TO WS-VAL
           MOVE DFHVALUE(TSQUEUE) TO WS-VAL
           MOVE DFHVALUE(TTI) TO WS-VAL
           MOVE DFHVALUE(TWAIT) TO WS-VAL
           MOVE DFHVALUE(TX) TO WS-VAL
           MOVE DFHVALUE(TXID) TO WS-VAL
           MOVE DFHVALUE(TYPETERM) TO WS-VAL
           MOVE DFHVALUE(T3278M2) TO WS-VAL
           MOVE DFHVALUE(T3278M3) TO WS-VAL
           MOVE DFHVALUE(T3278M4) TO WS-VAL
           MOVE DFHVALUE(T3278M5) TO WS-VAL
           MOVE DFHVALUE(T3279M2) TO WS-VAL
           MOVE DFHVALUE(T3279M3) TO WS-VAL
           MOVE DFHVALUE(T3279M4) TO WS-VAL
           MOVE DFHVALUE(T3279M5) TO WS-VAL
           MOVE DFHVALUE(UCTRAN) TO WS-VAL
           MOVE DFHVALUE(UKOPEN) TO WS-VAL
           MOVE DFHVALUE(UNATTEMPTED) TO WS-VAL
           MOVE DFHVALUE(UNAVAILABLE) TO WS-VAL
           MOVE DFHVALUE(UNBLOCKED) TO WS-VAL
           MOVE DFHVALUE(UNCOMMITTED) TO WS-VAL
           MOVE DFHVALUE(UNCONNECTED) TO WS-VAL
           MOVE DFHVALUE(UNDEFINED) TO WS-VAL
           MOVE DFHVALUE(UNDETERMINED) TO WS-VAL
           MOVE DFHVALUE(UNENABLED) TO WS-VAL
           MOVE DFHVALUE(UNENABLING) TO WS-VAL
           MOVE DFHVALUE(UNEXPECTED) TO WS-VAL
           MOVE DFHVALUE(UNEXPIRED) TO WS-VAL
           MOVE DFHVALUE(UNINSTALLED) TO WS-VAL
           MOVE DFHVALUE(UNKNOWN) TO WS-VAL
           MOVE DFHVALUE(UNPROTECTED) TO WS-VAL
           MOVE DFHVALUE(UNQUIESCED) TO WS-VAL
           MOVE DFHVALUE(UNREGISTERED) TO WS-VAL
           MOVE DFHVALUE(UNRESOLVED) TO WS-VAL
           MOVE DFHVALUE(UNSOLDATA) TO WS-VAL
           MOVE DFHVALUE(UNUSABLE) TO WS-VAL
           MOVE DFHVALUE(UOW) TO WS-VAL
           MOVE DFHVALUE(UPDATABLE) TO WS-VAL
           MOVE DFHVALUE(UPDATING) TO WS-VAL
           MOVE DFHVALUE(URIMAP) TO WS-VAL
           MOVE DFHVALUE(URMTERMID) TO WS-VAL
           MOVE DFHVALUE(USER) TO WS-VAL
           MOVE DFHVALUE(USERDATAKEY) TO WS-VAL
           MOVE DFHVALUE(USEREXECKEY) TO WS-VAL
           MOVE DFHVALUE(USERID) TO WS-VAL
           MOVE DFHVALUE(USEROFF) TO WS-VAL
           MOVE DFHVALUE(USERON) TO WS-VAL
           MOVE DFHVALUE(USERTABLE) TO WS-VAL
           MOVE DFHVALUE(UTC) TO WS-VAL
           MOVE DFHVALUE(VALID) TO WS-VAL
           MOVE DFHVALUE(VALIDATION) TO WS-VAL
           MOVE DFHVALUE(VARIABLE) TO WS-VAL
           MOVE DFHVALUE(VERIFY) TO WS-VAL
           MOVE DFHVALUE(VFORM) TO WS-VAL
           MOVE DFHVALUE(VRRDS) TO WS-VAL
           MOVE DFHVALUE(VSAM) TO WS-VAL
           MOVE DFHVALUE(VTAM) TO WS-VAL
           MOVE DFHVALUE(WAIT) TO WS-VAL
           MOVE DFHVALUE(WAITCOMMIT) TO WS-VAL
           MOVE DFHVALUE(WAITER) TO WS-VAL
           MOVE DFHVALUE(WAITFORGET) TO WS-VAL
           MOVE DFHVALUE(WAITING) TO WS-VAL
           MOVE DFHVALUE(WAITRMI) TO WS-VAL
           MOVE DFHVALUE(WAITRRMS) TO WS-VAL
           MOVE DFHVALUE(WARMSTART) TO WS-VAL
           MOVE DFHVALUE(WBE) TO WS-VAL
           MOVE DFHVALUE(WEB) TO WS-VAL
           MOVE DFHVALUE(WEBSERVICE) TO WS-VAL
           MOVE DFHVALUE(WIN) TO WS-VAL
           MOVE DFHVALUE(WMQ) TO WS-VAL
           MOVE DFHVALUE(XCF) TO WS-VAL
           MOVE DFHVALUE(XM) TO WS-VAL
           MOVE DFHVALUE(XMLTRANSFORM) TO WS-VAL
           MOVE DFHVALUE(XMRUNTRAN) TO WS-VAL
           MOVE DFHVALUE(XNOTDONE) TO WS-VAL
           MOVE DFHVALUE(XOK) TO WS-VAL
           MOVE DFHVALUE(XOPDIRECT) TO WS-VAL
           MOVE DFHVALUE(XOPSUPPORT) TO WS-VAL
           MOVE DFHVALUE(XPLINK) TO WS-VAL
           MOVE DFHVALUE(ZCPTRACE) TO WS-VAL
           GOBACK.

