000001 Identification Division.
000002 Program-ID. testantlr132.
000003 Data Division.
000004 Working-Storage Section.
000005 01  CONSTANTS.
000006     05  MYNAME               PIC X(012) VALUE 'testantlr132'.
000007
000008 01  SWITCHES.
000009     05  SD-001-TRUTH-SW      PIC X(008).
000010         88  SD-001-TRUTH     VALUE 'ZAPHOD'.
000011
000012* 
000013 01  SOME-DATA.
000014     05  SD-001               PIC X(008).
000015     05  SD-002.
000016         10  SD-002-A         PIC X(001).
000017         10  SD-002-B         PIC X(001).
000018     05  SD-003               PIC X(008).
000019
000020 01  WS-BUF                   PIC X(100).
000021
000022 77  WS-COUNT                 PIC 9(008) COMP-5 VALUE 0.
000023
000024 Procedure Division.
000025     DISPLAY MYNAME ' Begin'
000026     
000027     JSON GENERATE WS-BUF FROM SOME-DATA END-JSON
000028
000029     JSON GENERATE WS-BUF FROM SOME-DATA 
000030         ENCODING 37
000031     END-JSON
000032
000033     JSON GENERATE WS-BUF FROM SOME-DATA 
000034         ENCODING WS-COUNT
000035     END-JSON
000036
000037     JSON GENERATE WS-BUF FROM SOME-DATA 
000038         ENCODING FROM CODEPAGE
000039     END-JSON
000040
000041     JSON GENERATE
000042         WS-BUF FROM SOME-DATA
000043         COUNT WS-COUNT
000044         NAME SD-001 'ARTHUR'
000045              SD-002 'DENT'
000046         SUPPRESS 
000047              SD-001
000048              SD-002
000049         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000050         NOT ON EXCEPTION PERFORM 1000-para
000051     END-JSON
000052
000053     JSON GENERATE
000054         WS-BUF FROM SOME-DATA
000055         COUNT CHARACTERS WS-COUNT
000056         NAME SD-001 'ARTHUR'
000057              SD-002 'DENT'
000058         SUPPRESS 
000059              SD-001
000060              SD-002
000061         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000062         NOT ON EXCEPTION PERFORM 1000-para
000063     END-JSON
000064
000065     JSON GENERATE
000066         WS-BUF FROM SOME-DATA
000067         COUNT BYTES WS-COUNT
000068         NAME SD-001 'ARTHUR'
000069              SD-002 'DENT'
000070         SUPPRESS 
000071              SD-001
000072              SD-002
000073         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000074         NOT ON EXCEPTION PERFORM 1000-para
000075     END-JSON
000076
000077     JSON GENERATE
000078         WS-BUF FROM SOME-DATA
000079         COUNT IN WS-COUNT
000080         NAME OF SD-001 IS 'ARTHUR'
000081                 SD-002 IS 'DENT'
000082         SUPPRESS SD-001 SD-003
000083         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000084         NOT ON EXCEPTION PERFORM 1000-para
000085     END-JSON
000086
000087     JSON GENERATE
000088         WS-BUF FROM SOME-DATA
000089         COUNT IN WS-COUNT
000090         NAME OF SD-001 IS 'ARTHUR'
000091                 SD-002 IS 'DENT'
000092         SUPPRESS EVERY NUMERIC WHEN ZEROES
000093         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000094         NOT ON EXCEPTION PERFORM 1000-para
000095     END-JSON
000096
000097     JSON GENERATE
000098         WS-BUF FROM SOME-DATA
000099         COUNT IN WS-COUNT
000100         NAME OF SD-001 IS 'ARTHUR'
000101                 SD-002 IS 'DENT'
000102         SUPPRESS 
000103                 EVERY NUMERIC WHEN ZEROES
000104                 EVERY NONNUMERIC WHEN SPACES
000105                 EVERY NONNUMERIC WHEN LOW-VALUES
000106                 EVERY WHEN HIGH-VALUES OR HIGH-VALUE
000107         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000108         NOT ON EXCEPTION PERFORM 1000-para
000109     END-JSON
000110
000111     JSON GENERATE
000112         WS-BUF FROM SOME-DATA
000113         COUNT WS-COUNT
000114         NAME SD-001 'ARTHUR'
000115              SD-002 'DENT'
000116         SUPPRESS 
000117              SD-001 WHEN SPACES
000118              SD-002 WHEN LOW-VALUES
000119         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000120         NOT ON EXCEPTION PERFORM 1000-para
000121     END-JSON
000122
000123     JSON GENERATE
000124         WS-BUF FROM SOME-DATA
000125         COUNT WS-COUNT
000126         NAME SD-001 'ARTHUR'
000127              SD-002 'DENT'
000128         SUPPRESS 
000129              SD-001
000130              SD-002
000131         CONVERTING SD-001 TO JSON BOOLEAN USING SD-001-TRUTH
000132         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000133         NOT ON EXCEPTION PERFORM 1000-para
000134     END-JSON
000135
000136     JSON GENERATE
000137         WS-BUF FROM SOME-DATA
000138         COUNT WS-COUNT
000139         NAME SD-001 'ARTHUR'
000140              SD-002 'DENT'
000141         SUPPRESS 
000142              SD-001
000143              SD-002
000144         CONVERTING SD-001 JSON BOOLEAN USING SD-001-TRUTH
000145         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000146         NOT ON EXCEPTION PERFORM 1000-para
000147     END-JSON
000148
000149     JSON GENERATE
000150         WS-BUF FROM SOME-DATA
000151         COUNT WS-COUNT
000152         NAME SD-001 'ARTHUR'
000153              SD-002 'DENT'
000154         SUPPRESS 
000155              SD-001
000156              SD-002
000157         CONVERTING SD-001 BOOLEAN USING SD-001-TRUTH
000158         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000159         NOT ON EXCEPTION PERFORM 1000-para
000160     END-JSON
000161
000162     JSON GENERATE
000163         WS-BUF FROM SOME-DATA
000164         COUNT WS-COUNT
000165         NAME SD-001 'ARTHUR'
000166              SD-002 'DENT'
000167         SUPPRESS 
000168              SD-001
000169              SD-002
000170         CONVERTING SD-003 JSON NULL USING SPACES
000171         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000172         NOT ON EXCEPTION PERFORM 1000-para
000173     END-JSON
000174
000175     JSON GENERATE
000176         WS-BUF FROM SOME-DATA
000177         COUNT WS-COUNT
000178         NAME SD-001 'ARTHUR'
000179              SD-002 'DENT'
000180         SUPPRESS 
000181              SD-001
000182              SD-002
000183         CONVERTING SD-003 NULL USING SPACES
000184         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000185         NOT ON EXCEPTION PERFORM 1000-para
000186     END-JSON
000187
000188     JSON GENERATE
000189         WS-BUF FROM SOME-DATA
000190         COUNT WS-COUNT
000191         NAME SD-001 'ARTHUR'
000192              SD-002 'DENT'
000193         SUPPRESS 
000194              SD-001
000195              SD-002
000196         CONVERTING SD-001 BOOLEAN SD-001-TRUTH
000197         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000198         NOT ON EXCEPTION PERFORM 1000-para
000199     END-JSON
000200
000201     JSON GENERATE
000202         WS-BUF FROM SOME-DATA
000203         COUNT WS-COUNT
000204         NAME SD-001 'ARTHUR'
000205              SD-002 'DENT'
000206         SUPPRESS 
000207              SD-001
000208              SD-002
000209         CONVERTING SD-001 TO JSON BOOL USING SD-001-TRUTH
000210         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000211         NOT ON EXCEPTION PERFORM 1000-para
000212     END-JSON
000213
000214     JSON GENERATE
000215         WS-BUF FROM SOME-DATA
000216         COUNT WS-COUNT
000217         NAME SD-001 'ARTHUR'
000218              SD-002 'DENT'
000219         SUPPRESS 
000220              SD-001
000221              SD-002
000222         CONVERTING SD-001 TO JSON BOOLEAN USING 'FPREFECT'
000223         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000224         NOT ON EXCEPTION PERFORM 1000-para
000225     END-JSON
000226
000227     JSON GENERATE
000228         WS-BUF FROM SOME-DATA
000229         COUNT WS-COUNT
000230         NAME SD-001 'ARTHUR'
000231              SD-002 'DENT'
000232         SUPPRESS 
000233              SD-001
000234              SD-002
000235         CONVERTING 
000236              SD-001 TO JSON BOOLEAN USING 'FPREFECT'
000237              ALSO SD-002 BOOL '&&'
000238         ON EXCEPTION CALL 'CEE3ABD' END-CALL
000239         NOT ON EXCEPTION PERFORM 1000-para
000240     END-JSON
000241
000242
000243     DISPLAY MYNAME ' End'
000244     
000245     GOBACK
000246     .
000247
000248 1000-para.
000249
000250     .
000251
