       01  :TAG1:WORK-AREAS.
           05  :TAG2:TEXT01 PIC X(080) VALUE 'Alice Quinn'.
           05  :TAG1:TEXT02 PIC X(080) VALUE 'Margo Hanson'.
           05  :TAG2:TEXT03 PIC X(080) VALUE 'Eliot Waugh'.
