000001 ID Division.
000002 Program-ID. testantlr155.
000003 Procedure Division.
000004
000005 >>DEFINE VAR1 'ALICE'
000006 >>DEFINE VAR2 'JULIA'
000007 >>DEFINE VAR3 'KADY'
000008 >>DEFINE VAR4 'MARGOT'
000009
000010 >>EVALUATE VAR1
000011 >>WHEN 'MARGOT'
000012     EXEC CICS 
000013          LINK
000014          PROGRAM('PGM00001')
000015     END-EXEC
000016 >>WHEN VAR3
000017     EXEC CICS 
000018          LINK
000019          PROGRAM('PGM00002')
000020     END-EXEC
000021 >>WHEN VAR4
000022     EXEC CICS 
000023          LINK
000024          PROGRAM('PGM00003')
000025     END-EXEC
000026 >>WHEN OTHER
000027     EXEC CICS 
000028          LINK
000029          PROGRAM('PGM00004')
000030     END-EXEC
000031 >>END-EVALUATE
000032
000033 >>EVALUATE VAR1
000034 >>WHEN 'ALICE'
000035     EXEC CICS 
000036          LINK
000037          PROGRAM('PGM00005')
000038     END-EXEC
000039 >>WHEN VAR2
000040     EXEC CICS 
000041          LINK
000042          PROGRAM('PGM00006')
000043     END-EXEC
000044 >>WHEN VAR4
000045     EXEC CICS 
000046          LINK
000047          PROGRAM('PGM00007')
000048     END-EXEC
000049 >>WHEN OTHER
000050     EXEC CICS 
000051          LINK
000052          PROGRAM('PGM00008')
000053     END-EXEC
000054 >>END-EVALUATE
000055
000056 >>IF VAR2 = 'BRAKEBILLS'
000057     EXEC CICS 
000058          LINK
000059          PROGRAM('PGM00009')
000060     END-EXEC
000061 >>ELSE
000062     EXEC CICS 
000063          LINK
000064          PROGRAM('PGM00010')
000065     END-EXEC
000066 >>END-IF
000067
000068 >>IF VAR1 DEFINED
000069     EXEC CICS 
000070          LINK
000071          PROGRAM('PGM00011')
000072     END-EXEC
000073 >>END-IF
000074
000075 >>IF VAR5 DEFINED
000076     >>IF VAR5 = 'QUENTIN'
000077         EXEC CICS 
000078              LINK
000079              PROGRAM('PGM00012')
000080         END-EXEC
000081     >>END-IF
000082 >>ELSE
000083     >>DEFINE VAR5 'PENNY'
000084 >>END-IF
000085
000086 >>IF VAR5 = 'PENNY'
000087     EXEC CICS 
000088          LINK
000089          PROGRAM('PGM00013')
000090     END-EXEC
000091 >>END-IF
000092
000093
000094     GOBACK.
