       IDENTIFICATION DIVISION.                                         00000001
       PROGRAM-ID.                                                      00000002
           testantlr259.                                                00000003
       ENVIRONMENT DIVISION.                                            00000004
       CONFIGURATION SECTION.                                           00000005
       SOURCE-COMPUTER.                                                 00000006
           XXXXX082.                                                    00000007
       OBJECT-COMPUTER.                                                 00000008
           XXXXX083.                                                    00000009
       INPUT-OUTPUT SECTION.                                            00000010
       FILE-CONTROL.                                                    00000011
       DATA DIVISION.                                                   00000012
       FILE SECTION.                                                    00000013
       WORKING-STORAGE SECTION.                                         00000014
       01 WORK-AREAS.                                                   00000015
           05                                                           00000016
                                                                       C00000017
      -                                                                O00000018
      -                                                                U00000019
      -                                                                N00000020
      -                                                                T00000021
      -                                                                E00000022
      -                                                                R00000023
                                                                       P00000024
      -                                                                I00000025
      -                                                                C00000026
                                                                       S00000027
      -                                                                900000028
      -                                                                (00000029
      -                                                                000000030
      -                                                                000000031
      -                                                                500000032
      -                                                                )00000033
                                                                       C00000034
      -                                                                O00000035
      -                                                                M00000036
      -                                                                P00000037
      -                                                                -00000038
      -                                                                300000039
                                                                       V00000040
      -                                                                A00000041
      -                                                                L00000042
      -                                                                U00000043
      -                                                                E00000044
                                                                       +00000045
      -                                                                000000046
      -                                                                .00000047
       PROCEDURE DIVISION.                                              00000048
       CCVS1 SECTION.                                                   00000049
       OPEN-FILES.                                                      00000050
           ADD 1 TO                                                    C00000051
      -                                                                O00000052
      -                                                                U00000053
      -                                                                N00000054
      -                                                                T00000055
      -                                                                E00000056
      -                                                                R00000057
                                                                        00000058
           ADD                                                          00000059
                                                                       100000060
      -                                                                000000061
                                                                        00000062
           TO                                                           00000063
                                                                       C00000064
      -                                                                O00000065
      -                                                                U00000066
      -                                                                N00000067
      -                                                                T00000068
      -                                                                E00000069
      -                                                                R00000070
                                                                        00000071
                                                                        00000072
                                                                     DIS00000073
      -                                                             PLAY00000074
           COUNTER                                                      00000075
           GOBACK.                                                      00000076
                                                                        00000077
