000001 Identification Division.
000002 Program-ID. testantlr101.
000003 Data Division.
000004 Working-Storage Section.
000005 01  CONSTANTS.
000006     05  MYNAME               PIC X(012) VALUE 'testantlr101'.
000007
000008* 
000009
000010 Procedure Division.
000011     DISPLAY MYNAME ' Begin'
000012     
000013
000014     DISPLAY MYNAME ' End'
000015     
000016     GOBACK
000017     .
000018
000019 1000-para.
000020
000021     .
000022
