000001 Identification Division.
000002 Program-ID. testantlr121.
000003 Data Division.
000004 Working-Storage Section.
000005
000006 REPLACE 
000007   =='PGMA0001'== BY =='PGMB0001'==
000008   =='PGMA0002'== BY =='PGMB0002'==
000009   .
000010
000011*
000012*comment
000013*
000014
000015 01  CONSTANTS.
000016     05  MYNAME               PIC X(012) VALUE 'testantlr121'.
000017     05  PGM-0001             PIC X(008) VALUE 'PGMA0001'.
000018     05  PGM-0002             PIC X(008) VALUE 'PGMA0002'.
000019     05  PGM-0003             PIC X(008) VALUE 'PGMA0003'.
000020
000021*
000022
000023 REPLACE OFF
000024 .
000025
000026
000027 Procedure Division.
000028     DISPLAY MYNAME ' Begin'
000029     
000030     CALL PGM-0001 USING MYNAME
000031
000032     DISPLAY MYNAME ' End'
000033     
000034     GOBACK
000035     .
000036
000037
