000001 ID Division.                                                     00000001
000002 Program-ID. testantlr350.                                        00000002
000003 Procedure Division.                                              00000003
000004                                                                  00000004
000005 >>DEFINE A 1                                                     00000005
000006 >>DEFINE B 2                                                     00000006
000007 >>DEFINE C 3                                                     00000007
000008 >>DEFINE D A + B * C                                             00000008
000009 >>DEFINE E (A + B) * C                                           00000009
000010 >>DEFINE F A + (B * C)                                           00000010
000011                                                                  00000011
000012     >>EVALUATE D                                                 00000012
000013     >>WHEN 9                                                     00000013
000014     CALL 'D#IS#9'                                                00000014
000015     >>WHEN 7                                                     00000015
000016     CALL 'D#IS#7'                                                00000016
000017     >>WHEN OTHER                                                 00000017
000018     CALL 'WHATTHE#'                                              00000018
000019     >>END-EVALUATE                                               00000019
000020                                                                  00000020
000021     >>EVALUATE E                                                 00000021
000022     >>WHEN 9                                                     00000022
000023     CALL 'E#IS#9'                                                00000023
000024     >>WHEN 7                                                     00000024
000025     CALL 'E#IS#7'                                                00000025
000026     >>WHEN OTHER                                                 00000026
000027     CALL 'WHATTHE#'                                              00000027
000028     >>END-EVALUATE                                               00000028
000029                                                                  00000029
000030     >>EVALUATE F                                                 00000030
000031     >>WHEN 9                                                     00000031
000032     CALL 'F#IS#9'                                                00000032
000033     >>WHEN 7                                                     00000033
000034     CALL 'F#IS#7'                                                00000034
000035     >>WHEN OTHER                                                 00000035
000036     CALL 'WHATTHE#'                                              00000036
000037     >>END-EVALUATE                                               00000037
000038                                                                  00000038
000039                                                                  00000039
000040     GOBACK.                                                      00000040
