//IF JOB
//*
//#0000001 IF   RC EQ 4  | ABENDCC = U4089 THEN
//#0000002 IF   RC NE 4  | ABENDCC = U4089 THEN
//#0000003 IF   RC GT 4  | ABENDCC = U4089 THEN
//#0000004 IF   RC LT 4  | ABENDCC = U4089 THEN
//#0000005 IF   RC GE 4  | ABENDCC = U4089 THEN
//#0000006 IF   RC LE 4  | ABENDCC = U4089 THEN
//#0000007 IF   RC NG 4  | ABENDCC = U4089 THEN
//#0000008 IF   RC NL 4  | ABENDCC = U4089 THEN
//#0000011 IF   RC  = 4  | ABENDCC = U4089 THEN
//#0000012 IF   RC ^= 4  | ABENDCC = U4089 THEN
//#0000013 IF   RC  > 4  | ABENDCC = U4089 THEN
//#0000014 IF   RC  < 4  | ABENDCC = U4089 THEN
//#0000015 IF   RC >= 4  | ABENDCC = U4089 THEN
//#0000016 IF   RC <= 4  | ABENDCC = U4089 THEN
//#0000017 IF   RC ^> 4  | ABENDCC = U4089 THEN
//#0000018 IF   RC ^< 4  | ABENDCC = U4089 THEN
//#0000022 IF ^(RC  = 4) | ABENDCC = U4089 THEN
//#0000027 IF ^(RC  > 4) | ABENDCC = U4089 THEN
//#0000028 IF ^(RC  < 4) | ABENDCC = U4089 THEN
//#0000101 IF   STEP.RC EQ 4  | ABENDCC = U4089 THEN
//#0000102 IF   STEP.RC NE 4  | ABENDCC = U4089 THEN
//#0000103 IF   STEP.RC GT 4  | ABENDCC = U4089 THEN
//#0000104 IF   STEP.RC LT 4  | ABENDCC = U4089 THEN
//#0000105 IF   STEP.RC GE 4  | ABENDCC = U4089 THEN
//#0000106 IF   STEP.RC LE 4  | ABENDCC = U4089 THEN
//#0000107 IF   STEP.RC NG 4  | ABENDCC = U4089 THEN
//#0000108 IF   STEP.RC NL 4  | ABENDCC = U4089 THEN
//#0000111 IF   STEP.RC  = 4  | ABENDCC = U4089 THEN
//#0000112 IF   STEP.RC ^= 4  | ABENDCC = U4089 THEN
//#0000113 IF   STEP.RC  > 4  | ABENDCC = U4089 THEN
//#0000114 IF   STEP.RC  < 4  | ABENDCC = U4089 THEN
//#0000115 IF   STEP.RC >= 4  | ABENDCC = U4089 THEN
//#0000116 IF   STEP.RC <= 4  | ABENDCC = U4089 THEN
//#0000117 IF   STEP.RC ^> 4  | ABENDCC = U4089 THEN
//#0000118 IF   STEP.RC ^< 4  | ABENDCC = U4089 THEN
//#0000122 IF ^(STEP.RC  = 4) | ABENDCC = U4089 THEN
//#0000127 IF ^(STEP.RC  > 4) | ABENDCC = U4089 THEN
//#0000128 IF ^(STEP.RC  < 4) | ABENDCC = U4089 THEN
//#0000201 IF   STEP.PROCSTEP.RC EQ 4  | ABENDCC = U4089 THEN
//#0000202 IF   STEP.PROCSTEP.RC NE 4  | ABENDCC = U4089 THEN
//#0000203 IF   STEP.PROCSTEP.RC GT 4  | ABENDCC = U4089 THEN
//#0000204 IF   STEP.PROCSTEP.RC LT 4  | ABENDCC = U4089 THEN
//#0000205 IF   STEP.PROCSTEP.RC GE 4  | ABENDCC = U4089 THEN
//#0000206 IF   STEP.PROCSTEP.RC LE 4  | ABENDCC = U4089 THEN
//#0000207 IF   STEP.PROCSTEP.RC NG 4  | ABENDCC = U4089 THEN
//#0000208 IF   STEP.PROCSTEP.RC NL 4  | ABENDCC = U4089 THEN
//#0000211 IF   STEP.PROCSTEP.RC  = 4  | ABENDCC = U4089 THEN
//#0000212 IF   STEP.PROCSTEP.RC ^= 4  | ABENDCC = U4089 THEN
//#0000213 IF   STEP.PROCSTEP.RC  > 4  | ABENDCC = U4089 THEN
//#0000214 IF   STEP.PROCSTEP.RC  < 4  | ABENDCC = U4089 THEN
//#0000215 IF   STEP.PROCSTEP.RC >= 4  | ABENDCC = U4089 THEN
//#0000216 IF   STEP.PROCSTEP.RC <= 4  | ABENDCC = U4089 THEN
//#0000217 IF   STEP.PROCSTEP.RC ^> 4  | ABENDCC = U4089 THEN
//#0000218 IF   STEP.PROCSTEP.RC ^< 4  | ABENDCC = U4089 THEN
//#0000222 IF ^(STEP.PROCSTEP.RC  = 4) | ABENDCC = U4089 THEN
//#0000227 IF ^(STEP.PROCSTEP.RC  > 4) | ABENDCC = U4089 THEN
//#0000228 IF ^(STEP.PROCSTEP.RC  < 4) | ABENDCC = U4089 THEN
//#0000301 IF   ABEND.RC.RC EQ 4  | ABENDCC = U4089 THEN
//#0000302 IF   ABEND.RC.RC NE 4  | ABENDCC = U4089 THEN
//#0000303 IF   ABEND.RC.RC GT 4  | ABENDCC = U4089 THEN
//#0000304 IF   ABEND.RC.RC LT 4  | ABENDCC = U4089 THEN
//#0000305 IF   ABEND.RC.RC GE 4  | ABENDCC = U4089 THEN
//#0000306 IF   ABEND.RC.RC LE 4  | ABENDCC = U4089 THEN
//#0000307 IF   ABEND.RC.RC NG 4  | ABENDCC = U4089 THEN
//#0000308 IF   ABEND.RC.RC NL 4  | ABENDCC = U4089 THEN
//#0000311 IF   ABEND.RC.RC  = 4  | ABENDCC = U4089 THEN
//#0000312 IF   ABEND.RC.RC ^= 4  | ABENDCC = U4089 THEN
//#0000313 IF   ABEND.RC.RC  > 4  | ABENDCC = U4089 THEN
//#0000314 IF   ABEND.RC.RC  < 4  | ABENDCC = U4089 THEN
//#0000315 IF   ABEND.RC.RC >= 4  | ABENDCC = U4089 THEN
//#0000316 IF   ABEND.RC.RC <= 4  | ABENDCC = U4089 THEN
//#0000317 IF   ABEND.RC.RC ^> 4  | ABENDCC = U4089 THEN
//#0000318 IF   ABEND.RC.RC ^< 4  | ABENDCC = U4089 THEN
//#0000322 IF ^(ABEND.RC.RC  = 4) | ABENDCC = U4089 THEN
//#0000327 IF ^(ABEND.RC.RC  > 4) | ABENDCC = U4089 THEN
//#0000328 IF ^(ABEND.RC.RC  < 4) | ABENDCC = U4089 THEN
//#0000001 IF   RC EQ 4  | ABENDCC = U4089 THEN IF
//#0001002 IF   RC NE 4  | ABENDCC = U4089 THEN IF
//#0001003 IF   RC GT 4  | ABENDCC = U4089 THEN IF
//#0001004 IF   RC LT 4  | ABENDCC = U4089 THEN IF
//#0001005 IF   RC GE 4  | ABENDCC = U4089 THEN IF
//#0001006 IF   RC LE 4  | ABENDCC = U4089 THEN IF
//#0001007 IF   RC NG 4  | ABENDCC = U4089 THEN IF
//#0001008 IF   RC NL 4  | ABENDCC = U4089 THEN IF
//#0001011 IF   RC  = 4  | ABENDCC = U4089 THEN IF
//#0001012 IF   RC ^= 4  | ABENDCC = U4089 THEN IF
//#0001013 IF   RC  > 4  | ABENDCC = U4089 THEN IF
//#0001014 IF   RC  < 4  | ABENDCC = U4089 THEN IF
//#0001015 IF   RC >= 4  | ABENDCC = U4089 THEN IF
//#0001016 IF   RC <= 4  | ABENDCC = U4089 THEN IF
//#0001017 IF   RC ^> 4  | ABENDCC = U4089 THEN IF
//#0001018 IF   RC ^< 4  | ABENDCC = U4089 THEN IF
//#0001022 IF ^(RC  = 4) | ABENDCC = U4089 THEN IF
//#0001027 IF ^(RC  > 4) | ABENDCC = U4089 THEN IF
//#0001028 IF ^(RC  < 4) | ABENDCC = U4089 THEN IF
//#0001101 IF   STEP.RC EQ 4  | ABENDCC = U4089 THEN IF
//#0001102 IF   STEP.RC NE 4  | ABENDCC = U4089 THEN IF
//#0001103 IF   STEP.RC GT 4  | ABENDCC = U4089 THEN IF
//#0001104 IF   STEP.RC LT 4  | ABENDCC = U4089 THEN IF
//#0001105 IF   STEP.RC GE 4  | ABENDCC = U4089 THEN IF
//#0001106 IF   STEP.RC LE 4  | ABENDCC = U4089 THEN IF
//#0001107 IF   STEP.RC NG 4  | ABENDCC = U4089 THEN IF
//#0001108 IF   STEP.RC NL 4  | ABENDCC = U4089 THEN IF
//#0001111 IF   STEP.RC  = 4  | ABENDCC = U4089 THEN IF
//#0001112 IF   STEP.RC ^= 4  | ABENDCC = U4089 THEN IF
//#0001113 IF   STEP.RC  > 4  | ABENDCC = U4089 THEN IF
//#0001114 IF   STEP.RC  < 4  | ABENDCC = U4089 THEN IF
//#0001115 IF   STEP.RC >= 4  | ABENDCC = U4089 THEN IF
//#0001116 IF   STEP.RC <= 4  | ABENDCC = U4089 THEN IF
//#0001117 IF   STEP.RC ^> 4  | ABENDCC = U4089 THEN IF
//#0001118 IF   STEP.RC ^< 4  | ABENDCC = U4089 THEN IF
//#0001122 IF ^(STEP.RC  = 4) | ABENDCC = U4089 THEN IF
//#0001127 IF ^(STEP.RC  > 4) | ABENDCC = U4089 THEN IF
//#0001128 IF ^(STEP.RC  < 4) | ABENDCC = U4089 THEN IF
//#0001201 IF   STEP.PROCSTEP.RC EQ 4  | ABENDCC = U4089 THEN IF
//#0001202 IF   STEP.PROCSTEP.RC NE 4  | ABENDCC = U4089 THEN IF
//#0001203 IF   STEP.PROCSTEP.RC GT 4  | ABENDCC = U4089 THEN IF
//#0001204 IF   STEP.PROCSTEP.RC LT 4  | ABENDCC = U4089 THEN IF
//#0001205 IF   STEP.PROCSTEP.RC GE 4  | ABENDCC = U4089 THEN IF
//#0001206 IF   STEP.PROCSTEP.RC LE 4  | ABENDCC = U4089 THEN IF
//#0001207 IF   STEP.PROCSTEP.RC NG 4  | ABENDCC = U4089 THEN IF
//#0001208 IF   STEP.PROCSTEP.RC NL 4  | ABENDCC = U4089 THEN IF
//#0001211 IF   STEP.PROCSTEP.RC  = 4  | ABENDCC = U4089 THEN IF
//#0001212 IF   STEP.PROCSTEP.RC ^= 4  | ABENDCC = U4089 THEN IF
//#0001213 IF   STEP.PROCSTEP.RC  > 4  | ABENDCC = U4089 THEN IF
//#0001214 IF   STEP.PROCSTEP.RC  < 4  | ABENDCC = U4089 THEN IF
//#0001215 IF   STEP.PROCSTEP.RC >= 4  | ABENDCC = U4089 THEN IF
//#0001216 IF   STEP.PROCSTEP.RC <= 4  | ABENDCC = U4089 THEN IF
//#0001217 IF   STEP.PROCSTEP.RC ^> 4  | ABENDCC = U4089 THEN IF
//#0001218 IF   STEP.PROCSTEP.RC ^< 4  | ABENDCC = U4089 THEN IF
//#0001222 IF ^(STEP.PROCSTEP.RC  = 4) | ABENDCC = U4089 THEN IF
//#0001227 IF ^(STEP.PROCSTEP.RC  > 4) | ABENDCC = U4089 THEN IF
//#0001228 IF ^(STEP.PROCSTEP.RC  < 4) | ABENDCC = U4089 THEN IF
//#0001301 IF   ABEND.RC.RC EQ 4  | ABENDCC = U4089 THEN IF
//#0001302 IF   ABEND.RC.RC NE 4  | ABENDCC = U4089 THEN IF
//#0001303 IF   ABEND.RC.RC GT 4  | ABENDCC = U4089 THEN IF
//#0001304 IF   ABEND.RC.RC LT 4  | ABENDCC = U4089 THEN IF
//#0001305 IF   ABEND.RC.RC GE 4  | ABENDCC = U4089 THEN IF
//#0001306 IF   ABEND.RC.RC LE 4  | ABENDCC = U4089 THEN IF
//#0001307 IF   ABEND.RC.RC NG 4  | ABENDCC = U4089 THEN IF
//#0001308 IF   ABEND.RC.RC NL 4  | ABENDCC = U4089 THEN IF
//#0001311 IF   ABEND.RC.RC  = 4  | ABENDCC = U4089 THEN IF
//#0001312 IF   ABEND.RC.RC ^= 4  | ABENDCC = U4089 THEN IF
//#0001313 IF   ABEND.RC.RC  > 4  | ABENDCC = U4089 THEN IF
//#0001314 IF   ABEND.RC.RC  < 4  | ABENDCC = U4089 THEN IF
//#0001315 IF   ABEND.RC.RC >= 4  | ABENDCC = U4089 THEN IF
//#0001316 IF   ABEND.RC.RC <= 4  | ABENDCC = U4089 THEN IF
//#0001317 IF   ABEND.RC.RC ^> 4  | ABENDCC = U4089 THEN IF
//#0001318 IF   ABEND.RC.RC ^< 4  | ABENDCC = U4089 THEN IF
//#0001322 IF ^(ABEND.RC.RC  = 4) | ABENDCC = U4089 THEN IF
//#0001327 IF ^(ABEND.RC.RC  > 4) | ABENDCC = U4089 THEN IF
//#0001328 IF ^(ABEND.RC.RC  < 4) | ABENDCC = U4089 THEN IF

