//OUTPUT JOB
//*
//@0000001 OUTPUT ADDRESS='1234 Triskelion'
//@0000002 OUTPUT ADDRESS=('1234 Triskelion')
//@0000003 OUTPUT ADDRESS=ENTERPRISE
//@0000004 OUTPUT ADDRESS=(ENTERPRISE)
//@0000005 OUTPUT ADDRESS=('1234 Triskelion','Gamester Way')
//@0000006 OUTPUT ADDRESS=('The old house at the end of the lane',
//             'With no windows','and no doors save for the one',
//             'leading into the cellar from which no one returns')
//@0000007 OUTPUT AFPPARMS=PROD.SYS.AFPPARMS
//@0000008 OUTPUT AFPPARMS=&DSNHLQ..AFPPARMS
//@0000009 OUTPUT AFPSTATS=YES
//@0000010 OUTPUT AFPSTATS=Y
//@0000011 OUTPUT AFPSTATS=NO
//@0000012 OUTPUT AFPSTATS=N
//@0000013 OUTPUT AFPSTATS=&AFPSTATS
//@0000014 OUTPUT BUILDING=/-+&*.ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789
//@0000015 OUTPUT BUILDING='/-+&*.ABCDEFGHIJKLMNOPQRSTUVWXYZ01234567'
//@0000016 OUTPUT BUILDING='O''Brian Center for Science'
//@0000017 OUTPUT BUILDING=&BUILDING
//@0000018 OUTPUT BURST=YES
//@0000019 OUTPUT BURST=Y
//@0000020 OUTPUT BURST=NO
//@0000021 OUTPUT BURST=N
//@0000022 OUTPUT BURST=&BURST
//@0000023 OUTPUT CHARS=STD
//@0000024 OUTPUT CHARS=DUMP
//@0000025 OUTPUT CHARS=@#$1
//@0000026 OUTPUT CHARS=A
//@0000027 OUTPUT CHARS=A1
//@0000028 OUTPUT CHARS=A#1
//@0000029 OUTPUT CHARS=(A,B,C,D)
//@0000030 OUTPUT CHARS=(DUMP,1,2,3)
//@0000031 OUTPUT CHARS=(DUMP,STD)
//@0000032 OUTPUT CHARS=(STD)
//@0000033 OUTPUT CHARS=(DUMP)
//@0000034 OUTPUT CHARS=(@#$1)
//@0000035 OUTPUT CHARS=(A)
//@0000036 OUTPUT CHARS=(A1)
//@0000037 OUTPUT CHARS=(A#1)
//@0000038 OUTPUT CHARS=&CHARS
//@0000039 OUTPUT CHARS=(&CHARS1,&CHARS2,&CHARS3,&CHARS4)
//@0000040 OUTPUT CKPTLINE=1
//@0000041 OUTPUT CKPTLINE=32767
//@0000042 OUTPUT CKPTLINE=&CKPTLINE
//@0000043 OUTPUT CKPTPAGE=1
//@0000044 OUTPUT CKPTPAGE=32767
//@0000045 OUTPUT CKPTPAGE=&CKPTPAGE
//@0000046 OUTPUT CKPTSEC=1
//@0000047 OUTPUT CKPTSEC=32767
//@0000048 OUTPUT CKPTSEC=&CKPTSEC
//@0000049 OUTPUT CLASS=A
//@0000050 OUTPUT CLASS=0
//@0000051 OUTPUT CLASS=*
//@0000052 OUTPUT CLASS='B'
//@0000053 OUTPUT CLASS='9'
//@0000054 OUTPUT CLASS='*'
//@0000055 OUTPUT CLASS=
//@0000056 OUTPUT CLASS=&CLASS
//@0000057 OUTPUT COLORMAP=A
//@0000058 OUTPUT COLORMAP=$
//@0000059 OUTPUT COLORMAP=#0000001
//@0000060 OUTPUT COLORMAP=&COLORMAP
//@0000061 OUTPUT COMSETUP=A
//@0000062 OUTPUT COMSETUP=@
//@0000063 OUTPUT COMSETUP=A1
//@0000064 OUTPUT COMSETUP=#1
//@0000065 OUTPUT COMSETUP=$#@123XY
//@0000066 OUTPUT COMSETUP=&COMSETUP
//@0000067 OUTPUT CONTROL=PROGRAM
//@0000068 OUTPUT CONTROL=SINGLE
//@0000069 OUTPUT CONTROL=DOUBLE
//@0000070 OUTPUT CONTROL=TRIPLE
//@0000071 OUTPUT CONTROL=&CONTROL
//@0000072 OUTPUT COPIES=5
//@0000073 OUTPUT COPIES=(5)
//@0000074 OUTPUT COPIES=&COPIES
//@0000075 OUTPUT COPIES=(&COPIES)
//@0000076 OUTPUT COPIES=(5,(2,3))
//@0000077 OUTPUT COPIES=(255,(255,255,255,255,255,255,255,255))
//@0000078 OUTPUT COPIES=(&COPIES,(&G1,&G2,&G3))
//@0000079 OUTPUT COPIES=(,(77))
//@0000080 OUTPUT COPIES=(,(1,2,3,4))
//@0000081 OUTPUT COPYCNT=1
//@0000082 OUTPUT COPYCNT=2147483647
//@0000083 OUTPUT COPYCNT=&COPYCNT
//@0000084 OUTPUT DATACK=BLOCK
//@0000085 OUTPUT DATACK=UNBLOCK
//@0000086 OUTPUT DATACK=BLKCHAR
//@0000087 OUTPUT DATACK=BLKPOS
//@0000088 OUTPUT DATACK=&DATACK
//@0000089 OUTPUT DDNAME=DDNAME
//@0000090 OUTPUT DDNAME=JSTEP.DDNAME
//@0000091 OUTPUT DDNAME=PSTEP.DDNAME
//@0000092 OUTPUT DDNAME=JSTEP.PSTEP.DDNAME
//@0000093 OUTPUT DDNAME=&DDNAME
//@0000094 OUTPUT DEFAULT=YES
//@0000095 OUTPUT DEFAULT=Y
//@0000096 OUTPUT DEFAULT=NO
//@0000097 OUTPUT DEFAULT=N
//@0000098 OUTPUT DEFAULT=&DEFAULT
//@0000099 OUTPUT DEPT=/-+&*.ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789
//@0000100 OUTPUT DEPT='Department of Silly Test Cases'
//@0000101 OUTPUT DEPT=&DEPT
//@0000102 OUTPUT DEST=LOCAL
//@0000103 OUTPUT DEST=ANYLOCAL
//@0000104 OUTPUT DEST=RMT17
//@0000105 OUTPUT DEST=N12345
//@0000106 OUTPUT DEST=N1R12345
//@0000107 OUTPUT DEST=N12R1234
//@0000108 OUTPUT DEST=N123R123
//@0000109 OUTPUT DEST=N1234R12
//@0000110 OUTPUT DEST=N12345R1
//@0000111 OUTPUT DEST=(LONDON,'CICSUSR')
//@0000112 OUTPUT DEST=U1
//@0000113 OUTPUT DEST=CSCHNEID
//@0000114 OUTPUT DEST=&DEST
//@0000115 OUTPUT DEST=(&NODE,&USER)
//@0000116 OUTPUT DPAGELBL=YES
//@0000117 OUTPUT DPAGELBL=Y
//@0000118 OUTPUT DPAGELBL=NO
//@0000119 OUTPUT DPAGELBL=N
//@0000120 OUTPUT DPAGELBL=&DPAGELBL
//@0000121 OUTPUT DUPLEX=NO
//@0000122 OUTPUT DUPLEX=N
//@0000123 OUTPUT DUPLEX=NORMAL
//@0000124 OUTPUT DUPLEX=TUMBLE
//@0000125 OUTPUT DUPLEX=&DUPLEX
//@0000126 OUTPUT FCB=STD
//@0000127 OUTPUT FCB=1234
//@0000128 OUTPUT FCB=A
//@0000129 OUTPUT FCB=$
//@0000130 OUTPUT FCB=ABCD
//@0000131 OUTPUT FCB=$$$$
//@0000132 OUTPUT FCB=&FCB
//@0000133 OUTPUT FLASH=STD
//@0000134 OUTPUT FLASH=NONE
//@0000135 OUTPUT FLASH=1
//@0000136 OUTPUT FLASH=A
//@0000137 OUTPUT FLASH=$
//@0000138 OUTPUT FLASH=(,255)
//@0000139 OUTPUT FLASH=($$,255)
//@0000140 OUTPUT FLASH=&FLASH
//@0000141 OUTPUT FLASH=(&OVERLAY,&COUNT)
//@0000142 OUTPUT FORMDEF=1
//@0000143 OUTPUT FORMDEF=A
//@0000144 OUTPUT FORMDEF=#
//@0000145 OUTPUT FORMDEF=&FORMDEF

