//SPIN JOB
//*
//STEP0001 EXEC PGM=STC
//DD000001 DD  SPIN=NO
//DD000002 DD  SPIN=UNALLOC
//DD000003 DD  SPIN=(UNALLOC,'11:22')
//DD000004 DD  SPIN=(UNALLOC,'+11:22')
//DD000005 DD  SPIN=(UNALLOC,10K)
//DD000006 DD  SPIN=(UNALLOC,2M)
//DD000007 DD  SPIN=(UNALLOC,NOCMND)
//DD000008 DD  SPIN=(UNALLOC,CMNDONLY)
//DD000009 DD  SPIN=&SPIN
//DD000010 DD  SPIN=(UNALLOC,&SPIN)
//DD000011 DD  SPIN=(&SPIN)
//DD000012 DD  SPIN=(UNALLOC,255)
//DD000101 DD  SPIN=NO SPIN
//DD000102 DD  SPIN=UNALLOC SPIN
//DD000103 DD  SPIN=(UNALLOC,'11:22') SPIN
//DD000104 DD  SPIN=(UNALLOC,'+11:22') SPIN
//DD000105 DD  SPIN=(UNALLOC,10K) SPIN
//DD000106 DD  SPIN=(UNALLOC,2M) SPIN
//DD000107 DD  SPIN=(UNALLOC,NOCMND) SPIN
//DD000108 DD  SPIN=(UNALLOC,CMNDONLY) SPIN
//DD000109 DD  SPIN=&SPIN SPIN
//DD000110 DD  SPIN=(UNALLOC,&SPIN) SPIN
//DD000111 DD  SPIN=(&SPIN) SPIN
//DD000112 DD  SPIN=(UNALLOC,255) SPIN
