//OUTPUT JOB
//*
//@0000001 OUTPUT ADDRESS='1234 Triskelion',
//             AFPPARMS=PROD.SYS.AFPPARMS,
//             AFPSTATS=YES,
//             BUILDING='O''Brian Center for Science',
//             BURST=NO,
//             CHARS=@#$1,
//             CKPTLINE=32767,
//             CKPTPAGE=32767,
//             CKPTSEC=32767,
//             CLASS=,
//             COLORMAP=#0000001,
//             COMSETUP=#1,
//             CONTROL=PROGRAM,
//             COPIES=(255,(255,255,255,255,255,255,255,255)),
//             COPYCNT=2147483647,
//             DATACK=BLOCK,
//             DDNAME=JSTEP.PSTEP.DDNAME,
//             DEFAULT=YES,
//             DEPT='Department of Silly Test Cases',
//             DEST=(LONDON.CICSUSR),
//             DPAGELBL=YES,
//             DUPLEX=TUMBLE,
//             FCB=$$$$,
//             FLASH=NONE,
//             FORMDEF=#,
//             FORMLEN=1.001CM,
//             FORMS=@001$002,
//             FSSDATA=A1@.+-/,
//             GROUPID=A,
//             INDEX=1,
//             INTRAY=1,
//             JESDS=ALL,
//             LINDEX=1,
//             LINECT=1,
//             MAILBCC=('quentin.coldwater@example.com',
//             'alice.quinn@example.com',
//             'julia.wicker@example.com',
//             'eliot.waugh@example.com',
//             'margo.hanson@example.com',
//             'penny.adiyodi@example.com',
//             'kady.orloff-diaz@example.com'),
//             MAILCC=(QUENTIN.COLDWATER@EXAMPLE.COM,
//             ALICE.QUINN@EXAMPLE.COM,
//             JULIA.WICKER@EXAMPLE.COM,
//             ELIOT.WAUGH@EXAMPLE.COM,
//             MARGO.HANSON@EXAMPLE.COM,
//             PENNY.ADIYODI@EXAMPLE.COM,
//             KADY.ORLOFF-DIAZ@EXAMPLE.COM),
//             MAILFILE='Latest Results',
//             MAILFROM=PRODUCTION.REPORT.DISTRIBUTION,
//             MAILTO=('quentin.coldwater@example.com',
//             'alice.quinn@example.com',
//             'julia.wicker@example.com',
//             'eliot.waugh@example.com',
//             'margo.hanson@example.com',
//             'penny.adiyodi@example.com',
//             'kady.orloff-diaz@example.com'),
//             MERGE=Y,
//             MODIFY=(&MODIFY,&TRC),
//             NAME='Charlie Jade',
//             NOTIFY=(NEWYORK.IBMUSER1,
//             LONDON.IBMUSER2,
//             PARIS.IBMUSER3,
//             MUNICH.IBMUSER4),
//             OFFSETXB=1234.567POINTS,
//             OFFSETXF=1234.567CM,
//             OFFSETYB=1234.567MM,
//             OFFSETYF=1234.567PELS,
//             OUTBIN=1,
//             OUTDISP=(WRITE,KEEP),
//             OVERLAYB=#ABC,
//             OVERLAYF=A123,
//             OVFL=ON,
//             PAGEDEF=@#$@#$,
//             PIMSG=(YES,4),
//             PORTNO=65535,
//             PRMODE=ABCDEFGH,
//             PRTATTRS='serenity=firefly,moya=leviathan',
//             PRTERROR=DEFAULT,
//             PRTOPTNS='4-8-15-16-23-42',
//             PRTQUEUE='123456789A123456789B123456789C123456789D
//             123456789E123456789F123456789G123456789H123456789I',
//             PRTY=255,
//             REPLYTO='yalena.yardeen@example.com',
//             RESFMT=P300,
//             RETAINS=FOREVER,
//             RETAINF=FOREVER,
//             RETRYT='9999:99:99',
//             RETRYL=32767,
//             ROOM=201B,
//             SYSAREA=N,
//             THRESHLD=99999999,
//             TITLE='This is the title text, such as it is',
//             TRC=&TRC,
//             UCS=RN,
//             USERDATA=('Sleestak'),
//             USERLIB=(&SYSUID..USERLIB,
//             QA.USERLIB,
//             PROD.USERLIB),
//             USERPATH=(&PATCH,
//             '/user/cschneid/fonts',
//             '/integration-test/fonts',
//             '/prod/fonts'),
//             WRITER=$WRITER

