//OUTPUT JOB
//*
//@0000001 OUTPUT ADDRESS='1234 Triskelion'
//@0000002 OUTPUT ADDRESS=('1234 Triskelion')
//@0000003 OUTPUT ADDRESS=ENTERPRISE
//@0000004 OUTPUT ADDRESS=(ENTERPRISE)
//@0000005 OUTPUT ADDRESS=('1234 Triskelion','Gamester Way')
//@0000006 OUTPUT ADDRESS=('The old house at the end of the lane',
//             'With no windows','and no doors save for the one',
//             'leading into the cellar from which no one returns')
//@0000007 OUTPUT AFPPARMS=PROD.SYS.AFPPARMS
//@0000008 OUTPUT AFPPARMS=&DSNHLQ..AFPPARMS
//@0000009 OUTPUT AFPSTATS=YES

