//ROLLYY   JOB ROLL=(YES,YES)
//*
//STEPYY   EXEC PGM=IEFBR14,ROLL=(YES,YES)
//*
//ROLLYN   JOB ROLL=(YES,NO)
//*
//STEPYN   EXEC PGM=IEFBR14,ROLL=(YES,NO)
//*
//ROLLNN   JOB ROLL=(NO,YES)
//*
//STEPNY   EXEC PGM=IEFBR14,ROLL=(NO,YES)
//*
//ROLLNN   JOB ROLL=(NO,NO)
//*
//STEPNN   EXEC PGM=IEFBR14,ROLL=(NO,NO)
//*
