//LGSTREAM JOB
//*
//STEP0001 EXEC PGM=IDCAMS
//DD000001 DD  LGSTREAM=A
//DD000002 DD  LGSTREAM=@
//DD000003 DD  LGSTREAM=A#
//DD000004 DD  LGSTREAM=$A
//DD000005 DD  LGSTREAM=A1
//DD000006 DD  LGSTREAM=@1
//DD000007 DD  LGSTREAM=&DSNHLQ..&DSNQ2..&DSNQ3.AEIOU
