//SECMODEL JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  SECMODEL=A
//DD000002 DD  SECMODEL=@
//DD000003 DD  SECMODEL=A1
//DD000004 DD  SECMODEL=#B
//DD000005 DD  SECMODEL=C$
//DD000006 DD  SECMODEL=A.B.C
//DD000007 DD  SECMODEL=AEIOU.EGBDF.#01
//DD000008 DD  SECMODEL=$.A
//DD000101 DD  SECMODEL=(A)
//DD000102 DD  SECMODEL=(@)
//DD000103 DD  SECMODEL=(A1)
//DD000104 DD  SECMODEL=(#B)
//DD000105 DD  SECMODEL=(C$)
//DD000106 DD  SECMODEL=(A.B.C)
//DD000107 DD  SECMODEL=(AEIOU.EGBDF.#01)
//DD000108 DD  SECMODEL=($.A)
//DD000201 DD  SECMODEL=(A.**,GENERIC)
//DD000202 DD  SECMODEL=(@.**,GENERIC)
//DD000203 DD  SECMODEL=(A1.**,GENERIC)
//DD000204 DD  SECMODEL=(#B.**,GENERIC)
//DD000205 DD  SECMODEL=(C$.**,GENERIC)
//DD000206 DD  SECMODEL=(A.B.C.**,GENERIC)
//DD000207 DD  SECMODEL=(AEIOU.EGBDF.#01.**,GENERIC)
//DD000208 DD  SECMODEL=($.A.**,GENERIC)
//DD000301 DD  SECMODEL=(ABC.A%C.%%1,GENERIC)
//DD001001 DD  SECMODEL=A SECMODEL
//DD001002 DD  SECMODEL=@ SECMODEL
//DD001003 DD  SECMODEL=A1 SECMODEL
//DD001004 DD  SECMODEL=#B SECMODEL
//DD001005 DD  SECMODEL=C$ SECMODEL
//DD001006 DD  SECMODEL=A.B.C SECMODEL
//DD001007 DD  SECMODEL=AEIOU.EGBDF.#01 SECMODEL
//DD001008 DD  SECMODEL=$.A SECMODEL
//DD001101 DD  SECMODEL=(A) SECMODEL
//DD001102 DD  SECMODEL=(@) SECMODEL
//DD001103 DD  SECMODEL=(A1) SECMODEL
//DD001104 DD  SECMODEL=(#B) SECMODEL
//DD001105 DD  SECMODEL=(C$) SECMODEL
//DD001106 DD  SECMODEL=(A.B.C) SECMODEL
//DD001107 DD  SECMODEL=(AEIOU.EGBDF.#01) SECMODEL
//DD001108 DD  SECMODEL=($.A) SECMODEL
//DD001201 DD  SECMODEL=(A.**,GENERIC) SECMODEL
//DD001202 DD  SECMODEL=(@.**,GENERIC) SECMODEL
//DD001203 DD  SECMODEL=(A1.**,GENERIC) SECMODEL
//DD001204 DD  SECMODEL=(#B.**,GENERIC) SECMODEL
//DD001205 DD  SECMODEL=(C$.**,GENERIC) SECMODEL
//DD001206 DD  SECMODEL=(A.B.C.**,GENERIC) SECMODEL
//DD001207 DD  SECMODEL=(AEIOU.EGBDF.#01.**,GENERIC) SECMODEL
//DD001208 DD  SECMODEL=($.A.**,GENERIC) SECMODEL
//DD001301 DD  SECMODEL=(ABC.A%C.%%1,GENERIC) SECMODEL

