//CCSID JOB ,USER=CSCHNEID
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  CCSID=37
//DD000002 DD  CCSID=&CCSID
//DD000003 DD  CCSID=65535
//DD000004 DD  CCSID=0
//DD000001 DD  CCSID=37 CCSID
//DD000002 DD  CCSID=&CCSID CCSID
//DD000003 DD  CCSID=65535 CCSID
//DD000004 DD  CCSID=0 CCSID
