//JOB001 JOB 
//*
//JOB002 JOB ,USER=CSCHNEID
//*
//JOB003 JOB X,Y
//*
//JOB004 JOB (A,B,C,D),'CSCHNEID'
//*
//JOB005 JOB ('A##0395$,QUATLOOS',201B),
//        'CSCHNEID',
//*//        TIME=(00,04),
//        TIME=(04,04),
//        MSGLEVEL=(1,1),
//        MSGCLASS=Y,
//        BYTES=(400000,WARNING),
//        LINES=(3000,WARNING),
//        NOTIFY=&SYSUID
//*
//JOB006 JOB ('A##0395$,QUATLOOS',201B),
//*
//*//        'CSCHNEID',
//*//        TIME=(00,04),
//        TIME=(04,04),
//        MSGLEVEL=(1,1),
//        MSGCLASS=Y,
//        BYTES=(400000,WARNING),
//        LINES=(3000,WARNING),
//        NOTIFY=&SYSUID
// EXEC PGM=IEFBR14
