//VOLUME JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  VOL=REF=*.DD
//DD000002 DD  VOL=REF=*.STEP.DD
//DD000003 DD  VOL=REF=*.STEP.PROCSTEP.DD
//DD000004 DD  VOL=REF=A.DATASET.NAME
//DD000005 DD  VOL=REF='A.DATASET.NAME'
//DD000006 DD  VOL=REF=REF
//DD000007 DD  VOLUME=REF=*.DD
//DD000008 DD  VOLUME=REF=*.STEP.DD
//DD000009 DD  VOLUME=REF=*.STEP.PROCSTEP.DD
//DD000010 DD  VOLUME=REF=A.DATASET.NAME
//DD000011 DD  VOLUME=REF='A.DATASET.NAME'
//DD000012 DD  VOLUME=REF=REF
//DD000013 DD  VOL=(,,,,REF=*.DD)
//DD000014 DD  VOL=(,,,,REF=*.STEP.DD)
//DD000015 DD  VOL=(,,,,REF=*.STEP.PROCSTEP.DD)
//DD000016 DD  VOL=(,,,,REF=A.DATASET.NAME)
//DD000017 DD  VOL=(,,,,REF='A.DATASET.NAME')
//DD000018 DD  VOL=(,,,,REF=REF)
//DD000019 DD  VOLUME=(,,,,REF=*.DD)
//DD000020 DD  VOLUME=(,,,,REF=*.STEP.DD)
//DD000021 DD  VOLUME=(,,,,REF=*.STEP.PROCSTEP.DD)
//DD000022 DD  VOLUME=(,,,,REF=A.DATASET.NAME)
//DD000023 DD  VOLUME=(,,,,REF='A.DATASET.NAME')
//DD000024 DD  VOLUME=(,,,,REF=REF)
//DD000101 DD  *,VOL=REF=*.DD
//DD000102 DD  *,VOL=REF=*.STEP.DD
//DD000103 DD  *,VOL=REF=*.STEP.PROCSTEP.DD
//DD000104 DD  *,VOL=REF=A.DATASET.NAME
//DD000105 DD  *,VOL=REF='A.DATASET.NAME'
//DD000106 DD  *,VOL=REF=REF
//DD000107 DD  *,VOLUME=REF=*.DD
//DD000108 DD  *,VOLUME=REF=*.STEP.DD
//DD000109 DD  *,VOLUME=REF=*.STEP.PROCSTEP.DD
//DD000110 DD  *,VOLUME=REF=A.DATASET.NAME
//DD000111 DD  *,VOLUME=REF='A.DATASET.NAME'
//DD000112 DD  *,VOLUME=REF=REF
//DD000113 DD  *,VOL=(,,,,REF=*.DD)
//DD000114 DD  *,VOL=(,,,,REF=*.STEP.DD)
//DD000115 DD  *,VOL=(,,,,REF=*.STEP.PROCSTEP.DD)
//DD000116 DD  *,VOL=(,,,,REF=A.DATASET.NAME)
//DD000117 DD  *,VOL=(,,,,REF='A.DATASET.NAME')
//DD000118 DD  *,VOL=(,,,,REF=REF)
//DD000119 DD  *,VOLUME=(,,,,REF=*.DD)
//DD000120 DD  *,VOLUME=(,,,,REF=*.STEP.DD)
//DD000121 DD  *,VOLUME=(,,,,REF=*.STEP.PROCSTEP.DD)
//DD000122 DD  *,VOLUME=(,,,,REF=A.DATASET.NAME)
//DD000123 DD  *,VOLUME=(,,,,REF='A.DATASET.NAME')
//DD000124 DD  *,VOLUME=(,,,,REF=REF)
//DD000201 DD  *,VOL=REF=*.DD,MODE=C
//DD000202 DD  *,VOL=REF=*.STEP.DD,MODE=C
//DD000203 DD  *,VOL=REF=*.STEP.PROCSTEP.DD,MODE=C
//DD000204 DD  *,VOL=REF=A.DATASET.NAME,MODE=C
//DD000205 DD  *,VOL=REF='A.DATASET.NAME',MODE=C
//DD000206 DD  *,VOL=REF=REF,MODE=C
//DD000207 DD  *,VOLUME=REF=*.DD,MODE=C
//DD000208 DD  *,VOLUME=REF=*.STEP.DD,MODE=C
//DD000209 DD  *,VOLUME=REF=*.STEP.PROCSTEP.DD,MODE=C
//DD000210 DD  *,VOLUME=REF=A.DATASET.NAME,MODE=C
//DD000211 DD  *,VOLUME=REF='A.DATASET.NAME',MODE=C
//DD000212 DD  *,VOLUME=REF=REF,MODE=C
//DD000213 DD  *,VOL=(,,,,REF=*.DD),MODE=C
//DD000214 DD  *,VOL=(,,,,REF=*.STEP.DD),MODE=C
//DD000215 DD  *,VOL=(,,,,REF=*.STEP.PROCSTEP.DD),MODE=C
//DD000216 DD  *,VOL=(,,,,REF=A.DATASET.NAME),MODE=C
//DD000217 DD  *,VOL=(,,,,REF='A.DATASET.NAME'),MODE=C
//DD000218 DD  *,VOL=(,,,,REF=REF),MODE=C
//DD000219 DD  *,VOLUME=(,,,,REF=*.DD),MODE=C
//DD000220 DD  *,VOLUME=(,,,,REF=*.STEP.DD),MODE=C
//DD000221 DD  *,VOLUME=(,,,,REF=*.STEP.PROCSTEP.DD),MODE=C
//DD000222 DD  *,VOLUME=(,,,,REF=A.DATASET.NAME),MODE=C
//DD000223 DD  *,VOLUME=(,,,,REF='A.DATASET.NAME'),MODE=C
//DD000224 DD  *,VOLUME=(,,,,REF=REF),MODE=C
//DD001101 DD  *,VOL=REF=*.DD
AEIOU
//DD001102 DD  *,VOL=REF=*.STEP.DD
AEIOU
//DD001103 DD  *,VOL=REF=*.STEP.PROCSTEP.DD
AEIOU
//DD001104 DD  *,VOL=REF=A.DATASET.NAME
AEIOU
//DD001105 DD  *,VOL=REF='A.DATASET.NAME'
AEIOU
//DD001106 DD  *,VOL=REF=REF
AEIOU
//DD001107 DD  *,VOLUME=REF=*.DD
AEIOU
//DD001108 DD  *,VOLUME=REF=*.STEP.DD
AEIOU
//DD001109 DD  *,VOLUME=REF=*.STEP.PROCSTEP.DD
AEIOU
//DD001110 DD  *,VOLUME=REF=A.DATASET.NAME
AEIOU
//DD001111 DD  *,VOLUME=REF='A.DATASET.NAME'
AEIOU
//DD001112 DD  *,VOLUME=REF=REF
AEIOU
//DD001113 DD  *,VOL=(,,,,REF=*.DD)
AEIOU
//DD001114 DD  *,VOL=(,,,,REF=*.STEP.DD)
AEIOU
//DD001115 DD  *,VOL=(,,,,REF=*.STEP.PROCSTEP.DD)
AEIOU
//DD001116 DD  *,VOL=(,,,,REF=A.DATASET.NAME)
AEIOU
//DD001117 DD  *,VOL=(,,,,REF='A.DATASET.NAME')
AEIOU
//DD001118 DD  *,VOL=(,,,,REF=REF)
AEIOU
//DD001119 DD  *,VOLUME=(,,,,REF=*.DD)
AEIOU
//DD001120 DD  *,VOLUME=(,,,,REF=*.STEP.DD)
AEIOU
//DD001121 DD  *,VOLUME=(,,,,REF=*.STEP.PROCSTEP.DD)
AEIOU
//DD001122 DD  *,VOLUME=(,,,,REF=A.DATASET.NAME)
AEIOU
//DD001123 DD  *,VOLUME=(,,,,REF='A.DATASET.NAME')
AEIOU
//DD001124 DD  *,VOLUME=(,,,,REF=REF)
AEIOU
//DD001201 DD  *,VOL=REF=*.DD,MODE=C
AEIOU
//DD001202 DD  *,VOL=REF=*.STEP.DD,MODE=C
AEIOU
//DD001203 DD  *,VOL=REF=*.STEP.PROCSTEP.DD,MODE=C
AEIOU
//DD001204 DD  *,VOL=REF=A.DATASET.NAME,MODE=C
AEIOU
//DD001205 DD  *,VOL=REF='A.DATASET.NAME',MODE=C
AEIOU
//DD001206 DD  *,VOL=REF=REF,MODE=C
AEIOU
//DD001207 DD  *,VOLUME=REF=*.DD,MODE=C
AEIOU
//DD001208 DD  *,VOLUME=REF=*.STEP.DD,MODE=C
AEIOU
//DD001209 DD  *,VOLUME=REF=*.STEP.PROCSTEP.DD,MODE=C
AEIOU
//DD001210 DD  *,VOLUME=REF=A.DATASET.NAME,MODE=C
AEIOU
//DD001211 DD  *,VOLUME=REF='A.DATASET.NAME',MODE=C
AEIOU
//DD001212 DD  *,VOLUME=REF=REF,MODE=C
AEIOU
//DD001213 DD  *,VOL=(,,,,REF=*.DD),MODE=C
AEIOU
//DD001214 DD  *,VOL=(,,,,REF=*.STEP.DD),MODE=C
AEIOU
//DD001215 DD  *,VOL=(,,,,REF=*.STEP.PROCSTEP.DD),MODE=C
AEIOU
//DD001216 DD  *,VOL=(,,,,REF=A.DATASET.NAME),MODE=C
AEIOU
//DD001217 DD  *,VOL=(,,,,REF='A.DATASET.NAME'),MODE=C
AEIOU
//DD001218 DD  *,VOL=(,,,,REF=REF),MODE=C
AEIOU
//DD001219 DD  *,VOLUME=(,,,,REF=*.DD),MODE=C
AEIOU
//DD001220 DD  *,VOLUME=(,,,,REF=*.STEP.DD),MODE=C
AEIOU
//DD001221 DD  *,VOLUME=(,,,,REF=*.STEP.PROCSTEP.DD),MODE=C
AEIOU
//DD001222 DD  *,VOLUME=(,,,,REF=A.DATASET.NAME),MODE=C
AEIOU
//DD001223 DD  *,VOLUME=(,,,,REF='A.DATASET.NAME'),MODE=C
AEIOU
//DD001224 DD  *,VOLUME=(,,,,REF=REF),MODE=C
AEIOU
//DD002001 DD  VOL=REF=*.DD VOL=SER
//DD002002 DD  VOL=REF=*.STEP.DD VOL=SER
//DD002003 DD  VOL=REF=*.STEP.PROCSTEP.DD VOL=SER
//DD002004 DD  VOL=REF=A.DATASET.NAME VOL=SER
//DD002005 DD  VOL=REF='A.DATASET.NAME' VOL=SER
//DD002006 DD  VOL=REF=REF VOL=SER
//DD002007 DD  VOLUME=REF=*.DD VOL=SER
//DD002008 DD  VOLUME=REF=*.STEP.DD VOL=SER
//DD002009 DD  VOLUME=REF=*.STEP.PROCSTEP.DD VOL=SER
//DD002010 DD  VOLUME=REF=A.DATASET.NAME VOL=SER
//DD002011 DD  VOLUME=REF='A.DATASET.NAME' VOL=SER
//DD002012 DD  VOLUME=REF=REF VOL=SER
//DD002013 DD  VOL=(,,,,REF=*.DD) VOL=SER
//DD002014 DD  VOL=(,,,,REF=*.STEP.DD) VOL=SER
//DD002015 DD  VOL=(,,,,REF=*.STEP.PROCSTEP.DD) VOL=SER
//DD002016 DD  VOL=(,,,,REF=A.DATASET.NAME) VOL=SER
//DD002017 DD  VOL=(,,,,REF='A.DATASET.NAME') VOL=SER
//DD002018 DD  VOL=(,,,,REF=REF) VOL=SER
//DD002019 DD  VOLUME=(,,,,REF=*.DD) VOL=SER
//DD002020 DD  VOLUME=(,,,,REF=*.STEP.DD) VOL=SER
//DD002021 DD  VOLUME=(,,,,REF=*.STEP.PROCSTEP.DD) VOL=SER
//DD002022 DD  VOLUME=(,,,,REF=A.DATASET.NAME) VOL=SER
//DD002023 DD  VOLUME=(,,,,REF='A.DATASET.NAME') VOL=SER
//DD002024 DD  VOLUME=(,,,,REF=REF) VOL=SER
//DD002101 DD  *,VOL=REF=*.DD VOL=SER
//DD002102 DD  *,VOL=REF=*.STEP.DD VOL=SER
//DD002103 DD  *,VOL=REF=*.STEP.PROCSTEP.DD VOL=SER
//DD002104 DD  *,VOL=REF=A.DATASET.NAME VOL=SER
//DD002105 DD  *,VOL=REF='A.DATASET.NAME' VOL=SER
//DD002106 DD  *,VOL=REF=REF VOL=SER
//DD002107 DD  *,VOLUME=REF=*.DD VOL=SER
//DD002108 DD  *,VOLUME=REF=*.STEP.DD VOL=SER
//DD002109 DD  *,VOLUME=REF=*.STEP.PROCSTEP.DD VOL=SER
//DD002110 DD  *,VOLUME=REF=A.DATASET.NAME VOL=SER
//DD002111 DD  *,VOLUME=REF='A.DATASET.NAME' VOL=SER
//DD002112 DD  *,VOLUME=REF=REF VOL=SER
//DD002113 DD  *,VOL=(,,,,REF=*.DD) VOL=SER
//DD002114 DD  *,VOL=(,,,,REF=*.STEP.DD) VOL=SER
//DD002115 DD  *,VOL=(,,,,REF=*.STEP.PROCSTEP.DD) VOL=SER
//DD002116 DD  *,VOL=(,,,,REF=A.DATASET.NAME) VOL=SER
//DD002117 DD  *,VOL=(,,,,REF='A.DATASET.NAME') VOL=SER
//DD002118 DD  *,VOL=(,,,,REF=REF) VOL=SER
//DD002119 DD  *,VOLUME=(,,,,REF=*.DD) VOL=SER
//DD002120 DD  *,VOLUME=(,,,,REF=*.STEP.DD) VOL=SER
//DD002121 DD  *,VOLUME=(,,,,REF=*.STEP.PROCSTEP.DD) VOL=SER
//DD002122 DD  *,VOLUME=(,,,,REF=A.DATASET.NAME) VOL=SER
//DD002123 DD  *,VOLUME=(,,,,REF='A.DATASET.NAME') VOL=SER
//DD002124 DD  *,VOLUME=(,,,,REF=REF) VOL=SER
//DD002201 DD  *,VOL=REF=*.DD,MODE=C VOL=SER
//DD002202 DD  *,VOL=REF=*.STEP.DD,MODE=C VOL=SER
//DD002203 DD  *,VOL=REF=*.STEP.PROCSTEP.DD,MODE=C VOL=SER
//DD002204 DD  *,VOL=REF=A.DATASET.NAME,MODE=C VOL=SER
//DD002205 DD  *,VOL=REF='A.DATASET.NAME',MODE=C VOL=SER
//DD002206 DD  *,VOL=REF=REF,MODE=C VOL=SER
//DD002207 DD  *,VOLUME=REF=*.DD,MODE=C VOL=SER
//DD002208 DD  *,VOLUME=REF=*.STEP.DD,MODE=C VOL=SER
//DD002209 DD  *,VOLUME=REF=*.STEP.PROCSTEP.DD,MODE=C VOL=SER
//DD002210 DD  *,VOLUME=REF=A.DATASET.NAME,MODE=C VOL=SER
//DD002211 DD  *,VOLUME=REF='A.DATASET.NAME',MODE=C VOL=SER
//DD002212 DD  *,VOLUME=REF=REF,MODE=C VOL=SER
//DD002213 DD  *,VOL=(,,,,REF=*.DD),MODE=C VOL=SER
//DD002214 DD  *,VOL=(,,,,REF=*.STEP.DD),MODE=C VOL=SER
//DD002215 DD  *,VOL=(,,,,REF=*.STEP.PROCSTEP.DD),MODE=C VOL=SER
//DD002216 DD  *,VOL=(,,,,REF=A.DATASET.NAME),MODE=C VOL=SER
//DD002217 DD  *,VOL=(,,,,REF='A.DATASET.NAME'),MODE=C VOL=SER
//DD002218 DD  *,VOL=(,,,,REF=REF),MODE=C VOL=SER
//DD002219 DD  *,VOLUME=(,,,,REF=*.DD),MODE=C VOL=SER
//DD002220 DD  *,VOLUME=(,,,,REF=*.STEP.DD),MODE=C VOL=SER
//DD002221 DD  *,VOLUME=(,,,,REF=*.STEP.PROCSTEP.DD),MODE=C VOL=SER
//DD002222 DD  *,VOLUME=(,,,,REF=A.DATASET.NAME),MODE=C VOL=SER
//DD002223 DD  *,VOLUME=(,,,,REF='A.DATASET.NAME'),MODE=C VOL=SER
//DD002224 DD  *,VOLUME=(,,,,REF=REF),MODE=C VOL=SER
//DD003101 DD  *,VOL=REF=*.DD VOL=SER
AEIOU
//DD003102 DD  *,VOL=REF=*.STEP.DD VOL=SER
AEIOU
//DD003103 DD  *,VOL=REF=*.STEP.PROCSTEP.DD VOL=SER
AEIOU
//DD003104 DD  *,VOL=REF=A.DATASET.NAME VOL=SER
AEIOU
//DD003105 DD  *,VOL=REF='A.DATASET.NAME' VOL=SER
AEIOU
//DD003106 DD  *,VOL=REF=REF VOL=SER
AEIOU
//DD003107 DD  *,VOLUME=REF=*.DD VOL=SER
AEIOU
//DD003108 DD  *,VOLUME=REF=*.STEP.DD VOL=SER
AEIOU
//DD003109 DD  *,VOLUME=REF=*.STEP.PROCSTEP.DD VOL=SER
AEIOU
//DD003110 DD  *,VOLUME=REF=A.DATASET.NAME VOL=SER
AEIOU
//DD003111 DD  *,VOLUME=REF='A.DATASET.NAME' VOL=SER
AEIOU
//DD003112 DD  *,VOLUME=REF=REF VOL=SER
AEIOU
//DD003113 DD  *,VOL=(,,,,REF=*.DD) VOL=SER
AEIOU
//DD003114 DD  *,VOL=(,,,,REF=*.STEP.DD) VOL=SER
AEIOU
//DD003115 DD  *,VOL=(,,,,REF=*.STEP.PROCSTEP.DD) VOL=SER
AEIOU
//DD003116 DD  *,VOL=(,,,,REF=A.DATASET.NAME) VOL=SER
AEIOU
//DD003117 DD  *,VOL=(,,,,REF='A.DATASET.NAME') VOL=SER
AEIOU
//DD003118 DD  *,VOL=(,,,,REF=REF) VOL=SER
AEIOU
//DD003119 DD  *,VOLUME=(,,,,REF=*.DD) VOL=SER
AEIOU
//DD003120 DD  *,VOLUME=(,,,,REF=*.STEP.DD) VOL=SER
AEIOU
//DD003121 DD  *,VOLUME=(,,,,REF=*.STEP.PROCSTEP.DD) VOL=SER
AEIOU
//DD003122 DD  *,VOLUME=(,,,,REF=A.DATASET.NAME) VOL=SER
AEIOU
//DD003123 DD  *,VOLUME=(,,,,REF='A.DATASET.NAME') VOL=SER
AEIOU
//DD003124 DD  *,VOLUME=(,,,,REF=REF) VOL=SER
AEIOU
//DD003201 DD  *,VOL=REF=*.DD,MODE=C VOL=SER
AEIOU
//DD003202 DD  *,VOL=REF=*.STEP.DD,MODE=C VOL=SER
AEIOU
//DD003203 DD  *,VOL=REF=*.STEP.PROCSTEP.DD,MODE=C VOL=SER
AEIOU
//DD003204 DD  *,VOL=REF=A.DATASET.NAME,MODE=C VOL=SER
AEIOU
//DD003205 DD  *,VOL=REF='A.DATASET.NAME',MODE=C VOL=SER
AEIOU
//DD003206 DD  *,VOL=REF=REF,MODE=C VOL=SER
AEIOU
//DD003207 DD  *,VOLUME=REF=*.DD,MODE=C VOL=SER
AEIOU
//DD003208 DD  *,VOLUME=REF=*.STEP.DD,MODE=C VOL=SER
AEIOU
//DD003209 DD  *,VOLUME=REF=*.STEP.PROCSTEP.DD,MODE=C VOL=SER
AEIOU
//DD003210 DD  *,VOLUME=REF=A.DATASET.NAME,MODE=C VOL=SER
AEIOU
//DD003211 DD  *,VOLUME=REF='A.DATASET.NAME',MODE=C VOL=SER
AEIOU
//DD003212 DD  *,VOLUME=REF=REF,MODE=C VOL=SER
AEIOU
//DD003213 DD  *,VOL=(,,,,REF=*.DD),MODE=C VOL=SER
AEIOU
//DD003214 DD  *,VOL=(,,,,REF=*.STEP.DD),MODE=C VOL=SER
AEIOU
//DD003215 DD  *,VOL=(,,,,REF=*.STEP.PROCSTEP.DD),MODE=C VOL=SER
AEIOU
//DD003216 DD  *,VOL=(,,,,REF=A.DATASET.NAME),MODE=C VOL=SER
AEIOU
//DD003217 DD  *,VOL=(,,,,REF='A.DATASET.NAME'),MODE=C VOL=SER
AEIOU
//DD003218 DD  *,VOL=(,,,,REF=REF),MODE=C VOL=SER
AEIOU
//DD003219 DD  *,VOLUME=(,,,,REF=*.DD),MODE=C VOL=SER
AEIOU
//DD003220 DD  *,VOLUME=(,,,,REF=*.STEP.DD),MODE=C VOL=SER
AEIOU
//DD003221 DD  *,VOLUME=(,,,,REF=*.STEP.PROCSTEP.DD),MODE=C VOL=SER
AEIOU
//DD003222 DD  *,VOLUME=(,,,,REF=A.DATASET.NAME),MODE=C VOL=SER
AEIOU
//DD003223 DD  *,VOLUME=(,,,,REF='A.DATASET.NAME'),MODE=C VOL=SER
AEIOU
//DD003224 DD  *,VOLUME=(,,,,REF=REF),MODE=C VOL=SER
AEIOU

