//PATHOPTS JOB
//*
//STEP0001 EXEC PGM=AOPBATCH
//DD000001 DD  PATHOPTS=ORDONLY
//DD000002 DD  PATHOPTS=OWRONLY
//DD000003 DD  PATHOPTS=ORDWR
//DD000004 DD  PATHOPTS=OAPPEND
//DD000005 DD  PATHOPTS=OCREAT
//DD000006 DD  PATHOPTS=OEXCL
//DD000007 DD  PATHOPTS=ONOCTTY
//DD000008 DD  PATHOPTS=ONONBLOCK
//DD000009 DD  PATHOPTS=OSYNC
//DD000010 DD  PATHOPTS=OTRUNC
//DD000021 DD  PATHOPTS=(ORDONLY)
//DD000022 DD  PATHOPTS=(OWRONLY)
//DD000023 DD  PATHOPTS=(ORDWR)
//DD000024 DD  PATHOPTS=(OAPPEND)
//DD000025 DD  PATHOPTS=(OCREAT)
//DD000026 DD  PATHOPTS=(OEXCL)
//DD000027 DD  PATHOPTS=(ONOCTTY)
//DD000028 DD  PATHOPTS=(ONONBLOCK)
//DD000029 DD  PATHOPTS=(OSYNC)
//DD000030 DD  PATHOPTS=(OTRUNC)
//DD000031 DD  PATHOPTS=(ORDONLY,OAPPEND)
//DD000032 DD  PATHOPTS=(OWRONLY,OCREAT)
//DD000033 DD  PATHOPTS=(ORDWR,OEXCL)
//DD000034 DD  PATHOPTS=(OAPPEND,OCREAT)
//DD000035 DD  PATHOPTS=(OCREAT,OEXCL)
//DD000036 DD  PATHOPTS=(OEXCL,ONOCTTY)
//DD000037 DD  PATHOPTS=(ONOCTTY,ONONBLOCK)
//DD000038 DD  PATHOPTS=(ONONBLOCK,OSYNC)
//DD000039 DD  PATHOPTS=(OSYNC,OTRUNC)
//DD000040 DD  PATHOPTS=(OTRUNC,OAPPEND)
//DD000041 DD  PATHOPTS=(ORDONLY,
// OWRONLY,
// ORDWR,
// OAPPEND,
// OCREAT,
// OEXCL,
// ONOCTTY,
// ONONBLOCK,
// OSYNC,
// OTRUNC)
//DD000042 DD  PATHOPTS=(ORDONLY,OWRONLY,ORDWR,OAPPEND,OCREAT,OEXCL,
// ONOCTTY,ONONBLOCK,OSYNC,OTRUNC)
//DD000001 DD  PATHOPTS=ORDONLY PATHOPTS
//DD000002 DD  PATHOPTS=OWRONLY PATHOPTS
//DD000003 DD  PATHOPTS=ORDWR PATHOPTS
//DD000004 DD  PATHOPTS=OAPPEND PATHOPTS
//DD000005 DD  PATHOPTS=OCREAT PATHOPTS
//DD000006 DD  PATHOPTS=OEXCL PATHOPTS
//DD000007 DD  PATHOPTS=ONOCTTY PATHOPTS
//DD000008 DD  PATHOPTS=ONONBLOCK PATHOPTS
//DD000009 DD  PATHOPTS=OSYNC PATHOPTS
//DD000010 DD  PATHOPTS=OTRUNC PATHOPTS
//DD000021 DD  PATHOPTS=(ORDONLY) PATHOPTS
//DD000022 DD  PATHOPTS=(OWRONLY) PATHOPTS
//DD000023 DD  PATHOPTS=(ORDWR) PATHOPTS
//DD000024 DD  PATHOPTS=(OAPPEND) PATHOPTS
//DD000025 DD  PATHOPTS=(OCREAT) PATHOPTS
//DD000026 DD  PATHOPTS=(OEXCL) PATHOPTS
//DD000027 DD  PATHOPTS=(ONOCTTY) PATHOPTS
//DD000028 DD  PATHOPTS=(ONONBLOCK) PATHOPTS
//DD000029 DD  PATHOPTS=(OSYNC) PATHOPTS
//DD000030 DD  PATHOPTS=(OTRUNC) PATHOPTS
//DD000031 DD  PATHOPTS=(ORDONLY,OAPPEND) PATHOPTS
//DD000032 DD  PATHOPTS=(OWRONLY,OCREAT) PATHOPTS
//DD000033 DD  PATHOPTS=(ORDWR,OEXCL) PATHOPTS
//DD000034 DD  PATHOPTS=(OAPPEND,OCREAT) PATHOPTS
//DD000035 DD  PATHOPTS=(OCREAT,OEXCL) PATHOPTS
//DD000036 DD  PATHOPTS=(OEXCL,ONOCTTY) PATHOPTS
//DD000037 DD  PATHOPTS=(ONOCTTY,ONONBLOCK) PATHOPTS
//DD000038 DD  PATHOPTS=(ONONBLOCK,OSYNC) PATHOPTS
//DD000039 DD  PATHOPTS=(OSYNC,OTRUNC) PATHOPTS
//DD000040 DD  PATHOPTS=(OTRUNC,OAPPEND) PATHOPTS
//DD000041 DD  PATHOPTS=(ORDONLY, PATHOPTS
// OWRONLY, PATHOPTS
// ORDWR, PATHOPTS
// OAPPEND, PATHOPTS
// OCREAT, PATHOPTS
// OEXCL, PATHOPTS
// ONOCTTY, PATHOPTS
// ONONBLOCK, PATHOPTS
// OSYNC, PATHOPTS
// OTRUNC) PATHOPTS
//DD000042 DD  PATHOPTS=(ORDONLY,OWRONLY,ORDWR,OAPPEND,OCREAT,OEXCL,
// ONOCTTY,ONONBLOCK,OSYNC,OTRUNC) PATHOPTS

