//KEYENCD1 JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  KEYENCD1=L
//DD000002 DD  KEYENCD1=H
//DD000003 DD  KEYENCD1=&KEYENCD1
//DD000101 DD  KEYENCD1=L KEYENCD1
//DD000102 DD  KEYENCD1=H KEYENCD1
//DD000103 DD  KEYENCD1=&KEYENCD1 KEYENCD1

