//DSNTYPE JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  DSNTYPE=BASIC
//DD000002 DD  DSNTYPE=EXTPREF
//DD000003 DD  DSNTYPE=EXTREQ
//DD000004 DD  DSNTYPE=HFS
//DD000005 DD  DSNTYPE=PDS
//DD000006 DD  DSNTYPE=PIPE
//DD000007 DD  DSNTYPE=(LIBRARY,1)
//DD000008 DD  DSNTYPE=(LIBRARY,2)
//DD000009 DD  DSNTYPE=LIBRARY
//DD000010 DD  DSNTYPE=LARGE
//DD000011 DD  DSNTYPE=&DSNTYPE
//DD000012 DD  DSNTYPE=(LIBRARY,&DSNTYPE)
//DD000013 DD  DSNTYPE=(&DSNTYPE,&DSNTYPE)
//DD000101 DD  DSNTYPE=BASIC DSNTYPE
//DD000102 DD  DSNTYPE=EXTPREF DSNTYPE
//DD000103 DD  DSNTYPE=EXTREQ DSNTYPE
//DD000104 DD  DSNTYPE=HFS DSNTYPE
//DD000105 DD  DSNTYPE=PDS DSNTYPE
//DD000106 DD  DSNTYPE=PIPE DSNTYPE
//DD000107 DD  DSNTYPE=(LIBRARY,1) DSNTYPE
//DD000108 DD  DSNTYPE=(LIBRARY,2) DSNTYPE
//DD000109 DD  DSNTYPE=LIBRARY DSNTYPE
//DD000110 DD  DSNTYPE=LARGE DSNTYPE
//DD000111 DD  DSNTYPE=&DSNTYPE DSNTYPE
//DD000112 DD  DSNTYPE=(LIBRARY,&DSNTYPE) DSNTYPE
//DD000113 DD  DSNTYPE=(&DSNTYPE,&DSNTYPE) DSNTYPE
