//DD JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD DD * INSTREAM DATA
I
LOVE A PARADE
I REALLY DO
/*
//STEP0002 EXEC PGM=IEFBR14
//DD DD *
EGGS
//*
//STEP0003 EXEC PGM=IEFBR14
//DD DD *
BLURG
//STEP0004 EXEC PGM=IEFBR14
//DD0001 DD ACCODE=1
//DD0002 DD ACCODE=12
//DD0003 DD ACCODE=123
//DD0004 DD ACCODE=A
//DD0005 DD ACCODE=AB
//DD0006 DD ACCODE=ABC
//DD0007 DD ACCODE=A1
//DD0008 DD ACCODE=A1B
//DD0009 DD ACCODE=A1B2
//DD0010 DD ACCODE='!'
//DD0011 DD ACCODE='1'
//DD0012 DD ACCODE='12'
//DD0013 DD ACCODE='123'
//DD0014 DD ACCODE='A'
//DD0015 DD ACCODE='AB'
//DD0016 DD ACCODE='ABC'
//DD0017 DD ACCODE='A1'
//DD0018 DD ACCODE='A1B'
//DD0019 DD ACCODE='A1B2'
//DD0021 DD ACCODE='*'
//DD0022 DD ACCODE='"'
//DD0023 DD ACCODE='%'
//DD0024 DD ACCODE=''''
//DD0025 DD ACCODE='('
//DD0026 DD ACCODE=')'
//DD0027 DD ACCODE='+'
//DD0028 DD ACCODE=','
//DD0029 DD ACCODE='-'
//DD0030 DD ACCODE='.'
//DD0031 DD ACCODE='/'
//DD0032 DD ACCODE=':'
//DD0033 DD ACCODE=';'
//DD0034 DD ACCODE='<'
//DD0035 DD ACCODE='='
//DD0036 DD ACCODE='>'
//DD0037 DD ACCODE='?'
//DD0038 DD ACCODE='A''B''!''1'
//DD0039 DD ACCODE=&ACCODE
//DD0040 DD ACCODE=1 ACCODE
//DD0041 DD ACCODE=A ACCODE
//DD0042 DD ACCODE='1' ACCODE
//DD0043 DD ACCODE='!#"%''()1' ACCODE
//DD0044 DD ACCODE=&ACCODE ACCODE

