//VOLUME JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000201 DD  DSID=(#A[C4E67,V),
//             VOL=(,
//             ,
//             ,
//             ,
//             REF=*.DD)

