//UNIT JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000000 DD  UNIT=AFF=DD99
//DD000001 DD  UNIT=001
//DD000002 DD  UNIT=00A
//DD000003 DD  UNIT=/001
//DD000004 DD  UNIT=/00A
//DD000005 DD  UNIT=/0001
//DD000006 DD  UNIT=/000A
//DD000007 DD  UNIT=3390
//DD000008 DD  UNIT=TAPE
//DD000009 DD  UNIT=3400-9
//DD000010 DD  UNIT=SYSALLDA
//DD000011 DD  UNIT=SYS3480R
//DD000012 DD  UNIT=SYS348XR
//DD000013 DD  UNIT=&UNIT
//DD000101 DD  UNIT=(001)
//DD000102 DD  UNIT=(00A)
//DD000103 DD  UNIT=(/001)
//DD000104 DD  UNIT=(/00A)
//DD000105 DD  UNIT=(/0001)
//DD000106 DD  UNIT=(/000A)
//DD000107 DD  UNIT=(3390)
//DD000108 DD  UNIT=(TAPE)
//DD000109 DD  UNIT=(3400-9)
//DD000110 DD  UNIT=(SYSALLDA)
//DD000111 DD  UNIT=(SYS3480R)
//DD000112 DD  UNIT=(SYS348XR)
//DD000113 DD  UNIT=(&UNIT)
//DD000201 DD  UNIT=(001,1)
//DD000202 DD  UNIT=(00A,59)
//DD000203 DD  UNIT=(/001,1)
//DD000204 DD  UNIT=(/00A,59)
//DD000205 DD  UNIT=(/0001,1)
//DD000206 DD  UNIT=(/000A,59)
//DD000207 DD  UNIT=(3390,1)
//DD000208 DD  UNIT=(TAPE,59)
//DD000209 DD  UNIT=(3400-9,1)
//DD000210 DD  UNIT=(SYSALLDA,59)
//DD000211 DD  UNIT=(SYS3480R,1)
//DD000212 DD  UNIT=(SYS348XR,59)
//DD000213 DD  UNIT=(&UNIT,&COUNT)
//DD000214 DD  UNIT=(&UNIT&COUNT)
//DD000215 DD  UNIT=(&UNIT,1)
//DD000216 DD  UNIT=(&UNIT,&COUNT)
//DD000217 DD  UNIT=(001,&COUNT)
//DD000218 DD  UNIT=(00A,&COUNT)
//DD000219 DD  UNIT=(/001,&COUNT)
//DD000220 DD  UNIT=(/00A,&COUNT)
//DD000221 DD  UNIT=(/0001,&COUNT)
//DD000222 DD  UNIT=(/000A,&COUNT)
//DD000223 DD  UNIT=(3390,&COUNT)
//DD000224 DD  UNIT=(TAPE,&COUNT)
//DD000225 DD  UNIT=(3400-9,&COUNT)
//DD000226 DD  UNIT=(SYSALLDA,&COUNT)
//DD000227 DD  UNIT=(SYS3480R,&COUNT)
//DD000228 DD  UNIT=(SYS348XR,&COUNT)
//DD000229 DD  UNIT=(001,P)
//DD000230 DD  UNIT=(00A,P)
//DD000231 DD  UNIT=(/001,P)
//DD000232 DD  UNIT=(/00A,P)
//DD000233 DD  UNIT=(/0001,P)
//DD000234 DD  UNIT=(/000A,P)
//DD000235 DD  UNIT=(3390,P)
//DD000236 DD  UNIT=(TAPE,P)
//DD000237 DD  UNIT=(3400-9,P)
//DD000238 DD  UNIT=(SYSALLDA,P)
//DD000239 DD  UNIT=(SYS3480R,P)
//DD000240 DD  UNIT=(SYS348XR,P)
//DD000241 DD  UNIT=(&UNIT,P)
//DD000301 DD  UNIT=(001,1,DEFER)
//DD000302 DD  UNIT=(00A,59,DEFER)
//DD000303 DD  UNIT=(/001,1,DEFER)
//DD000304 DD  UNIT=(/00A,59,DEFER)
//DD000305 DD  UNIT=(/0001,1,DEFER)
//DD000306 DD  UNIT=(/000A,59,DEFER)
//DD000307 DD  UNIT=(3390,1,DEFER)
//DD000308 DD  UNIT=(TAPE,59,DEFER)
//DD000309 DD  UNIT=(3400-9,1,DEFER)
//DD000310 DD  UNIT=(SYSALLDA,59,DEFER)
//DD000311 DD  UNIT=(SYS3480R,1,DEFER)
//DD000312 DD  UNIT=(SYS348XR,59,DEFER)
//DD000313 DD  UNIT=(&UNIT,&COUNT,DEFER)
//DD000314 DD  UNIT=(&UNIT&COUNT,DEFER)
//DD000315 DD  UNIT=(&UNIT,1,DEFER)
//DD000316 DD  UNIT=(&UNIT,&COUNT,DEFER)
//DD000317 DD  UNIT=(001,&COUNT,DEFER)
//DD000318 DD  UNIT=(00A,&COUNT,DEFER)
//DD000319 DD  UNIT=(/001,&COUNT,DEFER)
//DD000320 DD  UNIT=(/00A,&COUNT,DEFER)
//DD000321 DD  UNIT=(/0001,&COUNT,DEFER)
//DD000322 DD  UNIT=(/000A,&COUNT,DEFER)
//DD000323 DD  UNIT=(3390,&COUNT,DEFER)
//DD000324 DD  UNIT=(TAPE,&COUNT,DEFER)
//DD000325 DD  UNIT=(3400-9,&COUNT,DEFER)
//DD000326 DD  UNIT=(SYSALLDA,&COUNT,DEFER)
//DD000327 DD  UNIT=(SYS3480R,&COUNT,DEFER)
//DD000328 DD  UNIT=(SYS348XR,&COUNT,DEFER)
//DD000329 DD  UNIT=(001,P,DEFER)
//DD000330 DD  UNIT=(00A,P,DEFER)
//DD000331 DD  UNIT=(/001,P,DEFER)
//DD000332 DD  UNIT=(/00A,P,DEFER)
//DD000333 DD  UNIT=(/0001,P,DEFER)
//DD000334 DD  UNIT=(/000A,P,DEFER)
//DD000335 DD  UNIT=(3390,P,DEFER)
//DD000336 DD  UNIT=(TAPE,P,DEFER)
//DD000337 DD  UNIT=(3400-9,P,DEFER)
//DD000338 DD  UNIT=(SYSALLDA,P,DEFER)
//DD000339 DD  UNIT=(SYS3480R,P,DEFER)
//DD000340 DD  UNIT=(SYS348XR,P,DEFER)
//DD000341 DD  UNIT=(&UNIT,P,DEFER)
//DD000342 DD  UNIT=(&UNIT&COUNT&DEFER)
//DD000401 DD  UNIT=(001,1,DEFER,SMSHONOR)
//DD000402 DD  UNIT=(00A,59,DEFER,SMSHONOR)
//DD000403 DD  UNIT=(/001,1,DEFER,SMSHONOR)
//DD000404 DD  UNIT=(/00A,59,DEFER,SMSHONOR)
//DD000405 DD  UNIT=(/0001,1,DEFER,SMSHONOR)
//DD000406 DD  UNIT=(/000A,59,DEFER,SMSHONOR)
//DD000407 DD  UNIT=(3390,1,DEFER,SMSHONOR)
//DD000408 DD  UNIT=(TAPE,59,DEFER,SMSHONOR)
//DD000409 DD  UNIT=(3400-9,1,DEFER,SMSHONOR)
//DD000410 DD  UNIT=(SYSALLDA,59,DEFER,SMSHONOR)
//DD000411 DD  UNIT=(SYS3480R,1,DEFER,SMSHONOR)
//DD000412 DD  UNIT=(SYS348XR,59,DEFER,SMSHONOR)
//DD000413 DD  UNIT=(&UNIT,&COUNT,DEFER,SMSHONOR)
//DD000414 DD  UNIT=(&UNIT&COUNT,DEFER,SMSHONOR)
//DD000415 DD  UNIT=(&UNIT,1,DEFER,SMSHONOR)
//DD000416 DD  UNIT=(&UNIT,&COUNT,DEFER,SMSHONOR)
//DD000417 DD  UNIT=(001,&COUNT,DEFER,SMSHONOR)
//DD000418 DD  UNIT=(00A,&COUNT,DEFER,SMSHONOR)
//DD000419 DD  UNIT=(/001,&COUNT,DEFER,SMSHONOR)
//DD000420 DD  UNIT=(/00A,&COUNT,DEFER,SMSHONOR)
//DD000421 DD  UNIT=(/0001,&COUNT,DEFER,SMSHONOR)
//DD000422 DD  UNIT=(/000A,&COUNT,DEFER,SMSHONOR)
//DD000423 DD  UNIT=(3390,&COUNT,DEFER,SMSHONOR)
//DD000424 DD  UNIT=(TAPE,&COUNT,DEFER,SMSHONOR)
//DD000425 DD  UNIT=(3400-9,&COUNT,DEFER,SMSHONOR)
//DD000426 DD  UNIT=(SYSALLDA,&COUNT,DEFER,SMSHONOR)
//DD000427 DD  UNIT=(SYS3480R,&COUNT,DEFER,SMSHONOR)
//DD000428 DD  UNIT=(SYS348XR,&COUNT,DEFER,SMSHONOR)
//DD000429 DD  UNIT=(001,P,DEFER,SMSHONOR)
//DD000430 DD  UNIT=(00A,P,DEFER,SMSHONOR)
//DD000431 DD  UNIT=(/001,P,DEFER,SMSHONOR)
//DD000432 DD  UNIT=(/00A,P,DEFER,SMSHONOR)
//DD000433 DD  UNIT=(/0001,P,DEFER,SMSHONOR)
//DD000434 DD  UNIT=(/000A,P,DEFER,SMSHONOR)
//DD000435 DD  UNIT=(3390,P,DEFER,SMSHONOR)
//DD000436 DD  UNIT=(TAPE,P,DEFER,SMSHONOR)
//DD000437 DD  UNIT=(3400-9,P,DEFER,SMSHONOR)
//DD000438 DD  UNIT=(SYSALLDA,P,DEFER,SMSHONOR)
//DD000439 DD  UNIT=(SYS3480R,P,DEFER,SMSHONOR)
//DD000440 DD  UNIT=(SYS348XR,P,DEFER,SMSHONOR)
//DD000441 DD  UNIT=(&UNIT,P,DEFER,SMSHONOR)
//DD000442 DD  UNIT=(&UNIT&COUNT,DEFER,SMSHONOR)
//DD000443 DD  UNIT=(&UNIT&COUNT&DEFER,SMSHONOR)
//DD000444 DD  UNIT=(&UNIT&COUNT&DEFER&SMSHONOR)
//DD000501 DD  UNIT=(001,1,,SMSHONOR)
//DD000502 DD  UNIT=(00A,59,,SMSHONOR)
//DD000503 DD  UNIT=(/001,1,,SMSHONOR)
//DD000504 DD  UNIT=(/00A,59,,SMSHONOR)
//DD000505 DD  UNIT=(/0001,1,,SMSHONOR)
//DD000506 DD  UNIT=(/000A,59,,SMSHONOR)
//DD000507 DD  UNIT=(3390,1,,SMSHONOR)
//DD000508 DD  UNIT=(TAPE,59,,SMSHONOR)
//DD000509 DD  UNIT=(3400-9,1,,SMSHONOR)
//DD000510 DD  UNIT=(SYSALLDA,59,,SMSHONOR)
//DD000511 DD  UNIT=(SYS3480R,1,,SMSHONOR)
//DD000512 DD  UNIT=(SYS348XR,59,,SMSHONOR)
//DD000513 DD  UNIT=(&UNIT,&COUNT,,SMSHONOR)
//DD000514 DD  UNIT=(&UNIT&COUNT,,SMSHONOR)
//DD000515 DD  UNIT=(&UNIT,1,,SMSHONOR)
//DD000516 DD  UNIT=(&UNIT,&COUNT,,SMSHONOR)
//DD000517 DD  UNIT=(001,&COUNT,,SMSHONOR)
//DD000518 DD  UNIT=(00A,&COUNT,,SMSHONOR)
//DD000519 DD  UNIT=(/001,&COUNT,,SMSHONOR)
//DD000520 DD  UNIT=(/00A,&COUNT,,SMSHONOR)
//DD000521 DD  UNIT=(/0001,&COUNT,,SMSHONOR)
//DD000522 DD  UNIT=(/000A,&COUNT,,SMSHONOR)
//DD000523 DD  UNIT=(3390,&COUNT,,SMSHONOR)
//DD000524 DD  UNIT=(TAPE,&COUNT,,SMSHONOR)
//DD000525 DD  UNIT=(3400-9,&COUNT,,SMSHONOR)
//DD000526 DD  UNIT=(SYSALLDA,&COUNT,,SMSHONOR)
//DD000527 DD  UNIT=(SYS3480R,&COUNT,,SMSHONOR)
//DD000528 DD  UNIT=(SYS348XR,&COUNT,,SMSHONOR)
//DD000529 DD  UNIT=(001,P,,SMSHONOR)
//DD000530 DD  UNIT=(00A,P,,SMSHONOR)
//DD000531 DD  UNIT=(/001,P,,SMSHONOR)
//DD000532 DD  UNIT=(/00A,P,,SMSHONOR)
//DD000533 DD  UNIT=(/0001,P,,SMSHONOR)
//DD000534 DD  UNIT=(/000A,P,,SMSHONOR)
//DD000535 DD  UNIT=(3390,P,,SMSHONOR)
//DD000536 DD  UNIT=(TAPE,P,,SMSHONOR)
//DD000537 DD  UNIT=(3400-9,P,,SMSHONOR)
//DD000538 DD  UNIT=(SYSALLDA,P,,SMSHONOR)
//DD000539 DD  UNIT=(SYS3480R,P,,SMSHONOR)
//DD000540 DD  UNIT=(SYS348XR,P,,SMSHONOR)
//DD000541 DD  UNIT=(&UNIT,P,,SMSHONOR)
//DD000542 DD  UNIT=(&UNIT&COUNT,,SMSHONOR)
//DD000601 DD  UNIT=(001,,DEFER,SMSHONOR)
//DD000602 DD  UNIT=(00A,,DEFER,SMSHONOR)
//DD000603 DD  UNIT=(/001,,DEFER,SMSHONOR)
//DD000604 DD  UNIT=(/00A,,DEFER,SMSHONOR)
//DD000605 DD  UNIT=(/0001,,DEFER,SMSHONOR)
//DD000606 DD  UNIT=(/000A,,DEFER,SMSHONOR)
//DD000607 DD  UNIT=(3390,,DEFER,SMSHONOR)
//DD000608 DD  UNIT=(TAPE,,DEFER,SMSHONOR)
//DD000609 DD  UNIT=(3400-9,,DEFER,SMSHONOR)
//DD000610 DD  UNIT=(SYSALLDA,,DEFER,SMSHONOR)
//DD000611 DD  UNIT=(SYS3480R,,DEFER,SMSHONOR)
//DD000612 DD  UNIT=(SYS348XR,,DEFER,SMSHONOR)
//DD000613 DD  UNIT=(&UNIT,,DEFER,SMSHONOR)
//DD000614 DD  UNIT=(&UNIT,,&DEFER,SMSHONOR)
//DD000615 DD  UNIT=(&UNIT,,DEFER,&SMSHONOR)
//DD000616 DD  UNIT=(&UNIT,,&DEFER,&SMSHONOR)
//DD000617 DD  UNIT=(&UNIT,,&DEFER&SMSHONOR)
//DD000701 DD  UNIT=(001,,,SMSHONOR)
//DD000702 DD  UNIT=(00A,,,SMSHONOR)
//DD000703 DD  UNIT=(/001,,,SMSHONOR)
//DD000704 DD  UNIT=(/00A,,,SMSHONOR)
//DD000705 DD  UNIT=(/0001,,,SMSHONOR)
//DD000706 DD  UNIT=(/000A,,,SMSHONOR)
//DD000707 DD  UNIT=(3390,,,SMSHONOR)
//DD000708 DD  UNIT=(TAPE,,,SMSHONOR)
//DD000709 DD  UNIT=(3400-9,,,SMSHONOR)
//DD000710 DD  UNIT=(SYSALLDA,,,SMSHONOR)
//DD000711 DD  UNIT=(SYS3480R,,,SMSHONOR)
//DD000712 DD  UNIT=(SYS348XR,,,SMSHONOR)
//DD000713 DD  UNIT=(&UNIT,,,SMSHONOR)
//DD000714 DD  UNIT=(,,,SMSHONOR)
//DD000801 DD  UNIT=(001,,DEFER)
//DD000802 DD  UNIT=(00A,,DEFER)
//DD000803 DD  UNIT=(/001,,DEFER)
//DD000804 DD  UNIT=(/00A,,DEFER)
//DD000805 DD  UNIT=(/0001,,DEFER)
//DD000806 DD  UNIT=(/000A,,DEFER)
//DD000807 DD  UNIT=(3390,,DEFER)
//DD000808 DD  UNIT=(TAPE,,DEFER)
//DD000809 DD  UNIT=(3400-9,,DEFER)
//DD000810 DD  UNIT=(SYSALLDA,,DEFER)
//DD000811 DD  UNIT=(SYS3480R,,DEFER)
//DD000812 DD  UNIT=(SYS348XR,,DEFER)
//DD000813 DD  UNIT=(&UNIT,,DEFER)
//DD000814 DD  UNIT=(&UNIT,,&DEFER)
//DD000815 DD  UNIT=(,1,DEFER)
//DD000816 DD  UNIT=(,59,DEFER)
//DD000817 DD  UNIT=(,1,&DEFER)
//DD000818 DD  UNIT=(,59,&DEFER)
//DD000819 DD  UNIT=(,,DEFER)
//DD000820 DD  UNIT=(,,&DEFER)
//DD000821 DD  UNIT=(,1)
//DD000822 DD  UNIT=(,&COUNT)
//DD000001 DD  UNIT=001 UNIT
//DD000002 DD  UNIT=00A UNIT
//DD000003 DD  UNIT=/001 UNIT
//DD000004 DD  UNIT=/00A UNIT
//DD000005 DD  UNIT=/0001 UNIT
//DD000006 DD  UNIT=/000A UNIT
//DD000007 DD  UNIT=3390 UNIT
//DD000008 DD  UNIT=TAPE UNIT
//DD000009 DD  UNIT=3400-9 UNIT
//DD000010 DD  UNIT=SYSALLDA UNIT
//DD000011 DD  UNIT=SYS3480R UNIT
//DD000012 DD  UNIT=SYS348XR UNIT
//DD000013 DD  UNIT=&UNIT UNIT
//DD000101 DD  UNIT=(001) UNIT
//DD000102 DD  UNIT=(00A) UNIT
//DD000103 DD  UNIT=(/001) UNIT
//DD000104 DD  UNIT=(/00A) UNIT
//DD000105 DD  UNIT=(/0001) UNIT
//DD000106 DD  UNIT=(/000A) UNIT
//DD000107 DD  UNIT=(3390) UNIT
//DD000108 DD  UNIT=(TAPE) UNIT
//DD000109 DD  UNIT=(3400-9) UNIT
//DD000110 DD  UNIT=(SYSALLDA) UNIT
//DD000111 DD  UNIT=(SYS3480R) UNIT
//DD000112 DD  UNIT=(SYS348XR) UNIT
//DD000113 DD  UNIT=(&UNIT) UNIT
//DD000201 DD  UNIT=(001,1) UNIT
//DD000202 DD  UNIT=(00A,59) UNIT
//DD000203 DD  UNIT=(/001,1) UNIT
//DD000204 DD  UNIT=(/00A,59) UNIT
//DD000205 DD  UNIT=(/0001,1) UNIT
//DD000206 DD  UNIT=(/000A,59) UNIT
//DD000207 DD  UNIT=(3390,1) UNIT
//DD000208 DD  UNIT=(TAPE,59) UNIT
//DD000209 DD  UNIT=(3400-9,1) UNIT
//DD000210 DD  UNIT=(SYSALLDA,59) UNIT
//DD000211 DD  UNIT=(SYS3480R,1) UNIT
//DD000212 DD  UNIT=(SYS348XR,59) UNIT
//DD000213 DD  UNIT=(&UNIT,&COUNT) UNIT
//DD000214 DD  UNIT=(&UNIT&COUNT) UNIT
//DD000215 DD  UNIT=(&UNIT,1) UNIT
//DD000216 DD  UNIT=(&UNIT,&COUNT) UNIT
//DD000217 DD  UNIT=(001,&COUNT) UNIT
//DD000218 DD  UNIT=(00A,&COUNT) UNIT
//DD000219 DD  UNIT=(/001,&COUNT) UNIT
//DD000220 DD  UNIT=(/00A,&COUNT) UNIT
//DD000221 DD  UNIT=(/0001,&COUNT) UNIT
//DD000222 DD  UNIT=(/000A,&COUNT) UNIT
//DD000223 DD  UNIT=(3390,&COUNT) UNIT
//DD000224 DD  UNIT=(TAPE,&COUNT) UNIT
//DD000225 DD  UNIT=(3400-9,&COUNT) UNIT
//DD000226 DD  UNIT=(SYSALLDA,&COUNT) UNIT
//DD000227 DD  UNIT=(SYS3480R,&COUNT) UNIT
//DD000228 DD  UNIT=(SYS348XR,&COUNT) UNIT
//DD000229 DD  UNIT=(001,P) UNIT
//DD000230 DD  UNIT=(00A,P) UNIT
//DD000231 DD  UNIT=(/001,P) UNIT
//DD000232 DD  UNIT=(/00A,P) UNIT
//DD000233 DD  UNIT=(/0001,P) UNIT
//DD000234 DD  UNIT=(/000A,P) UNIT
//DD000235 DD  UNIT=(3390,P) UNIT
//DD000236 DD  UNIT=(TAPE,P) UNIT
//DD000237 DD  UNIT=(3400-9,P) UNIT
//DD000238 DD  UNIT=(SYSALLDA,P) UNIT
//DD000239 DD  UNIT=(SYS3480R,P) UNIT
//DD000240 DD  UNIT=(SYS348XR,P) UNIT
//DD000241 DD  UNIT=(&UNIT,P) UNIT
//DD000301 DD  UNIT=(001,1,DEFER) UNIT
//DD000302 DD  UNIT=(00A,59,DEFER) UNIT
//DD000303 DD  UNIT=(/001,1,DEFER) UNIT
//DD000304 DD  UNIT=(/00A,59,DEFER) UNIT
//DD000305 DD  UNIT=(/0001,1,DEFER) UNIT
//DD000306 DD  UNIT=(/000A,59,DEFER) UNIT
//DD000307 DD  UNIT=(3390,1,DEFER) UNIT
//DD000308 DD  UNIT=(TAPE,59,DEFER) UNIT
//DD000309 DD  UNIT=(3400-9,1,DEFER) UNIT
//DD000310 DD  UNIT=(SYSALLDA,59,DEFER) UNIT
//DD000311 DD  UNIT=(SYS3480R,1,DEFER) UNIT
//DD000312 DD  UNIT=(SYS348XR,59,DEFER) UNIT
//DD000313 DD  UNIT=(&UNIT,&COUNT,DEFER) UNIT
//DD000314 DD  UNIT=(&UNIT&COUNT,DEFER) UNIT
//DD000315 DD  UNIT=(&UNIT,1,DEFER) UNIT
//DD000316 DD  UNIT=(&UNIT,&COUNT,DEFER) UNIT
//DD000317 DD  UNIT=(001,&COUNT,DEFER) UNIT
//DD000318 DD  UNIT=(00A,&COUNT,DEFER) UNIT
//DD000319 DD  UNIT=(/001,&COUNT,DEFER) UNIT
//DD000320 DD  UNIT=(/00A,&COUNT,DEFER) UNIT
//DD000321 DD  UNIT=(/0001,&COUNT,DEFER) UNIT
//DD000322 DD  UNIT=(/000A,&COUNT,DEFER) UNIT
//DD000323 DD  UNIT=(3390,&COUNT,DEFER) UNIT
//DD000324 DD  UNIT=(TAPE,&COUNT,DEFER) UNIT
//DD000325 DD  UNIT=(3400-9,&COUNT,DEFER) UNIT
//DD000326 DD  UNIT=(SYSALLDA,&COUNT,DEFER) UNIT
//DD000327 DD  UNIT=(SYS3480R,&COUNT,DEFER) UNIT
//DD000328 DD  UNIT=(SYS348XR,&COUNT,DEFER) UNIT
//DD000329 DD  UNIT=(001,P,DEFER) UNIT
//DD000330 DD  UNIT=(00A,P,DEFER) UNIT
//DD000331 DD  UNIT=(/001,P,DEFER) UNIT
//DD000332 DD  UNIT=(/00A,P,DEFER) UNIT
//DD000333 DD  UNIT=(/0001,P,DEFER) UNIT
//DD000334 DD  UNIT=(/000A,P,DEFER) UNIT
//DD000335 DD  UNIT=(3390,P,DEFER) UNIT
//DD000336 DD  UNIT=(TAPE,P,DEFER) UNIT
//DD000337 DD  UNIT=(3400-9,P,DEFER) UNIT
//DD000338 DD  UNIT=(SYSALLDA,P,DEFER) UNIT
//DD000339 DD  UNIT=(SYS3480R,P,DEFER) UNIT
//DD000340 DD  UNIT=(SYS348XR,P,DEFER) UNIT
//DD000341 DD  UNIT=(&UNIT,P,DEFER) UNIT
//DD000342 DD  UNIT=(&UNIT&COUNT&DEFER) UNIT
//DD000401 DD  UNIT=(001,1,DEFER,SMSHONOR) UNIT
//DD000402 DD  UNIT=(00A,59,DEFER,SMSHONOR) UNIT
//DD000403 DD  UNIT=(/001,1,DEFER,SMSHONOR) UNIT
//DD000404 DD  UNIT=(/00A,59,DEFER,SMSHONOR) UNIT
//DD000405 DD  UNIT=(/0001,1,DEFER,SMSHONOR) UNIT
//DD000406 DD  UNIT=(/000A,59,DEFER,SMSHONOR) UNIT
//DD000407 DD  UNIT=(3390,1,DEFER,SMSHONOR) UNIT
//DD000408 DD  UNIT=(TAPE,59,DEFER,SMSHONOR) UNIT
//DD000409 DD  UNIT=(3400-9,1,DEFER,SMSHONOR) UNIT
//DD000410 DD  UNIT=(SYSALLDA,59,DEFER,SMSHONOR) UNIT
//DD000411 DD  UNIT=(SYS3480R,1,DEFER,SMSHONOR) UNIT
//DD000412 DD  UNIT=(SYS348XR,59,DEFER,SMSHONOR) UNIT
//DD000413 DD  UNIT=(&UNIT,&COUNT,DEFER,SMSHONOR) UNIT
//DD000414 DD  UNIT=(&UNIT&COUNT,DEFER,SMSHONOR) UNIT
//DD000415 DD  UNIT=(&UNIT,1,DEFER,SMSHONOR) UNIT
//DD000416 DD  UNIT=(&UNIT,&COUNT,DEFER,SMSHONOR) UNIT
//DD000417 DD  UNIT=(001,&COUNT,DEFER,SMSHONOR) UNIT
//DD000418 DD  UNIT=(00A,&COUNT,DEFER,SMSHONOR) UNIT
//DD000419 DD  UNIT=(/001,&COUNT,DEFER,SMSHONOR) UNIT
//DD000420 DD  UNIT=(/00A,&COUNT,DEFER,SMSHONOR) UNIT
//DD000421 DD  UNIT=(/0001,&COUNT,DEFER,SMSHONOR) UNIT
//DD000422 DD  UNIT=(/000A,&COUNT,DEFER,SMSHONOR) UNIT
//DD000423 DD  UNIT=(3390,&COUNT,DEFER,SMSHONOR) UNIT
//DD000424 DD  UNIT=(TAPE,&COUNT,DEFER,SMSHONOR) UNIT
//DD000425 DD  UNIT=(3400-9,&COUNT,DEFER,SMSHONOR) UNIT
//DD000426 DD  UNIT=(SYSALLDA,&COUNT,DEFER,SMSHONOR) UNIT
//DD000427 DD  UNIT=(SYS3480R,&COUNT,DEFER,SMSHONOR) UNIT
//DD000428 DD  UNIT=(SYS348XR,&COUNT,DEFER,SMSHONOR) UNIT
//DD000429 DD  UNIT=(001,P,DEFER,SMSHONOR) UNIT
//DD000430 DD  UNIT=(00A,P,DEFER,SMSHONOR) UNIT
//DD000431 DD  UNIT=(/001,P,DEFER,SMSHONOR) UNIT
//DD000432 DD  UNIT=(/00A,P,DEFER,SMSHONOR) UNIT
//DD000433 DD  UNIT=(/0001,P,DEFER,SMSHONOR) UNIT
//DD000434 DD  UNIT=(/000A,P,DEFER,SMSHONOR) UNIT
//DD000435 DD  UNIT=(3390,P,DEFER,SMSHONOR) UNIT
//DD000436 DD  UNIT=(TAPE,P,DEFER,SMSHONOR) UNIT
//DD000437 DD  UNIT=(3400-9,P,DEFER,SMSHONOR) UNIT
//DD000438 DD  UNIT=(SYSALLDA,P,DEFER,SMSHONOR) UNIT
//DD000439 DD  UNIT=(SYS3480R,P,DEFER,SMSHONOR) UNIT
//DD000440 DD  UNIT=(SYS348XR,P,DEFER,SMSHONOR) UNIT
//DD000441 DD  UNIT=(&UNIT,P,DEFER,SMSHONOR) UNIT
//DD000442 DD  UNIT=(&UNIT&COUNT,DEFER,SMSHONOR) UNIT
//DD000443 DD  UNIT=(&UNIT&COUNT&DEFER,SMSHONOR) UNIT
//DD000444 DD  UNIT=(&UNIT&COUNT&DEFER&SMSHONOR) UNIT
//DD000501 DD  UNIT=(001,1,,SMSHONOR) UNIT
//DD000502 DD  UNIT=(00A,59,,SMSHONOR) UNIT
//DD000503 DD  UNIT=(/001,1,,SMSHONOR) UNIT
//DD000504 DD  UNIT=(/00A,59,,SMSHONOR) UNIT
//DD000505 DD  UNIT=(/0001,1,,SMSHONOR) UNIT
//DD000506 DD  UNIT=(/000A,59,,SMSHONOR) UNIT
//DD000507 DD  UNIT=(3390,1,,SMSHONOR) UNIT
//DD000508 DD  UNIT=(TAPE,59,,SMSHONOR) UNIT
//DD000509 DD  UNIT=(3400-9,1,,SMSHONOR) UNIT
//DD000510 DD  UNIT=(SYSALLDA,59,,SMSHONOR) UNIT
//DD000511 DD  UNIT=(SYS3480R,1,,SMSHONOR) UNIT
//DD000512 DD  UNIT=(SYS348XR,59,,SMSHONOR) UNIT
//DD000513 DD  UNIT=(&UNIT,&COUNT,,SMSHONOR) UNIT
//DD000514 DD  UNIT=(&UNIT&COUNT,,SMSHONOR) UNIT
//DD000515 DD  UNIT=(&UNIT,1,,SMSHONOR) UNIT
//DD000516 DD  UNIT=(&UNIT,&COUNT,,SMSHONOR) UNIT
//DD000517 DD  UNIT=(001,&COUNT,,SMSHONOR) UNIT
//DD000518 DD  UNIT=(00A,&COUNT,,SMSHONOR) UNIT
//DD000519 DD  UNIT=(/001,&COUNT,,SMSHONOR) UNIT
//DD000520 DD  UNIT=(/00A,&COUNT,,SMSHONOR) UNIT
//DD000521 DD  UNIT=(/0001,&COUNT,,SMSHONOR) UNIT
//DD000522 DD  UNIT=(/000A,&COUNT,,SMSHONOR) UNIT
//DD000523 DD  UNIT=(3390,&COUNT,,SMSHONOR) UNIT
//DD000524 DD  UNIT=(TAPE,&COUNT,,SMSHONOR) UNIT
//DD000525 DD  UNIT=(3400-9,&COUNT,,SMSHONOR) UNIT
//DD000526 DD  UNIT=(SYSALLDA,&COUNT,,SMSHONOR) UNIT
//DD000527 DD  UNIT=(SYS3480R,&COUNT,,SMSHONOR) UNIT
//DD000528 DD  UNIT=(SYS348XR,&COUNT,,SMSHONOR) UNIT
//DD000529 DD  UNIT=(001,P,,SMSHONOR) UNIT
//DD000530 DD  UNIT=(00A,P,,SMSHONOR) UNIT
//DD000531 DD  UNIT=(/001,P,,SMSHONOR) UNIT
//DD000532 DD  UNIT=(/00A,P,,SMSHONOR) UNIT
//DD000533 DD  UNIT=(/0001,P,,SMSHONOR) UNIT
//DD000534 DD  UNIT=(/000A,P,,SMSHONOR) UNIT
//DD000535 DD  UNIT=(3390,P,,SMSHONOR) UNIT
//DD000536 DD  UNIT=(TAPE,P,,SMSHONOR) UNIT
//DD000537 DD  UNIT=(3400-9,P,,SMSHONOR) UNIT
//DD000538 DD  UNIT=(SYSALLDA,P,,SMSHONOR) UNIT
//DD000539 DD  UNIT=(SYS3480R,P,,SMSHONOR) UNIT
//DD000540 DD  UNIT=(SYS348XR,P,,SMSHONOR) UNIT
//DD000541 DD  UNIT=(&UNIT,P,,SMSHONOR) UNIT
//DD000542 DD  UNIT=(&UNIT&COUNT,,SMSHONOR) UNIT
//DD000601 DD  UNIT=(001,,DEFER,SMSHONOR) UNIT
//DD000602 DD  UNIT=(00A,,DEFER,SMSHONOR) UNIT
//DD000603 DD  UNIT=(/001,,DEFER,SMSHONOR) UNIT
//DD000604 DD  UNIT=(/00A,,DEFER,SMSHONOR) UNIT
//DD000605 DD  UNIT=(/0001,,DEFER,SMSHONOR) UNIT
//DD000606 DD  UNIT=(/000A,,DEFER,SMSHONOR) UNIT
//DD000607 DD  UNIT=(3390,,DEFER,SMSHONOR) UNIT
//DD000608 DD  UNIT=(TAPE,,DEFER,SMSHONOR) UNIT
//DD000609 DD  UNIT=(3400-9,,DEFER,SMSHONOR) UNIT
//DD000610 DD  UNIT=(SYSALLDA,,DEFER,SMSHONOR) UNIT
//DD000611 DD  UNIT=(SYS3480R,,DEFER,SMSHONOR) UNIT
//DD000612 DD  UNIT=(SYS348XR,,DEFER,SMSHONOR) UNIT
//DD000613 DD  UNIT=(&UNIT,,DEFER,SMSHONOR) UNIT
//DD000614 DD  UNIT=(&UNIT,,&DEFER,SMSHONOR) UNIT
//DD000615 DD  UNIT=(&UNIT,,DEFER,&SMSHONOR) UNIT
//DD000616 DD  UNIT=(&UNIT,,&DEFER,&SMSHONOR) UNIT
//DD000617 DD  UNIT=(&UNIT,,&DEFER&SMSHONOR) UNIT
//DD000701 DD  UNIT=(001,,,SMSHONOR) UNIT
//DD000702 DD  UNIT=(00A,,,SMSHONOR) UNIT
//DD000703 DD  UNIT=(/001,,,SMSHONOR) UNIT
//DD000704 DD  UNIT=(/00A,,,SMSHONOR) UNIT
//DD000705 DD  UNIT=(/0001,,,SMSHONOR) UNIT
//DD000706 DD  UNIT=(/000A,,,SMSHONOR) UNIT
//DD000707 DD  UNIT=(3390,,,SMSHONOR) UNIT
//DD000708 DD  UNIT=(TAPE,,,SMSHONOR) UNIT
//DD000709 DD  UNIT=(3400-9,,,SMSHONOR) UNIT
//DD000710 DD  UNIT=(SYSALLDA,,,SMSHONOR) UNIT
//DD000711 DD  UNIT=(SYS3480R,,,SMSHONOR) UNIT
//DD000712 DD  UNIT=(SYS348XR,,,SMSHONOR) UNIT
//DD000713 DD  UNIT=(&UNIT,,,SMSHONOR) UNIT
//DD000714 DD  UNIT=(,,,SMSHONOR) UNIT
//DD000801 DD  UNIT=(001,,DEFER) UNIT
//DD000802 DD  UNIT=(00A,,DEFER) UNIT
//DD000803 DD  UNIT=(/001,,DEFER) UNIT
//DD000804 DD  UNIT=(/00A,,DEFER) UNIT
//DD000805 DD  UNIT=(/0001,,DEFER) UNIT
//DD000806 DD  UNIT=(/000A,,DEFER) UNIT
//DD000807 DD  UNIT=(3390,,DEFER) UNIT
//DD000808 DD  UNIT=(TAPE,,DEFER) UNIT
//DD000809 DD  UNIT=(3400-9,,DEFER) UNIT
//DD000810 DD  UNIT=(SYSALLDA,,DEFER) UNIT
//DD000811 DD  UNIT=(SYS3480R,,DEFER) UNIT
//DD000812 DD  UNIT=(SYS348XR,,DEFER) UNIT
//DD000813 DD  UNIT=(&UNIT,,DEFER) UNIT
//DD000814 DD  UNIT=(&UNIT,,&DEFER) UNIT
//DD000815 DD  UNIT=(,1,DEFER) UNIT
//DD000816 DD  UNIT=(,59,DEFER) UNIT
//DD000817 DD  UNIT=(,1,&DEFER) UNIT
//DD000818 DD  UNIT=(,59,&DEFER) UNIT
//DD000819 DD  UNIT=(,,DEFER) UNIT
//DD000820 DD  UNIT=(,,&DEFER) UNIT
//DD000821 DD  UNIT=(,1) UNIT
//DD000822 DD  UNIT=(,&COUNT) UNIT

