//SET JOB
//*
// SET A=1
// SET B=A
// SET C=3,D=4
// SET E=@,
//     F=#,
//     G=$
// SET H='AEIOU AND SOMETIMES W IN WALES'
// SET I=
//*
// EXEC PGM=IEFBR14
//*
// SET A=1 comment
// SET B=A comment
// SET C=3,D=4 comment
// SET E=@, comment
//     F=#, comment
//     G=$ comment
// SET H='AEIOU AND SOMETIMES W IN WALES' comment
// SET I= comment
//*
// EXEC PGM=IEFBR14 comment
