//AEIOU JOB
//*
//STEP001  EXEC PGM=IEFBR14,MEMLIMIT=1M
//STEP002  EXEC PGM=IEFBR14,MEMLIMIT=1G
//STEP002A EXEC PGM=IEFBR14,MEMLIMIT=1T
//STEP002B EXEC PGM=IEFBR14,MEMLIMIT=1P
//STEP002C EXEC PGM=IEFBR14,MEMLIMIT=NOLIMIT
//STEP002D EXEC PGM=IEFBR14,MEMLIMIT=&MEMLIM
//STEP002E EXEC PGM=IEFBR14,MEMLIMIT=10M
//STEP002F EXEC PGM=IEFBR14,MEMLIMIT=100M
//STEP002G EXEC PGM=IEFBR14,MEMLIMIT=1000M        1G
//STEP002H EXEC PGM=IEFBR14,MEMLIMIT=10000M
//STEP002A EXEC PGM=IEFBR14,MEMLIMIT=100000M
//STEP002A EXEC PGM=IEFBR14,MEMLIMIT=1000000M     1T
//STEP002A EXEC PGM=IEFBR14,MEMLIMIT=10000000M
//STEP002A EXEC PGM=IEFBR14,MEMLIMIT=100000000M
//STEP002A EXEC PGM=IEFBR14,MEMLIMIT=1000000000M  1P
//STEP002A EXEC PGM=IEFBR14,MEMLIMIT=&MEM&MEMUNIT
