//EDSEL JOB
//*
//STEP001  EXEC PGM=IEFBR14,ACCT=A
//STEP002  EXEC PGM=IEFBR14,PARM=X,ACCT='A'
//STEP002A EXEC PGM=IEFBR14,PARM=XX,ACCT=(A)
//STEP002B EXEC PGM=IEFBR14,PARM=1,ACCT=('A')
//STEP002C EXEC PGM=IEFBR14,PARM=12,ACCT=(A,B)
//STEP002D EXEC PGM=IEFBR14,PARM=#,ACCT=('A',B)
//STEP002E EXEC PGM=IEFBR14,PARM=#$,ACCT=(A,'B')
//STEP002F EXEC PGM=IEFBR14,PARM=X1,ACCT=A1
//STEP002G EXEC PGM=IEFBR14,PARM=XX1,ACCT='A1'
//STEP002H EXEC PGM=IEFBR14,PARM=XX11,ACCT=(A1)
//STEP002I EXEC PGM=IEFBR14,PARM=1X,ACCT=('A1')
//STEP002J EXEC PGM=IEFBR14,PARM=11X,ACCT=(A1,B2)
//STEP002K EXEC PGM=IEFBR14,PARM=11XX,ACCT=('A1',B2)
//STEP002L EXEC PGM=IEFBR14,PARM=X@,ACCT=(A1,'B2')
//STEP002M EXEC PGM=IEFBR14,PARM=XX@,ACCT=('A1','B2')
//STEP002N EXEC PGM=IEFBR14,PARM=XX@@,ACCT='A1$'
//STEP002O EXEC PGM=IEFBR14,PARM=1@,ACCT=('A1$')
//STEP002P EXEC PGM=IEFBR14,PARM=11@,ACCT=('A1$','B2+')
//STEP002Q EXEC PGM=IEFBR14,PARM=11@,ACCT=(&A1,'B2+')
//STEP002R EXEC PGM=IEFBR14,PARM=11@,ACCT=(&A1&A2,'B2+')
//STEP002S EXEC PGM=IEFBR14,PARM=11@,ACCT=(&A1&A2,&B1&B2)
//STEP003  EXEC PROC=IAYEBR14,PARM.STEPA=11@@,ACCT.STEPA=A1
//STEP003  EXEC PROC=IAYEBR14,PARM.STEPA=11@@,ACCT.STEPA=A1
//STEP004  EXEC PROC=IAYEBR14,PARM.STEPB='A1@/STGRPT(ON)',
// ACCT.STEPA='A1',ACCT.STEPB=('A1','B2-')
//STEP005  EXEC IAYEBR14, exec
// PARM.STEPA=&A, parm
// ACCT.STEPA=A1, acctA
// ACCT.STEPB=('A1+','B2(1)') acctB
//STEP006  EXEC PGM=IEFBR14,PARM=&AB
//STEP007  EXEC PGM=IEFBR14,PARM=&A.1
//STEP008  EXEC PGM=IEFBR14,PARM=ZZ&A
//STEP009  EXEC PGM=IEFBR14,PARM=ZZ&A.1
//STEP010  EXEC PGM=IEFBR14,PARM='AND A ONE AND A TWO AND
//       A THREE AND A FOUR'
//STEP011  EXEC PGM=IEFBR14,PARM=(A,B,C,D,E,F,G)
//STEP012  EXEC PGM=IEFBR14,PARM=(A,              PARM 1
//  B,                                            PARM 2
//    C,                                          PARM 3
// D,                                             PARM 4
//         E,                                     PARM 5
//      F,                                        PARM 6
//        G)                                      PARM 7
//STEP013  EXEC PGM=IEFBR14,
// PARM=(A,
// B,
// C,
// D,
// E,F,
//         G)
//STEP014  EXEC PGM=IEFBR14,PARM=('ABC',&A,7,'BLAH
//  BLAH BLAH')
//STEP015  EXEC PGM=IEFBR14,PARM=X moo
