//PATHMODE JOB
//*
//STEP0001 EXEC PGM=BPXBATCH
//DD000001 DD  PATHMODE=SIRUSR
//DD000002 DD  PATHMODE=SIWUSR
//DD000003 DD  PATHMODE=SIXUSR
//DD000004 DD  PATHMODE=SIRWXU
//DD000005 DD  PATHMODE=SIRGRP
//DD000006 DD  PATHMODE=SIWGRP
//DD000007 DD  PATHMODE=SIXGRP
//DD000008 DD  PATHMODE=SIRWXG
//DD000009 DD  PATHMODE=SIROTH
//DD000010 DD  PATHMODE=SIWOTH
//DD000011 DD  PATHMODE=SIXOTH
//DD000012 DD  PATHMODE=SIRWXO
//DD000013 DD  PATHMODE=SISUID
//DD000014 DD  PATHMODE=SISGID
//DD000101 DD  PATHMODE=(SIRUSR,SIWUSR)
//DD000102 DD  PATHMODE=(SIWUSR,SIXUSR)
//DD000103 DD  PATHMODE=(SIXUSR,SIRWXU)
//DD000104 DD  PATHMODE=(SIRWXU,SIRUSR)
//DD000105 DD  PATHMODE=(SIRGRP,SIWGRP)
//DD000106 DD  PATHMODE=(SIWGRP,SIXGRP)
//DD000107 DD  PATHMODE=(SIXGRP,SIRWXG)
//DD000108 DD  PATHMODE=(SIRWXG,SIRGRP)
//DD000109 DD  PATHMODE=(SIROTH,SIWOTH)
//DD000110 DD  PATHMODE=(SIWOTH,SIXOTH)
//DD000111 DD  PATHMODE=(SIXOTH,SIRWXO)
//DD000112 DD  PATHMODE=(SIRWXO,SIROTH)
//DD000113 DD  PATHMODE=(SISUID,SISGID)
//DD000114 DD  PATHMODE=(SISGID,SISUID)
//DD000201 DD  PATHMODE=(SIRUSR,
//            SIWUSR,
//            SIXUSR,
//            SIRWXU,
//            SIRGRP,
//            SIWGRP,
//            SIXGRP,
//            SIROTH,
//            SIWOTH,
//            SIXOTH,
//            SISUID,
//            SISGID)
//DD000202 DD  PATHMODE=(SIRUSR,SIWUSR,SIXUSR,SIRWXU,SIRGRP,SIWGRP,
//            SIXGRP,SIROTH,SIWOTH,SIXOTH,SISUID,SISGID)
//DD000301 DD  PATHMODE=SIRUSR PATHMODE
//DD000302 DD  PATHMODE=SIWUSR PATHMODE
//DD000303 DD  PATHMODE=SIXUSR PATHMODE
//DD000304 DD  PATHMODE=SIRWXU PATHMODE
//DD000305 DD  PATHMODE=SIRGRP PATHMODE
//DD000306 DD  PATHMODE=SIWGRP PATHMODE
//DD000307 DD  PATHMODE=SIXGRP PATHMODE
//DD000308 DD  PATHMODE=SIRWXG PATHMODE
//DD000309 DD  PATHMODE=SIROTH PATHMODE
//DD000310 DD  PATHMODE=SIWOTH PATHMODE
//DD000311 DD  PATHMODE=SIXOTH PATHMODE
//DD000312 DD  PATHMODE=SIRWXO PATHMODE
//DD000313 DD  PATHMODE=SISUID PATHMODE
//DD000314 DD  PATHMODE=SISGID PATHMODE
//DD000401 DD  PATHMODE=(SIRUSR,SIWUSR) PATHMODE
//DD000402 DD  PATHMODE=(SIWUSR,SIXUSR) PATHMODE
//DD000403 DD  PATHMODE=(SIXUSR,SIRWXU) PATHMODE
//DD000404 DD  PATHMODE=(SIRWXU,SIRUSR) PATHMODE
//DD000405 DD  PATHMODE=(SIRGRP,SIWGRP) PATHMODE
//DD000406 DD  PATHMODE=(SIWGRP,SIXGRP) PATHMODE
//DD000407 DD  PATHMODE=(SIXGRP,SIRWXG) PATHMODE
//DD000408 DD  PATHMODE=(SIRWXG,SIRGRP) PATHMODE
//DD000409 DD  PATHMODE=(SIROTH,SIWOTH) PATHMODE
//DD000410 DD  PATHMODE=(SIWOTH,SIXOTH) PATHMODE
//DD000411 DD  PATHMODE=(SIXOTH,SIRWXO) PATHMODE
//DD000412 DD  PATHMODE=(SIRWXO,SIROTH) PATHMODE
//DD000413 DD  PATHMODE=(SISUID,SISGID) PATHMODE
//DD000414 DD  PATHMODE=(SISGID,SISUID) PATHMODE
//DD000501 DD  PATHMODE=(SIRUSR, PATHMODE
//            SIWUSR, PATHMODE
//            SIXUSR, PATHMODE
//            SIRWXU, PATHMODE
//            SIRGRP, PATHMODE
//            SIWGRP, PATHMODE
//            SIXGRP, PATHMODE
//            SIROTH, PATHMODE
//            SIWOTH, PATHMODE
//            SIXOTH, PATHMODE
//            SISUID, PATHMODE
//            SISGID) PATHMODE
//DD000502 DD  PATHMODE=(SIRUSR,SIWUSR,SIXUSR,SIRWXU,SIRGRP,SIWGRP,
//            SIXGRP,SIROTH,SIWOTH,SIXOTH,SISUID,SISGID) PATHMODE

