//PATH JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  PATH=A
//DD000002 DD  PATH=1
//DD000004 DD  PATH=@
//DD000005 DD  PATH=/A
//DD000006 DD  PATH=/1
//DD000007 DD  PATH=/@
//DD000008 DD  PATH=A1
//DD000009 DD  PATH=1@
//DD000010 DD  PATH=@A
//DD000011 DD  PATH=A1#
//DD000012 DD  PATH=1$A
//DD000013 DD  PATH=@A1
//DD000014 DD  PATH=/A1
//DD000015 DD  PATH=/1@
//DD000016 DD  PATH=/@A
//DD000017 DD  PATH=/A1#
//DD000018 DD  PATH=/1$A
//DD000019 DD  PATH=/@/A/1
//DD000020 DD  PATH=/A/1/#
//DD000021 DD  PATH=/1/$/A
//DD000022 DD  PATH=/@/A/1
//DD000023 DD  PATH='any old text here'
//DD000024 DD  PATH='and any old text to be
//           continued here'
//DD000025 DD  PATH='documentation says the PATH parameter can
// be up to 255 characters in length
// which is unwieldy at best'
//DD000026 DD  PATH=/&PATH/&PATHA/&PATHB/&PATHC
//DD000027 DD  PATH=/ABC&PATH/123&PATHA.2&PATHB+3/-&PATHC-*
//DD000101 DD  PATH=A PATH
//DD000102 DD  PATH=1 PATH
//DD000104 DD  PATH=@ PATH
//DD000105 DD  PATH=/A PATH
//DD000106 DD  PATH=/1 PATH
//DD000107 DD  PATH=/@ PATH
//DD000108 DD  PATH=A1 PATH
//DD000109 DD  PATH=1@ PATH
//DD000110 DD  PATH=@A PATH
//DD000111 DD  PATH=A1# PATH
//DD000112 DD  PATH=1$A PATH
//DD000113 DD  PATH=@A1 PATH
//DD000114 DD  PATH=/A1 PATH
//DD000115 DD  PATH=/1@ PATH
//DD000116 DD  PATH=/@A PATH
//DD000117 DD  PATH=/A1# PATH
//DD000118 DD  PATH=/1$A PATH
//DD000119 DD  PATH=/@/A/1 PATH
//DD000120 DD  PATH=/A/1/# PATH
//DD000121 DD  PATH=/1/$/A PATH
//DD000122 DD  PATH=/@/A/1 PATH
//DD000123 DD  PATH='any old text here' PATH
//DD000124 DD  PATH='and any old text to be
//           continued here' PATH
//DD000125 DD  PATH='documentation says the PATH parameter can
// be up to 255 characters in length
// which is unwieldy at best' PATH
//DD000126 DD  PATH=/&PATH/&PATHA/&PATHB/&PATHC PATH
//DD000127 DD  PATH=/ABC&PATH/123&PATHA.2&PATHB+3/-&PATHC-* PATH

