//SCHEDULE JOB
//*
//SCHEDULE SCHEDULE
//*
//NOTHING  EXEC PGM=IEFBR14
//*
//$CHEDULE JOB
//*
//SCHEDULE SCHEDULE AFTER=SCHEDULE comment
//*
//NOTHING  EXEC PGM=IEFBR14
//*
//JOB001 JOB
//*
// SCHEDULE AFTER=$CHEDULE,BEFORE=JOB002 comment
//*
// EXEC PGM=IEFBR14
//*
//JOB002 JOB
// SCHEDULE AFTER=$CHEDULE,BEFORE=JOB003, comment
// HOLDUNTIL=('17:00',04/01/2016) comment
//*
//*
// EXEC PGM=IEFBR14
//*
//JOB003 JOB
//JOB003S SCHEDULE HOLDUNTIL=2114/025 comment
//*
// EXEC PGM=IEFBR14
//*
//JOB004 JOB
// SCHEDULE DELAY=Y,WITH=JOB002 comment
//*
// EXEC PGM=IEFBR14
//*
//JOB005 JOB
// SCHEDULE JOBGROUP=AEIOU comment
//*
// EXEC PGM=IEFBR14
//*
//JOB006 JOB
// SCHEDULE JOBGROUP=AEIOU.EGBDF comment
//*
// EXEC PGM=IEFBR14
//*
//JOB007 JOB
// SCHEDULE STARTBY='21:21', comment
// DELAY=YES, comment
// HOLDUNTIL='21:20', comment
// AFTER=$CHEDULE comment
//*
// EXEC PGM=IEFBR14
//*

