//OUTPUT JOB
//*
//@0000001 OUTPUT ADDRESS='1234 Triskelion'
//@0000002 OUTPUT ADDRESS=('1234 Triskelion')
//@0000003 OUTPUT ADDRESS=ENTERPRISE
//@0000004 OUTPUT ADDRESS=(ENTERPRISE)
//@0000005 OUTPUT ADDRESS=('1234 Triskelion','Gamester Way')
//@0000006 OUTPUT ADDRESS=('The old house at the end of the lane',
//             'With no windows','and no doors save for the one',
//             'leading into the cellar from which no one returns')
//@0000007 OUTPUT AFPPARMS=PROD.SYS.AFPPARMS
//@0000008 OUTPUT AFPPARMS=&DSNHLQ..AFPPARMS
//@0000009 OUTPUT AFPSTATS=YES
//@0000010 OUTPUT AFPSTATS=Y
//@0000011 OUTPUT AFPSTATS=NO
//@0000012 OUTPUT AFPSTATS=N
//@0000013 OUTPUT AFPSTATS=&AFPSTATS
//@0000014 OUTPUT BUILDING=/-+&*.ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789
//@0000015 OUTPUT BUILDING='/-+&*.ABCDEFGHIJKLMNOPQRSTUVWXYZ01234567'
//@0000016 OUTPUT BUILDING='O''Brian Center for Science'
//@0000017 OUTPUT BUILDING=&BUILDING
//@0000018 OUTPUT BURST=YES
//@0000019 OUTPUT BURST=Y
//@0000020 OUTPUT BURST=NO
//@0000021 OUTPUT BURST=N
//@0000022 OUTPUT BURST=&BURST
//@0000023 OUTPUT CHARS=STD
//@0000024 OUTPUT CHARS=DUMP
//@0000025 OUTPUT CHARS=@#$1
//@0000026 OUTPUT CHARS=A
//@0000027 OUTPUT CHARS=A1
//@0000028 OUTPUT CHARS=A#1
//@0000029 OUTPUT CHARS=(A,B,C,D)
//@0000030 OUTPUT CHARS=(DUMP,1,2,3)
//@0000031 OUTPUT CHARS=(DUMP,STD)
//@0000032 OUTPUT CHARS=(STD)
//@0000033 OUTPUT CHARS=(DUMP)
//@0000034 OUTPUT CHARS=(@#$1)
//@0000035 OUTPUT CHARS=(A)
//@0000036 OUTPUT CHARS=(A1)
//@0000037 OUTPUT CHARS=(A#1)
//@0000038 OUTPUT CHARS=&CHARS
//@0000039 OUTPUT CHARS=(&CHARS1,&CHARS2,&CHARS3,&CHARS4)
//@0000040 OUTPUT CKPTLINE=1
//@0000041 OUTPUT CKPTLINE=32767
//@0000042 OUTPUT CKPTLINE=&CKPTLINE
//@0000043 OUTPUT CKPTPAGE=1
//@0000044 OUTPUT CKPTPAGE=32767
//@0000045 OUTPUT CKPTPAGE=&CKPTPAGE
//@0000046 OUTPUT CKPTSEC=1
//@0000047 OUTPUT CKPTSEC=32767
//@0000048 OUTPUT CKPTSEC=&CKPTSEC
//@0000049 OUTPUT CLASS=A
//@0000050 OUTPUT CLASS=0
//@0000051 OUTPUT CLASS=*
//@0000052 OUTPUT CLASS='B'
//@0000053 OUTPUT CLASS='9'
//@0000054 OUTPUT CLASS='*'
//@0000055 OUTPUT CLASS=
//@0000056 OUTPUT CLASS=&CLASS
//@0000057 OUTPUT COLORMAP=A
//@0000058 OUTPUT COLORMAP=$
//@0000059 OUTPUT COLORMAP=#0000001
//@0000060 OUTPUT COLORMAP=&COLORMAP
//@0000061 OUTPUT COMSETUP=A
//@0000062 OUTPUT COMSETUP=@
//@0000063 OUTPUT COMSETUP=A1
//@0000064 OUTPUT COMSETUP=#1
//@0000065 OUTPUT COMSETUP=$#@123XY
//@0000066 OUTPUT COMSETUP=&COMSETUP
//@0000067 OUTPUT CONTROL=PROGRAM
//@0000068 OUTPUT CONTROL=SINGLE
//@0000069 OUTPUT CONTROL=DOUBLE
//@0000070 OUTPUT CONTROL=TRIPLE
//@0000071 OUTPUT CONTROL=&CONTROL
//@0000072 OUTPUT COPIES=5
//@0000073 OUTPUT COPIES=(5)
//@0000074 OUTPUT COPIES=&COPIES
//@0000075 OUTPUT COPIES=(&COPIES)
//@0000076 OUTPUT COPIES=(5,(2,3))
//@0000077 OUTPUT COPIES=(255,(255,255,255,255,255,255,255,255))
//@0000078 OUTPUT COPIES=(&COPIES,(&G1,&G2,&G3))
//@0000079 OUTPUT COPIES=(,(77))
//@0000080 OUTPUT COPIES=(,(1,2,3,4))
//@0000081 OUTPUT COPYCNT=1
//@0000082 OUTPUT COPYCNT=2147483647
//@0000083 OUTPUT COPYCNT=&COPYCNT
//@0000084 OUTPUT DATACK=BLOCK
//@0000085 OUTPUT DATACK=UNBLOCK
//@0000086 OUTPUT DATACK=BLKCHAR
//@0000087 OUTPUT DATACK=BLKPOS
//@0000088 OUTPUT DATACK=&DATACK
//@0000089 OUTPUT DDNAME=DDNAME
//@0000090 OUTPUT DDNAME=JSTEP.DDNAME
//@0000091 OUTPUT DDNAME=PSTEP.DDNAME
//@0000092 OUTPUT DDNAME=JSTEP.PSTEP.DDNAME
//@0000093 OUTPUT DDNAME=&DDNAME
//@0000094 OUTPUT DEFAULT=YES
//@0000095 OUTPUT DEFAULT=Y
//@0000096 OUTPUT DEFAULT=NO
//@0000097 OUTPUT DEFAULT=N
//@0000098 OUTPUT DEFAULT=&DEFAULT
//@0000099 OUTPUT DEPT=/-+&*.ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789
//@0000100 OUTPUT DEPT='Department of Silly Test Cases'
//@0000101 OUTPUT DEPT=&DEPT
//@0000102 OUTPUT DEST=LOCAL
//@0000103 OUTPUT DEST=ANYLOCAL
//@0000104 OUTPUT DEST=RMT17
//@0000105 OUTPUT DEST=N12345
//@0000106 OUTPUT DEST=N1R12345
//@0000107 OUTPUT DEST=N12R1234
//@0000108 OUTPUT DEST=N123R123
//@0000109 OUTPUT DEST=N1234R12
//@0000110 OUTPUT DEST=N12345R1
//@0000111 OUTPUT DEST=(LONDON.CICSUSR)
//@0000112 OUTPUT DEST=U1
//@0000113 OUTPUT DEST=CSCHNEID
//@0000114 OUTPUT DEST=&DEST
//@0000115 OUTPUT DEST=(&NODE.&USER)
//@0000116 OUTPUT DPAGELBL=YES
//@0000117 OUTPUT DPAGELBL=Y
//@0000118 OUTPUT DPAGELBL=NO
//@0000119 OUTPUT DPAGELBL=N
//@0000120 OUTPUT DPAGELBL=&DPAGELBL
//@0000121 OUTPUT DUPLEX=NO
//@0000122 OUTPUT DUPLEX=N
//@0000123 OUTPUT DUPLEX=NORMAL
//@0000124 OUTPUT DUPLEX=TUMBLE
//@0000125 OUTPUT DUPLEX=&DUPLEX
//@0000126 OUTPUT FCB=STD
//@0000127 OUTPUT FCB=1234
//@0000128 OUTPUT FCB=A
//@0000129 OUTPUT FCB=$
//@0000130 OUTPUT FCB=ABCD
//@0000131 OUTPUT FCB=$$$$
//@0000132 OUTPUT FCB=&FCB
//@0000133 OUTPUT FLASH=STD
//@0000134 OUTPUT FLASH=NONE
//@0000135 OUTPUT FLASH=1
//@0000136 OUTPUT FLASH=A
//@0000137 OUTPUT FLASH=$
//@0000138 OUTPUT FLASH=(,255)
//@0000139 OUTPUT FLASH=($$,255)
//@0000140 OUTPUT FLASH=&FLASH
//@0000141 OUTPUT FLASH=(&OVERLAY,&COUNT)
//@0000142 OUTPUT FORMDEF=1
//@0000143 OUTPUT FORMDEF=A
//@0000144 OUTPUT FORMDEF=#
//@0000145 OUTPUT FORMDEF=&FORMDEF
//@0000146 OUTPUT FORMLEN=1IN
//@0000147 OUTPUT FORMLEN=1CM
//@0000148 OUTPUT FORMLEN=1.1IN
//@0000149 OUTPUT FORMLEN=1.001CM
//@0000150 OUTPUT FORMLEN=&FORMLEN
//@0000151 OUTPUT FORMS=@001$002
//@0000152 OUTPUT FORMS=&FORMS
//@0000153 OUTPUT FSSDATA=A1@.+-/
//@0000154 OUTPUT FSSDATA='ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890'
//@0000155 OUTPUT FSSDATA=&FSSDATA
//@0000156 OUTPUT GROUPID=A
//@0000157 OUTPUT GROUPID=&GROUPID
//@0000158 OUTPUT INDEX=1
//@0000159 OUTPUT INDEX=&INDEX
//@0000160 OUTPUT INTRAY=1
//@0000161 OUTPUT INTRAY=&INTRAY
//@0000162 OUTPUT JESDS=ALL
//@0000163 OUTPUT JESDS=JCL
//@0000164 OUTPUT JESDS=LOG
//@0000165 OUTPUT JESDS=MSG
//@0000166 OUTPUT JESDS=&JESDS
//@0000167 OUTPUT LINDEX=1
//@0000168 OUTPUT LINDEX=&LINDEX
//@0000169 OUTPUT LINECT=1
//@0000170 OUTPUT LINECT=&LINECT
//@0000171 OUTPUT MAILBCC=ABC@EXAMPLE.COM
//@0000172 OUTPUT MAILBCC=(ABC@EXAMPLE.COM)
//@0000173 OUTPUT MAILBCC=(ABC@EXAMPLE.COM,DEF@EXAMPLE.COM)
//@0000174 OUTPUT MAILBCC='abc@example.com'
//@0000175 OUTPUT MAILBCC=('abc@example.com')
//@0000176 OUTPUT MAILBCC=('abc@example.com','def@example.com')
//@0000177 OUTPUT MAILBCC=(QUENTIN.COLDWATER@EXAMPLE.COM,
//             ALICE.QUINN@EXAMPLE.COM,
//             JULIA.WICKER@EXAMPLE.COM,
//             ELIOT.WAUGH@EXAMPLE.COM,
//             MARGO.HANSON@EXAMPLE.COM,
//             PENNY.ADIYODI@EXAMPLE.COM,
//             KADY.ORLOFF-DIAZ@EXAMPLE.COM)
//@0000178 OUTPUT MAILBCC=('quentin.coldwater@example.com',
//             'alice.quinn@example.com',
//             'julia.wicker@example.com',
//             'eliot.waugh@example.com',
//             'margo.hanson@example.com',
//             'penny.adiyodi@example.com',
//             'kady.orloff-diaz@example.com')
//@0000179 OUTPUT MAILCC=ABC@EXAMPLE.COM
//@0000180 OUTPUT MAILCC=(ABC@EXAMPLE.COM)
//@0000181 OUTPUT MAILCC=(ABC@EXAMPLE.COM,DEF@EXAMPLE.COM)
//@0000182 OUTPUT MAILCC='abc@example.com'
//@0000183 OUTPUT MAILCC=('abc@example.com')
//@0000184 OUTPUT MAILCC=('abc@example.com','def@example.com')
//@0000185 OUTPUT MAILCC=(QUENTIN.COLDWATER@EXAMPLE.COM,
//             ALICE.QUINN@EXAMPLE.COM,
//             JULIA.WICKER@EXAMPLE.COM,
//             ELIOT.WAUGH@EXAMPLE.COM,
//             MARGO.HANSON@EXAMPLE.COM,
//             PENNY.ADIYODI@EXAMPLE.COM,
//             KADY.ORLOFF-DIAZ@EXAMPLE.COM)
//@0000186 OUTPUT MAILCC=('quentin.coldwater@example.com',
//             'alice.quinn@example.com',
//             'julia.wicker@example.com',
//             'eliot.waugh@example.com',
//             'margo.hanson@example.com',
//             'penny.adiyodi@example.com',
//             'kady.orloff-diaz@example.com')
//@0000187 OUTPUT MAILBCC=&MAILBCC
//@0000188 OUTPUT MAILBCC=(&MAILBCC)
//@0000189 OUTPUT MAILBCC=(&MAILBCC,DEF@EXAMPLE.COM)
//@0000190 OUTPUT MAILBCC=(&MAILBCC,
//             DEF@EXAMPLE.COM)
//@0000191 OUTPUT MAILBCC=(ABC@EXAMPLE.COM,&MAILBCC)
//@0000192 OUTPUT MAILBCC=(ABC@EXAMPLE.COM,
//             &MAILBCC)
//@0000193 OUTPUT MAILBCC=(&MAILBCC,'def@example.com')
//@0000194 OUTPUT MAILBCC=(&MAILBCC,
//             'def@example.com')
//@0000195 OUTPUT MAILBCC=('abc@example.com',&MAILBCC)
//@0000196 OUTPUT MAILBCC=('abc@example.com',
//             &MAILBCC)
//@0000197 OUTPUT MAILCC=&MAILCC
//@0000198 OUTPUT MAILCC=(&MAILCC)
//@0000199 OUTPUT MAILCC=(&MAILCC,DEF@EXAMPLE.COM)
//@0000200 OUTPUT MAILCC=(&MAILCC,
//             DEF@EXAMPLE.COM)
//@0000201 OUTPUT MAILCC=(ABC@EXAMPLE.COM,&MAILCC)
//@0000202 OUTPUT MAILCC=(ABC@EXAMPLE.COM,
//             &MAILCC)
//@0000203 OUTPUT MAILCC=(&MAILCC,'def@example.com')
//@0000204 OUTPUT MAILCC=(&MAILCC,
//             'def@example.com')
//@0000205 OUTPUT MAILCC=('abc@example.com',&MAILCC)
//@0000206 OUTPUT MAILCC=('abc@example.com',
//             &MAILCC)
//@0000207 OUTPUT MAILFILE=LATEST-RESULTS
//@0000208 OUTPUT MAILFILE='Latest Results'
//@0000209 OUTPUT MAILFILE=&MAILFILE
//@0000210 OUTPUT MAILFROM=PRODUCTION.REPORT.DISTRIBUTION
//@0000211 OUTPUT MAILFROM='Production Report Distribution'
//@0000212 OUTPUT MAILFROM=&MAILFROM
//@0000213 OUTPUT MAILTO=ABC@EXAMPLE.COM
//@0000214 OUTPUT MAILTO=(ABC@EXAMPLE.COM)
//@0000215 OUTPUT MAILTO=(ABC@EXAMPLE.COM,DEF@EXAMPLE.COM)
//@0000216 OUTPUT MAILTO='abc@example.com'
//@0000217 OUTPUT MAILTO=('abc@example.com')
//@0000218 OUTPUT MAILTO=('abc@example.com','def@example.com')
//@0000219 OUTPUT MAILTO=(QUENTIN.COLDWATER@EXAMPLE.COM,
//             ALICE.QUINN@EXAMPLE.COM,
//             JULIA.WICKER@EXAMPLE.COM,
//             ELIOT.WAUGH@EXAMPLE.COM,
//             MARGO.HANSON@EXAMPLE.COM,
//             PENNY.ADIYODI@EXAMPLE.COM,
//             KADY.ORLOFF-DIAZ@EXAMPLE.COM)
//@0000220 OUTPUT MAILTO=('quentin.coldwater@example.com',
//             'alice.quinn@example.com',
//             'julia.wicker@example.com',
//             'eliot.waugh@example.com',
//             'margo.hanson@example.com',
//             'penny.adiyodi@example.com',
//             'kady.orloff-diaz@example.com')
//@0000221 OUTPUT MAILTO=&MAILTO
//@0000222 OUTPUT MAILTO=(&MAILTO)
//@0000223 OUTPUT MAILTO=(&MAILTO,DEF@EXAMPLE.COM)
//@0000224 OUTPUT MAILTO=(&MAILTO,
//             DEF@EXAMPLE.COM)
//@0000225 OUTPUT MAILTO=(ABC@EXAMPLE.COM,&MAILTO)
//@0000226 OUTPUT MAILTO=(ABC@EXAMPLE.COM,
//             &MAILTO)
//@0000227 OUTPUT MAILTO=(&MAILTO,'def@example.com')
//@0000228 OUTPUT MAILTO=(&MAILTO,
//             'def@example.com')
//@0000229 OUTPUT MAILTO=('abc@example.com',&MAILTO)
//@0000230 OUTPUT MAILTO=('abc@example.com',
//             &MAILTO)
//@0000231 OUTPUT MERGE=YES
//@0000232 OUTPUT MERGE=Y
//@0000233 OUTPUT MERGE=NO
//@0000234 OUTPUT MERGE=N
//@0000235 OUTPUT MERGE=&MERGE
//@0000236 OUTPUT MODIFY=1
//@0000237 OUTPUT MODIFY=A#1$
//@0000238 OUTPUT MODIFY=(MOD1)
//@0000239 OUTPUT MODIFY=(MOD1,1)
//@0000240 OUTPUT MODIFY=(,2)
//@0000241 OUTPUT MODIFY=&MODIFY
//@0000242 OUTPUT MODIFY=(&MODIFY)
//@0000243 OUTPUT MODIFY=(&MODIFY,&TRC)
//@0000244 OUTPUT MODIFY=(,&TRC)
//@0000245 OUTPUT NAME=ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789@#$
//@0000246 OUTPUT NAME='Charlie Jade'
//@0000247 OUTPUT NAME=&NAME
//@0000248 OUTPUT NOTIFY=CSCHNEID
//@0000249 OUTPUT NOTIFY=(CSCHNEID)
//@0000250 OUTPUT NOTIFY=NEWYORK.CSCHNEID
//@0000251 OUTPUT NOTIFY=(NEWYORK.CSCHNEID)
//@0000252 OUTPUT NOTIFY=(NEWYORK.IBMUSER1,LONDON.IBMUSER2)
//@0000253 OUTPUT NOTIFY=(NEWYORK.IBMUSER1,
//             LONDON.IBMUSER2,
//             PARIS.IBMUSER3,
//             MUNICH.IBMUSER4)
//@0000254 OUTPUT NOTIFY=&NOTIFY1
//@0000255 OUTPUT NOTIFY=(&NOTIFY1)
//@0000256 OUTPUT NOTIFY=(&NOTIFY1,&NOTIFY2)
//@0000257 OUTPUT NOTIFY=(&NOTIFY1,
//             &NOTIFY2,
//             &NOTIFY3,
//             &NOTIFY4)
//@0000258 OUTPUT NOTIFY=(&NODE..&USER)
//@0000259 OUTPUT NOTIFY=(&NOTIFY,CSCHNEID)
//@0000260 OUTPUT NOTIFY=(CSCHNEID,&NOTIFY)
//@0000261 OUTPUT OFFSETXB=1234.567IN
//@0000262 OUTPUT OFFSETXB=1234.567CM
//@0000263 OUTPUT OFFSETXB=1234.567MM
//@0000264 OUTPUT OFFSETXB=1234.567PELS
//@0000265 OUTPUT OFFSETXB=1234.567POINTS
//@0000266 OUTPUT OFFSETXB=&OFFSETXB
//@0000267 OUTPUT OFFSETXF=1234.567IN
//@0000268 OUTPUT OFFSETXF=1234.567CM
//@0000269 OUTPUT OFFSETXF=1234.567MM
//@0000270 OUTPUT OFFSETXF=1234.567PELS
//@0000271 OUTPUT OFFSETXF=1234.567POINTS
//@0000272 OUTPUT OFFSETXF=&OFFSETXF
//@0000273 OUTPUT OFFSETYB=1234.567IN
//@0000274 OUTPUT OFFSETYB=1234.567CM
//@0000275 OUTPUT OFFSETYB=1234.567MM
//@0000276 OUTPUT OFFSETYB=1234.567PELS
//@0000277 OUTPUT OFFSETYB=1234.567POINTS
//@0000278 OUTPUT OFFSETYB=&OFFSETYB
//@0000279 OUTPUT OFFSETYF=1234.567IN
//@0000280 OUTPUT OFFSETYF=1234.567CM
//@0000281 OUTPUT OFFSETYF=1234.567MM
//@0000282 OUTPUT OFFSETYF=1234.567PELS
//@0000283 OUTPUT OFFSETYF=1234.567POINTS
//@0000284 OUTPUT OFFSETYF=&OFFSETYF
//@0000285 OUTPUT OUTBIN=1
//@0000286 OUTPUT OUTBIN=&OUTBIN
//@0000287 OUTPUT OUTDISP=WRITE
//@0000288 OUTPUT OUTDISP=HOLD
//@0000289 OUTPUT OUTDISP=KEEP
//@0000290 OUTPUT OUTDISP=LEAVE
//@0000291 OUTPUT OUTDISP=PURGE
//@0000292 OUTPUT OUTDISP=(WRITE)
//@0000293 OUTPUT OUTDISP=(HOLD)
//@0000294 OUTPUT OUTDISP=(KEEP)
//@0000295 OUTPUT OUTDISP=(LEAVE)
//@0000296 OUTPUT OUTDISP=(PURGE)
//@0000297 OUTPUT OUTDISP=(WRITE,WRITE)
//@0000298 OUTPUT OUTDISP=(HOLD,WRITE)
//@0000299 OUTPUT OUTDISP=(KEEP,WRITE)
//@0000300 OUTPUT OUTDISP=(LEAVE,WRITE)
//@0000301 OUTPUT OUTDISP=(PURGE,WRITE)
//@0000302 OUTPUT OUTDISP=(WRITE,HOLD)
//@0000303 OUTPUT OUTDISP=(HOLD,HOLD)
//@0000304 OUTPUT OUTDISP=(KEEP,HOLD)
//@0000305 OUTPUT OUTDISP=(LEAVE,HOLD)
//@0000306 OUTPUT OUTDISP=(PURGE,HOLD)
//@0000307 OUTPUT OUTDISP=(WRITE,KEEP)
//@0000308 OUTPUT OUTDISP=(HOLD,KEEP)
//@0000309 OUTPUT OUTDISP=(KEEP,KEEP)
//@0000310 OUTPUT OUTDISP=(LEAVE,KEEP)
//@0000311 OUTPUT OUTDISP=(PURGE,KEEP)
//@0000312 OUTPUT OUTDISP=(WRITE,LEAVE)
//@0000313 OUTPUT OUTDISP=(HOLD,LEAVE)
//@0000314 OUTPUT OUTDISP=(KEEP,LEAVE)
//@0000315 OUTPUT OUTDISP=(LEAVE,LEAVE)
//@0000316 OUTPUT OUTDISP=(PURGE,LEAVE)
//@0000317 OUTPUT OUTDISP=(WRITE,PURGE)
//@0000318 OUTPUT OUTDISP=(HOLD,PURGE)
//@0000319 OUTPUT OUTDISP=(KEEP,PURGE)
//@0000320 OUTPUT OUTDISP=(LEAVE,PURGE)
//@0000321 OUTPUT OUTDISP=(PURGE,PURGE)
//@0000322 OUTPUT OUTDISP=(,WRITE)
//@0000323 OUTPUT OUTDISP=(,HOLD)
//@0000324 OUTPUT OUTDISP=(,KEEP)
//@0000325 OUTPUT OUTDISP=(,LEAVE)
//@0000326 OUTPUT OUTDISP=(,PURGE)
//@0000327 OUTPUT OUTDISP=&OUTDISP
//@0000328 OUTPUT OUTDISP=(&OUTDISP)
//@0000329 OUTPUT OUTDISP=(,&OUTDISP)
//@0000330 OUTPUT OUTDISP=(WRITE,&OUTDISP)
//@0000331 OUTPUT OUTDISP=(HOLD,&OUTDISP)
//@0000332 OUTPUT OUTDISP=(KEEP,&OUTDISP)
//@0000333 OUTPUT OUTDISP=(LEAVE,&OUTDISP)
//@0000334 OUTPUT OUTDISP=(PURGE,&OUTDISP)
//@0000335 OUTPUT OUTDISP=(&OUTDISP,WRITE)
//@0000336 OUTPUT OUTDISP=(&OUTDISP,HOLD)
//@0000337 OUTPUT OUTDISP=(&OUTDISP,KEEP)
//@0000338 OUTPUT OUTDISP=(&OUTDISP,LEAVE)
//@0000339 OUTPUT OUTDISP=(&OUTDISP,PURGE)
//@0000340 OUTPUT OUTDISP=(&OUTDISP,&OUTDISP)
//@0000341 OUTPUT OVERLAYB=A123
//@0000342 OUTPUT OVERLAYB=#ABC
//@0000343 OUTPUT OVERLAYB=&OVERLAYB
//@0000344 OUTPUT OVERLAYF=A123
//@0000345 OUTPUT OVERLAYF=#ABC
//@0000346 OUTPUT OVERLAYF=&OVERLAYB
//@0000347 OUTPUT OVFL=ON
//@0000348 OUTPUT OVFL=OFF
//@0000349 OUTPUT OVFL=&OVFL
//@0000350 OUTPUT PAGEDEF=123456
//@0000351 OUTPUT PAGEDEF=ABCDEF
//@0000352 OUTPUT PAGEDEF=@#$@#$
//@0000353 OUTPUT PAGEDEF=&PAGEDEF
//@0000354 OUTPUT PIMSG=YES
//@0000355 OUTPUT PIMSG=NO
//@0000356 OUTPUT PIMSG=(YES)
//@0000357 OUTPUT PIMSG=(NO)
//@0000358 OUTPUT PIMSG=(YES,4)
//@0000359 OUTPUT PIMSG=(NO,8)
//@0000360 OUTPUT PIMSG=&PIMSG
//@0000361 OUTPUT PIMSG=(&PIMSG)
//@0000362 OUTPUT PIMSG=(&PIMSG,15)
//@0000363 OUTPUT PIMSG=(&PIMSG,&COUNT)
//@0000364 OUTPUT PORTNO=65535
//@0000365 OUTPUT PORTNO=&PORTNO
//@0000366 OUTPUT PRMODE=LINE
//@0000367 OUTPUT PRMODE=PAGE
//@0000368 OUTPUT PRMODE=ABCDEFGH
//@0000369 OUTPUT PRMODE=&PRMODE
//@0000370 OUTPUT PRTATTRS='serenity=firefly,moya=leviathan'
//@0000371 OUTPUT PRTATTRS=&PRTATTRS
//@0000372 OUTPUT PRTERROR=DEFAULT
//@0000373 OUTPUT PRTERROR=QUIT
//@0000374 OUTPUT PRTERROR=HOLD
//@0000375 OUTPUT PRTERROR=&PRTERROR
//@0000376 OUTPUT PRTOPTNS=ABLEBAKER
//@0000377 OUTPUT PRTOPTNS='4-8-15-16-23-42'
//@0000378 OUTPUT PRTOPTNS=&PRTOPTNS
//@0000379 OUTPUT PRTQUEUE='123456789A123456789B123456789C123456789D
//             123456789E123456789F123456789G123456789H123456789I'
//@0000380 OUTPUT PRTQUEUE=123
//@0000381 OUTPUT PRTQUEUE=&PRTQUEUE
//@0000382 OUTPUT PRTY=255
//@0000383 OUTPUT PRTY=&PRTY
//@0000384 OUTPUT REPLYTO=ELIOT.WAUGH@EXAMPLE.COM
//@0000385 OUTPUT REPLYTO='yalena.yardeen@example.com'
//@0000386 OUTPUT REPLYTO=&REPLYTO
//@0000387 OUTPUT RESFMT=P240
//@0000388 OUTPUT RESFMT=P300
//@0000389 OUTPUT RESFMT=&RESFMT
//@0000390 OUTPUT RETAINS='9999:99:99'
//@0000391 OUTPUT RETAINS=FOREVER
//@0000392 OUTPUT RETAINS=&RETAINS
//@0000393 OUTPUT RETAINF='9999:99:99'
//@0000394 OUTPUT RETAINF=FOREVER
//@0000395 OUTPUT RETAINF=&RETAINF
//@0000396 OUTPUT RETRYT='9999:99:99'
//@0000397 OUTPUT RETRYT=&RETRYT
//@0000398 OUTPUT RETRYL=32767
//@0000399 OUTPUT RETRYL=&RETRYL
//@0000400 OUTPUT ROOM=201B
//@0000401 OUTPUT ROOM='You know, that one room, down the hall?'
//@0000402 OUTPUT ROOM=&ROOM
//@0000403 OUTPUT SYSAREA=YES
//@0000404 OUTPUT SYSAREA=Y
//@0000405 OUTPUT SYSAREA=NO
//@0000406 OUTPUT SYSAREA=N
//@0000407 OUTPUT SYSAREA=&SYSAREA
//@0000408 OUTPUT THRESHLD=99999999
//@0000409 OUTPUT THRESHLD=&THRESHLD
//@0000410 OUTPUT TITLE=TITLETEXT
//@0000411 OUTPUT TITLE='This is the title text, such as it is'
//@0000412 OUTPUT TITLE=&TITLE
//@0000413 OUTPUT TRC=YES
//@0000414 OUTPUT TRC=Y
//@0000415 OUTPUT TRC=NO
//@0000416 OUTPUT TRC=N
//@0000417 OUTPUT TRC=&TRC
//@0000418 OUTPUT UCS=RN
//@0000419 OUTPUT UCS=&UCS
//@0000420 OUTPUT USERDATA=SLEESTAK
//@0000421 OUTPUT USERDATA=(SLEESTAK)
//@0000422 OUTPUT USERDATA='Sleestak'
//@0000423 OUTPUT USERDATA=('Sleestak')
//@0000424 OUTPUT USERDATA=&USERDATA
//@0000425 OUTPUT USERDATA=(&USERDATA)
//@0000426 OUTPUT USERDATA=('Serenity','Roscinante','Moya')
//@0000427 OUTPUT USERDATA=(&USERDATA,'Roscinante','Moya')
//@0000428 OUTPUT USERDATA=('Serenity',&USERDATA,'Moya')
//@0000429 OUTPUT USERDATA=('Serenity','Roscinante',&USERDATA)
//@0000430 OUTPUT USERDATA=('Serenity',
//             'Roscinante',
//             'Moya')
//@0000431 OUTPUT USERDATA=(&USERDATA,
//             'Roscinante',
//             'Moya')
//@0000432 OUTPUT USERDATA=('Serenity',
//             &USERDATA,
//             'Moya')
//@0000433 OUTPUT USERDATA=('Serenity',
//             'Roscinante',
//             &USERDATA)
//@0000434 OUTPUT USERLIB=&SYSUID..USERLIB
//@0000435 OUTPUT USERLIB=(&SYSUID..USERLIB,PROD.USERLIB)
//@0000436 OUTPUT USERLIB=(&SYSUID..USERLIB,
//             QA.USERLIB,
//             PROD.USERLIB)
//@0000437 OUTPUT USERLIB='INT-TEST.USERLIB'
//@0000438 OUTPUT USERLIB=('INT-TEST.USERLIB')
//@0000439 OUTPUT USERLIB=('MY-TEST.USERLIB',
//             'INT-TEST.USERLIB',
//             'QA.USERLIB',
//             'PROD.USERLIB')
//@0000440 OUTPUT USERPATH=/USER/CSCHNEID/FONTS
//@0000441 OUTPUT USERPATH='/user/cschneid/fonts'
//@0000442 OUTPUT USERPATH=('/user/cschneid/fonts')
//@0000443 OUTPUT USERPATH=('/user/cschneid/fonts',/PROD/FONTS)
//@0000444 OUTPUT USERPATH=('/user/cschneid/fonts',
//             '/integration-test/fonts',
//             '/prod/fonts')
//@0000445 OUTPUT USERPATH=(&PATCH,
//             '/user/cschneid/fonts',
//             '/integration-test/fonts',
//             '/prod/fonts')
//@0000446 OUTPUT WRITER=$WRITER
//@0000447 OUTPUT WRITER=&WRITER
