//SPACE JOB
//*
//STEP0001 EXEC PGM=IEBGENER
//DD000001 DD  SPACE=(TRK,1)
//DD000002 DD  SPACE=(CYL,1)
//DD000003 DD  SPACE=(80,1)
//DD000004 DD  SPACE=(TRK,(10,1))
//DD000005 DD  SPACE=(CYL,(10,1))
//DD000006 DD  SPACE=(80,(10,1))
//DD000007 DD  SPACE=(TRK,(10,1,2))
//DD000008 DD  SPACE=(CYL,(10,1,2))
//DD000009 DD  SPACE=(80,(10,1,2))
//DD000010 DD  SPACE=(TRK,(10,1),RLSE)
//DD000011 DD  SPACE=(CYL,(10,1),RLSE)
//DD000012 DD  SPACE=(80,(10,1),RLSE)
//DD000013 DD  SPACE=(TRK,16777215)
//DD000014 DD  SPACE=(CYL,16777215)
//DD000015 DD  SPACE=(80,16777215)
//DD000016 DD  SPACE=(TRK,(16777215,16777215))
//DD000017 DD  SPACE=(CYL,(16777215,16777215))
//DD000018 DD  SPACE=(80,(16777215,16777215))
//DD000019 DD  SPACE=(,(,,16777215))
//DD000020 DD  SPACE=(TRK,(100,100,100),RLSE,CONTIG)
//DD000021 DD  SPACE=(TRK,(100,100,100),RLSE,MXIG)
//DD000022 DD  SPACE=(TRK,(100,100,100),RLSE,ALX)
//DD000023 DD  SPACE=(TRK,(100,100,100),RLSE,CONTIG,ROUND)
//DD000024 DD  SPACE=(TRK,(100,100,100),RLSE,MXIG,ROUND)
//DD000025 DD  SPACE=(TRK,(100,100,100),RLSE,ALX,ROUND)
//DD000023 DD  SPACE=(TRK,(100,100,100),RLSE,,ROUND)
//DD000024 DD  SPACE=(TRK,(100,100,100),,,ROUND)
//DD000025 DD  SPACE=(TRK,(100,100),,,ROUND)
//DD000026 DD  SPACE=(TRK,(100),,,ROUND)
//DD000027 DD  SPACE=(TRK,100,,,ROUND)
//DD000028 DD  SPACE=(TRK,(100,100,100),,CONTIG)
//DD000029 DD  SPACE=(TRK,(100,100,100),,MXIG)
//DD000030 DD  SPACE=(TRK,(100,100,100),,ALX)
//DD000031 DD  SPACE=(TRK,(100,100),,CONTIG)
//DD000032 DD  SPACE=(TRK,(100,100),,MXIG)
//DD000033 DD  SPACE=(TRK,(100,100),,ALX)
//DD000034 DD  SPACE=(TRK,(100),,CONTIG)
//DD000035 DD  SPACE=(TRK,(100),,MXIG)
//DD000036 DD  SPACE=(TRK,(100),,ALX)
//DD000037 DD  SPACE=(TRK,100,,CONTIG)
//DD000038 DD  SPACE=(TRK,100,,MXIG)
//DD000039 DD  SPACE=(TRK,100,,ALX)
//DD000040 DD  SPACE=(TRK,(100,100),RLSE,CONTIG)
//DD000041 DD  SPACE=(TRK,(100,100),RLSE,MXIG)
//DD000042 DD  SPACE=(TRK,(100,100),RLSE,ALX)
//DD000043 DD  SPACE=(TRK,(100,100),,CONTIG,ROUND)
//DD000044 DD  SPACE=(TRK,(100,100),,MXIG,ROUND)
//DD000045 DD  SPACE=(TRK,(100,100),,ALX,ROUND)
//DD000046 DD  SPACE=(TRK,(100,100,100),,CONTIG,ROUND)
//DD000047 DD  SPACE=(TRK,(100,100,100),,MXIG,ROUND)
//DD000048 DD  SPACE=(TRK,(100,100,100),,ALX,ROUND)
//DD000049 DD  SPACE=(TRK,(100,100,100),RLSE,,ROUND)
//DD000050 DD  SPACE=(TRK,(100,100),RLSE,,ROUND)
//DD000051 DD  SPACE=(TRK,(100),RLSE,,ROUND)
//DD000052 DD  SPACE=(TRK,100,RLSE,,ROUND)
//DD000053 DD  SPACE=(TRK,(100,100),RLSE,CONTIG,ROUND)
//DD000054 DD  SPACE=(TRK,(100),RLSE,CONTIG,ROUND)
//DD000055 DD  SPACE=(TRK,100,RLSE,CONTIG,ROUND)
//DD000056 DD  SPACE=(TRK,(100,100),RLSE,MXIG,ROUND)
//DD000057 DD  SPACE=(TRK,(100),RLSE,MXIG,ROUND)
//DD000058 DD  SPACE=(TRK,100,RLSE,MXIG,ROUND)
//DD000059 DD  SPACE=(TRK,(100,100),RLSE,ALX,ROUND)
//DD000060 DD  SPACE=(TRK,(100),RLSE,ALX,ROUND)
//DD000061 DD  SPACE=(TRK,100,RLSE,ALX,ROUND)
//DD000062 DD  SPACE=(CYL,(100,100,100),RLSE,CONTIG)
//DD000063 DD  SPACE=(CYL,(100,100,100),RLSE,MXIG)
//DD000064 DD  SPACE=(CYL,(100,100,100),RLSE,ALX)
//DD000065 DD  SPACE=(CYL,(100,100,100),RLSE,CONTIG,ROUND)
//DD000066 DD  SPACE=(CYL,(100,100,100),RLSE,MXIG,ROUND)
//DD000067 DD  SPACE=(CYL,(100,100,100),RLSE,ALX,ROUND)
//DD000068 DD  SPACE=(CYL,(100,100,100),RLSE,,ROUND)
//DD000069 DD  SPACE=(CYL,(100,100,100),,,ROUND)
//DD000070 DD  SPACE=(CYL,(100,100),,,ROUND)
//DD000071 DD  SPACE=(CYL,(100),,,ROUND)
//DD000072 DD  SPACE=(CYL,100,,,ROUND)
//DD000073 DD  SPACE=(CYL,(100,100,100),,CONTIG)
//DD000074 DD  SPACE=(CYL,(100,100,100),,MXIG)
//DD000075 DD  SPACE=(CYL,(100,100,100),,ALX)
//DD000076 DD  SPACE=(CYL,(100,100),,CONTIG)
//DD000077 DD  SPACE=(CYL,(100,100),,MXIG)
//DD000078 DD  SPACE=(CYL,(100,100),,ALX)
//DD000079 DD  SPACE=(CYL,(100),,CONTIG)
//DD000080 DD  SPACE=(CYL,(100),,MXIG)
//DD000081 DD  SPACE=(CYL,(100),,ALX)
//DD000082 DD  SPACE=(CYL,100,,CONTIG)
//DD000083 DD  SPACE=(CYL,100,,MXIG)
//DD000084 DD  SPACE=(CYL,100,,ALX)
//DD000085 DD  SPACE=(CYL,(100,100),RLSE,CONTIG)
//DD000086 DD  SPACE=(CYL,(100,100),RLSE,MXIG)
//DD000087 DD  SPACE=(CYL,(100,100),RLSE,ALX)
//DD000088 DD  SPACE=(CYL,(100,100),,CONTIG,ROUND)
//DD000089 DD  SPACE=(CYL,(100,100),,MXIG,ROUND)
//DD000090 DD  SPACE=(CYL,(100,100),,ALX,ROUND)
//DD000091 DD  SPACE=(CYL,(100,100,100),,CONTIG,ROUND)
//DD000092 DD  SPACE=(CYL,(100,100,100),,MXIG,ROUND)
//DD000093 DD  SPACE=(CYL,(100,100,100),,ALX,ROUND)
//DD000094 DD  SPACE=(CYL,(100,100,100),RLSE,,ROUND)
//DD000095 DD  SPACE=(CYL,(100,100),RLSE,,ROUND)
//DD000096 DD  SPACE=(CYL,(100),RLSE,,ROUND)
//DD000097 DD  SPACE=(CYL,100,RLSE,,ROUND)
//DD000098 DD  SPACE=(CYL,(100,100),RLSE,CONTIG,ROUND)
//DD000099 DD  SPACE=(CYL,(100),RLSE,CONTIG,ROUND)
//DD000100 DD  SPACE=(CYL,100,RLSE,CONTIG,ROUND)
//DD000101 DD  SPACE=(CYL,(100,100),RLSE,MXIG,ROUND)
//DD000102 DD  SPACE=(CYL,(100),RLSE,MXIG,ROUND)
//DD000103 DD  SPACE=(CYL,100,RLSE,MXIG,ROUND)
//DD000104 DD  SPACE=(CYL,(100,100),RLSE,ALX,ROUND)
//DD000105 DD  SPACE=(CYL,(100),RLSE,ALX,ROUND)
//DD000106 DD  SPACE=(CYL,100,RLSE,ALX,ROUND)
//DD000107 DD  SPACE=(27998,(100,100,100),RLSE,CONTIG)
//DD000108 DD  SPACE=(27998,(100,100,100),RLSE,MXIG)
//DD000109 DD  SPACE=(27998,(100,100,100),RLSE,ALX)
//DD000110 DD  SPACE=(27998,(100,100,100),RLSE,CONTIG,ROUND)
//DD000111 DD  SPACE=(27998,(100,100,100),RLSE,MXIG,ROUND)
//DD000112 DD  SPACE=(27998,(100,100,100),RLSE,ALX,ROUND)
//DD000113 DD  SPACE=(27998,(100,100,100),RLSE,,ROUND)
//DD000114 DD  SPACE=(27998,(100,100,100),,,ROUND)
//DD000115 DD  SPACE=(27998,(100,100),,,ROUND)
//DD000116 DD  SPACE=(27998,(100),,,ROUND)
//DD000117 DD  SPACE=(27998,100,,,ROUND)
//DD000118 DD  SPACE=(27998,(100,100,100),,CONTIG)
//DD000119 DD  SPACE=(27998,(100,100,100),,MXIG)
//DD000120 DD  SPACE=(27998,(100,100,100),,ALX)
//DD000121 DD  SPACE=(27998,(100,100),,CONTIG)
//DD000122 DD  SPACE=(27998,(100,100),,MXIG)
//DD000123 DD  SPACE=(27998,(100,100),,ALX)
//DD000124 DD  SPACE=(27998,(100),,CONTIG)
//DD000125 DD  SPACE=(27998,(100),,MXIG)
//DD000126 DD  SPACE=(27998,(100),,ALX)
//DD000127 DD  SPACE=(27998,100,,CONTIG)
//DD000128 DD  SPACE=(27998,100,,MXIG)
//DD000129 DD  SPACE=(27998,100,,ALX)
//DD000130 DD  SPACE=(27998,(100,100),RLSE,CONTIG)
//DD000131 DD  SPACE=(27998,(100,100),RLSE,MXIG)
//DD000132 DD  SPACE=(27998,(100,100),RLSE,ALX)
//DD000133 DD  SPACE=(27998,(100,100),,CONTIG,ROUND)
//DD000134 DD  SPACE=(27998,(100,100),,MXIG,ROUND)
//DD000135 DD  SPACE=(27998,(100,100),,ALX,ROUND)
//DD000136 DD  SPACE=(27998,(100,100,100),,CONTIG,ROUND)
//DD000137 DD  SPACE=(27998,(100,100,100),,MXIG,ROUND)
//DD000138 DD  SPACE=(27998,(100,100,100),,ALX,ROUND)
//DD000139 DD  SPACE=(27998,(100,100,100),RLSE,,ROUND)
//DD000140 DD  SPACE=(27998,(100,100),RLSE,,ROUND)
//DD000141 DD  SPACE=(27998,(100),RLSE,,ROUND)
//DD000142 DD  SPACE=(27998,100,RLSE,,ROUND)
//DD000143 DD  SPACE=(27998,(100,100),RLSE,CONTIG,ROUND)
//DD000144 DD  SPACE=(27998,(100),RLSE,CONTIG,ROUND)
//DD000145 DD  SPACE=(27998,100,RLSE,CONTIG,ROUND)
//DD000146 DD  SPACE=(27998,(100,100),RLSE,MXIG,ROUND)
//DD000147 DD  SPACE=(27998,(100),RLSE,MXIG,ROUND)
//DD000148 DD  SPACE=(27998,100,RLSE,MXIG,ROUND)
//DD000149 DD  SPACE=(27998,(100,100),RLSE,ALX,ROUND)
//DD000150 DD  SPACE=(27998,(100),RLSE,ALX,ROUND)
//DD000151 DD  SPACE=(27998,100,RLSE,ALX,ROUND)
//DD000152 DD  SPACE=(ABSTR,(1,2))
//DD000153 DD  SPACE=(ABSTR,(1,2,3))
//DD000154 DD  SPACE=(,(,,10))
//DD000155 DD  SPACE=(&UNIT,(&PRIM,&SEC,&DIR),&RLSE,&CONTIG,&ROUND)
//DD000156 DD  SPACE=&SPACE
//DD000157 DD  SPACE=&SPACE1&SPACE2&SPACE3
//DD001001 DD  SPACE=(TRK,1) SPACE
//DD001002 DD  SPACE=(CYL,1) SPACE
//DD001003 DD  SPACE=(80,1) SPACE
//DD001004 DD  SPACE=(TRK,(10,1)) SPACE
//DD001005 DD  SPACE=(CYL,(10,1)) SPACE
//DD001006 DD  SPACE=(80,(10,1)) SPACE
//DD001007 DD  SPACE=(TRK,(10,1,2)) SPACE
//DD001008 DD  SPACE=(CYL,(10,1,2)) SPACE
//DD001009 DD  SPACE=(80,(10,1,2)) SPACE
//DD001010 DD  SPACE=(TRK,(10,1),RLSE) SPACE
//DD001011 DD  SPACE=(CYL,(10,1),RLSE) SPACE
//DD001012 DD  SPACE=(80,(10,1),RLSE) SPACE
//DD001013 DD  SPACE=(TRK,16777215) SPACE
//DD001014 DD  SPACE=(CYL,16777215) SPACE
//DD001015 DD  SPACE=(80,16777215) SPACE
//DD001016 DD  SPACE=(TRK,(16777215,16777215)) SPACE
//DD001017 DD  SPACE=(CYL,(16777215,16777215)) SPACE
//DD001018 DD  SPACE=(80,(16777215,16777215)) SPACE
//DD001019 DD  SPACE=(,(,,16777215)) SPACE
//DD001020 DD  SPACE=(TRK,(100,100,100),RLSE,CONTIG) SPACE
//DD001021 DD  SPACE=(TRK,(100,100,100),RLSE,MXIG) SPACE
//DD001022 DD  SPACE=(TRK,(100,100,100),RLSE,ALX) SPACE
//DD001023 DD  SPACE=(TRK,(100,100,100),RLSE,CONTIG,ROUND) SPACE
//DD001024 DD  SPACE=(TRK,(100,100,100),RLSE,MXIG,ROUND) SPACE
//DD001025 DD  SPACE=(TRK,(100,100,100),RLSE,ALX,ROUND) SPACE
//DD001023 DD  SPACE=(TRK,(100,100,100),RLSE,,ROUND) SPACE
//DD001024 DD  SPACE=(TRK,(100,100,100),,,ROUND) SPACE
//DD001025 DD  SPACE=(TRK,(100,100),,,ROUND) SPACE
//DD001026 DD  SPACE=(TRK,(100),,,ROUND) SPACE
//DD001027 DD  SPACE=(TRK,100,,,ROUND) SPACE
//DD001028 DD  SPACE=(TRK,(100,100,100),,CONTIG) SPACE
//DD001029 DD  SPACE=(TRK,(100,100,100),,MXIG) SPACE
//DD001030 DD  SPACE=(TRK,(100,100,100),,ALX) SPACE
//DD001031 DD  SPACE=(TRK,(100,100),,CONTIG) SPACE
//DD001032 DD  SPACE=(TRK,(100,100),,MXIG) SPACE
//DD001033 DD  SPACE=(TRK,(100,100),,ALX) SPACE
//DD001034 DD  SPACE=(TRK,(100),,CONTIG) SPACE
//DD001035 DD  SPACE=(TRK,(100),,MXIG) SPACE
//DD001036 DD  SPACE=(TRK,(100),,ALX) SPACE
//DD001037 DD  SPACE=(TRK,100,,CONTIG) SPACE
//DD001038 DD  SPACE=(TRK,100,,MXIG) SPACE
//DD001039 DD  SPACE=(TRK,100,,ALX) SPACE
//DD001040 DD  SPACE=(TRK,(100,100),RLSE,CONTIG) SPACE
//DD001041 DD  SPACE=(TRK,(100,100),RLSE,MXIG) SPACE
//DD001042 DD  SPACE=(TRK,(100,100),RLSE,ALX) SPACE
//DD001043 DD  SPACE=(TRK,(100,100),,CONTIG,ROUND) SPACE
//DD001044 DD  SPACE=(TRK,(100,100),,MXIG,ROUND) SPACE
//DD001045 DD  SPACE=(TRK,(100,100),,ALX,ROUND) SPACE
//DD001046 DD  SPACE=(TRK,(100,100,100),,CONTIG,ROUND) SPACE
//DD001047 DD  SPACE=(TRK,(100,100,100),,MXIG,ROUND) SPACE
//DD001048 DD  SPACE=(TRK,(100,100,100),,ALX,ROUND) SPACE
//DD001049 DD  SPACE=(TRK,(100,100,100),RLSE,,ROUND) SPACE
//DD001050 DD  SPACE=(TRK,(100,100),RLSE,,ROUND) SPACE
//DD001051 DD  SPACE=(TRK,(100),RLSE,,ROUND) SPACE
//DD001052 DD  SPACE=(TRK,100,RLSE,,ROUND) SPACE
//DD001053 DD  SPACE=(TRK,(100,100),RLSE,CONTIG,ROUND) SPACE
//DD001054 DD  SPACE=(TRK,(100),RLSE,CONTIG,ROUND) SPACE
//DD001055 DD  SPACE=(TRK,100,RLSE,CONTIG,ROUND) SPACE
//DD001056 DD  SPACE=(TRK,(100,100),RLSE,MXIG,ROUND) SPACE
//DD001057 DD  SPACE=(TRK,(100),RLSE,MXIG,ROUND) SPACE
//DD001058 DD  SPACE=(TRK,100,RLSE,MXIG,ROUND) SPACE
//DD001059 DD  SPACE=(TRK,(100,100),RLSE,ALX,ROUND) SPACE
//DD001060 DD  SPACE=(TRK,(100),RLSE,ALX,ROUND) SPACE
//DD001061 DD  SPACE=(TRK,100,RLSE,ALX,ROUND) SPACE
//DD001062 DD  SPACE=(CYL,(100,100,100),RLSE,CONTIG) SPACE
//DD001063 DD  SPACE=(CYL,(100,100,100),RLSE,MXIG) SPACE
//DD001064 DD  SPACE=(CYL,(100,100,100),RLSE,ALX) SPACE
//DD001065 DD  SPACE=(CYL,(100,100,100),RLSE,CONTIG,ROUND) SPACE
//DD001066 DD  SPACE=(CYL,(100,100,100),RLSE,MXIG,ROUND) SPACE
//DD001067 DD  SPACE=(CYL,(100,100,100),RLSE,ALX,ROUND) SPACE
//DD001068 DD  SPACE=(CYL,(100,100,100),RLSE,,ROUND) SPACE
//DD001069 DD  SPACE=(CYL,(100,100,100),,,ROUND) SPACE
//DD001070 DD  SPACE=(CYL,(100,100),,,ROUND) SPACE
//DD001071 DD  SPACE=(CYL,(100),,,ROUND) SPACE
//DD001072 DD  SPACE=(CYL,100,,,ROUND) SPACE
//DD001073 DD  SPACE=(CYL,(100,100,100),,CONTIG) SPACE
//DD001074 DD  SPACE=(CYL,(100,100,100),,MXIG) SPACE
//DD001075 DD  SPACE=(CYL,(100,100,100),,ALX) SPACE
//DD001076 DD  SPACE=(CYL,(100,100),,CONTIG) SPACE
//DD001077 DD  SPACE=(CYL,(100,100),,MXIG) SPACE
//DD001078 DD  SPACE=(CYL,(100,100),,ALX) SPACE
//DD001079 DD  SPACE=(CYL,(100),,CONTIG) SPACE
//DD001080 DD  SPACE=(CYL,(100),,MXIG) SPACE
//DD001081 DD  SPACE=(CYL,(100),,ALX) SPACE
//DD001082 DD  SPACE=(CYL,100,,CONTIG) SPACE
//DD001083 DD  SPACE=(CYL,100,,MXIG) SPACE
//DD001084 DD  SPACE=(CYL,100,,ALX) SPACE
//DD001085 DD  SPACE=(CYL,(100,100),RLSE,CONTIG) SPACE
//DD001086 DD  SPACE=(CYL,(100,100),RLSE,MXIG) SPACE
//DD001087 DD  SPACE=(CYL,(100,100),RLSE,ALX) SPACE
//DD001088 DD  SPACE=(CYL,(100,100),,CONTIG,ROUND) SPACE
//DD001089 DD  SPACE=(CYL,(100,100),,MXIG,ROUND) SPACE
//DD001090 DD  SPACE=(CYL,(100,100),,ALX,ROUND) SPACE
//DD001091 DD  SPACE=(CYL,(100,100,100),,CONTIG,ROUND) SPACE
//DD001092 DD  SPACE=(CYL,(100,100,100),,MXIG,ROUND) SPACE
//DD001093 DD  SPACE=(CYL,(100,100,100),,ALX,ROUND) SPACE
//DD001094 DD  SPACE=(CYL,(100,100,100),RLSE,,ROUND) SPACE
//DD001095 DD  SPACE=(CYL,(100,100),RLSE,,ROUND) SPACE
//DD001096 DD  SPACE=(CYL,(100),RLSE,,ROUND) SPACE
//DD001097 DD  SPACE=(CYL,100,RLSE,,ROUND) SPACE
//DD001098 DD  SPACE=(CYL,(100,100),RLSE,CONTIG,ROUND) SPACE
//DD001099 DD  SPACE=(CYL,(100),RLSE,CONTIG,ROUND) SPACE
//DD001100 DD  SPACE=(CYL,100,RLSE,CONTIG,ROUND) SPACE
//DD001101 DD  SPACE=(CYL,(100,100),RLSE,MXIG,ROUND) SPACE
//DD001102 DD  SPACE=(CYL,(100),RLSE,MXIG,ROUND) SPACE
//DD001103 DD  SPACE=(CYL,100,RLSE,MXIG,ROUND) SPACE
//DD001104 DD  SPACE=(CYL,(100,100),RLSE,ALX,ROUND) SPACE
//DD001105 DD  SPACE=(CYL,(100),RLSE,ALX,ROUND) SPACE
//DD001106 DD  SPACE=(CYL,100,RLSE,ALX,ROUND) SPACE
//DD001107 DD  SPACE=(27998,(100,100,100),RLSE,CONTIG) SPACE
//DD001108 DD  SPACE=(27998,(100,100,100),RLSE,MXIG) SPACE
//DD001109 DD  SPACE=(27998,(100,100,100),RLSE,ALX) SPACE
//DD001110 DD  SPACE=(27998,(100,100,100),RLSE,CONTIG,ROUND) SPACE
//DD001111 DD  SPACE=(27998,(100,100,100),RLSE,MXIG,ROUND) SPACE
//DD001112 DD  SPACE=(27998,(100,100,100),RLSE,ALX,ROUND) SPACE
//DD001113 DD  SPACE=(27998,(100,100,100),RLSE,,ROUND) SPACE
//DD001114 DD  SPACE=(27998,(100,100,100),,,ROUND) SPACE
//DD001115 DD  SPACE=(27998,(100,100),,,ROUND) SPACE
//DD001116 DD  SPACE=(27998,(100),,,ROUND) SPACE
//DD001117 DD  SPACE=(27998,100,,,ROUND) SPACE
//DD001118 DD  SPACE=(27998,(100,100,100),,CONTIG) SPACE
//DD001119 DD  SPACE=(27998,(100,100,100),,MXIG) SPACE
//DD001120 DD  SPACE=(27998,(100,100,100),,ALX) SPACE
//DD001121 DD  SPACE=(27998,(100,100),,CONTIG) SPACE
//DD001122 DD  SPACE=(27998,(100,100),,MXIG) SPACE
//DD001123 DD  SPACE=(27998,(100,100),,ALX) SPACE
//DD001124 DD  SPACE=(27998,(100),,CONTIG) SPACE
//DD001125 DD  SPACE=(27998,(100),,MXIG) SPACE
//DD001126 DD  SPACE=(27998,(100),,ALX) SPACE
//DD001127 DD  SPACE=(27998,100,,CONTIG) SPACE
//DD001128 DD  SPACE=(27998,100,,MXIG) SPACE
//DD001129 DD  SPACE=(27998,100,,ALX) SPACE
//DD001130 DD  SPACE=(27998,(100,100),RLSE,CONTIG) SPACE
//DD001131 DD  SPACE=(27998,(100,100),RLSE,MXIG) SPACE
//DD001132 DD  SPACE=(27998,(100,100),RLSE,ALX) SPACE
//DD001133 DD  SPACE=(27998,(100,100),,CONTIG,ROUND) SPACE
//DD001134 DD  SPACE=(27998,(100,100),,MXIG,ROUND) SPACE
//DD001135 DD  SPACE=(27998,(100,100),,ALX,ROUND) SPACE
//DD001136 DD  SPACE=(27998,(100,100,100),,CONTIG,ROUND) SPACE
//DD001137 DD  SPACE=(27998,(100,100,100),,MXIG,ROUND) SPACE
//DD001138 DD  SPACE=(27998,(100,100,100),,ALX,ROUND) SPACE
//DD001139 DD  SPACE=(27998,(100,100,100),RLSE,,ROUND) SPACE
//DD001140 DD  SPACE=(27998,(100,100),RLSE,,ROUND) SPACE
//DD001141 DD  SPACE=(27998,(100),RLSE,,ROUND) SPACE
//DD001142 DD  SPACE=(27998,100,RLSE,,ROUND) SPACE
//DD001143 DD  SPACE=(27998,(100,100),RLSE,CONTIG,ROUND) SPACE
//DD001144 DD  SPACE=(27998,(100),RLSE,CONTIG,ROUND) SPACE
//DD001145 DD  SPACE=(27998,100,RLSE,CONTIG,ROUND) SPACE
//DD001146 DD  SPACE=(27998,(100,100),RLSE,MXIG,ROUND) SPACE
//DD001147 DD  SPACE=(27998,(100),RLSE,MXIG,ROUND) SPACE
//DD001148 DD  SPACE=(27998,100,RLSE,MXIG,ROUND) SPACE
//DD001149 DD  SPACE=(27998,(100,100),RLSE,ALX,ROUND) SPACE
//DD001150 DD  SPACE=(27998,(100),RLSE,ALX,ROUND) SPACE
//DD001151 DD  SPACE=(27998,100,RLSE,ALX,ROUND) SPACE
//DD001152 DD  SPACE=(ABSTR,(1,2)) SPACE
//DD001153 DD  SPACE=(ABSTR,(1,2,3)) SPACE
//DD001154 DD  SPACE=(,(,,10)) SPACE
//DD000155 DD  SPACE=(&UNIT,(&PRIM,&SEC,&DIR),&RLSE,&CONTIG,&ROUND) SPACE
//DD000156 DD  SPACE=&SPACE SPACE
//DD000157 DD  SPACE=&SPACE1&SPACE2&SPACE3 SPACE

