//COPIES JOB
//*
//STEP0001 EXEC PGM=IEBGENER
//DD000001 DD  COPIES=3
//DD000002 DD  COPIES=(4)
//DD000003 DD  COPIES=(0,(1,2))
//DD000004 DD  COPIES=(0,(1,2,3))
//DD000005 DD  COPIES=(0,(1,2,3,4))
//DD000006 DD  COPIES=(0,(1,2,3,4,5))
//DD000007 DD  COPIES=(0,(1,2,3,4,5,6))
//DD000008 DD  COPIES=(0,(1,2,3,4,5,6,7))
//DD000009 DD  COPIES=(0,(1,2,3,4,5,6,7,8))
//DD000010 DD  COPIES=&COPIES
//DD000011 DD  COPIES=3 COPIES
//DD000012 DD  COPIES=(4) COPIES
//DD000013 DD  COPIES=(0,(1,2)) COPIES
//DD000014 DD  COPIES=(0,(1,2,3)) COPIES
//DD000015 DD  COPIES=(0,(1,2,3,4)) COPIES
//DD000016 DD  COPIES=(0,(1,2,3,4,5)) COPIES
//DD000017 DD  COPIES=(0,(1,2,3,4,5,6)) COPIES
//DD000018 DD  COPIES=(0,(1,2,3,4,5,6,7)) COPIES
//DD000019 DD  COPIES=(0,(1,2,3,4,5,6,7,8)) COPIES
//DD000020 DD  COPIES=&COPIES COPIES
//DD000021 DD  COPIES=(&COPIES) COPIES
//DD000022 DD  COPIES=(&C1,(&C2,&C3,&C3,&C5,&C6,&C7,&C8,&C9)) COPIES
//DD000023 DD  COPIES=(&COPIES)
//DD000024 DD  COPIES=(&C1,(&C2,&C3,&C3,&C5,&C6,&C7,&C8,&C9))
