//XMIT JOB
/*XMIT QRESH(DUTCH)        
//XMIT1 JOB
// EXEC PGM=IEFBR14
/*
/*XMIT LEITH(ZEPH) DLM=TURIN
//XMIT2 JOB
// EXEC PGM=IEBGENER
//SYSUT1 DD *
JAQOBIS
/*
//SYSUT2 DD SYSOUT=*
//SYSIN  DD DUMMY
TURIN
// EXEC PGM=IEFBR14
