//FREE JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  FREE=END
//DD000002 DD  FREE=CLOSE
//DD000003 DD  FREE=&FREE
//DD000101 DD  FREE=END FREE
//DD000102 DD  FREE=CLOSE FREE
//DD000103 DD  FREE=&FREE FREE

