//EDSEL JOB
//*
//STEP001  EXEC PGM=IEFBR14,ACCT=A,ADDRSPC=REAL
//STEP002  EXEC PGM=IEFBR14,PARM=X,ACCT='A',ADDRSPC=REAL
//STEP002A EXEC PGM=IEFBR14,PARM=XX,ACCT=(A),ADDRSPC=REAL
//STEP002B EXEC PGM=IEFBR14,PARM=1,ACCT=('A'),ADDRSPC=REAL
//STEP002C EXEC PGM=IEFBR14,PARM=12,ACCT=(A,B),ADDRSPC=REAL
//STEP002D EXEC PGM=IEFBR14,PARM=#,ACCT=('A',B),ADDRSPC=REAL
//STEP002E EXEC PGM=IEFBR14,PARM=#$,ACCT=(A,'B'),ADDRSPC=REAL
//STEP002F EXEC PGM=IEFBR14,PARM=X1,ACCT=A1,ADDRSPC=VIRT
//STEP002G EXEC PGM=IEFBR14,PARM=XX1,ACCT='A1',ADDRSPC=VIRT
//STEP002H EXEC PGM=IEFBR14,PARM=XX11,ACCT=(A1),ADDRSPC=VIRT
//STEP002I EXEC PGM=IEFBR14,PARM=1X,ACCT=('A1'),ADDRSPC=VIRT
//STEP002J EXEC PGM=IEFBR14,PARM=11X,ACCT=(A1,B2),ADDRSPC=VIRT
//STEP002K EXEC PGM=IEFBR14,PARM=11XX,ACCT=('A1',B2),ADDRSPC=VIRT
//STEP002L EXEC PGM=IEFBR14,PARM=X@,ACCT=(A1,'B2'),ADDRSPC=VIRT
//STEP002M EXEC PGM=IEFBR14,PARM=XX@,ACCT=('A1','B2'),ADDRSPC=VIRT
//STEP002N EXEC PGM=IEFBR14,PARM=XX@@,ACCT='A1$',ADDRSPC=VIRT
//STEP002O EXEC PGM=IEFBR14,PARM=1@,ACCT=('A1$'),ADDRSPC=VIRT
//STEP002P EXEC PGM=IEFBR14,PARM=11@,ACCT=('A1$','B2+'),ADDRSPC=VIRT
//STEP003  EXEC PROC=IAYEBR14,PARM.STEPA=11@@,ACCT.STEPA=A1,
// ADDRSPC.STEPB=REAL
//STEP003A EXEC PROC=IAYEBR14,PARM.STEPA=11@@,ACCT.STEPA=A1,
//        ADDRSPC.STEPB=VIRT
//STEP004  EXEC PROC=IAYEBR14,PARM.STEPB='A1@/STGRPT(ON)',
// ACCT.STEPA='A1',ACCT.STEPB=('A1','B2-'),ADDRSPC.STEPC=REAL
//STEP005  EXEC IAYEBR14, exec
// PARM.STEPA=&A, parm
// ACCT.STEPA=A1, acctA
// ACCT.STEPB=('A1+','B2(1)'), acctB
// ADDRSPC.STEPC=VIRT, addrspcC
// ADDRSPC.STEPD=&ADDRSPCD addrspcD
