//INCLUDE JOB ,
//*
//STEP0001 EXEC PGM=IEFBR14
//STEPLIB  INCLUDE MEMBER=STEPLIB&ENV
//SYSOUT   INCLUDE MEMBER=SYSOUT
//STEP0002 EXEC PGM=IEFBR14
//         INCLUDE MEMBER=STEPLIB
//         INCLUDE MEMBER=SYSOUT
//STEP0003 EXEC PGM=IEFBR14
//         INCLUDE MEMBER=&ENV.LIB
