//TESTJCL1 JOB
// JCLLIB ORDER=SYS1.PROCLIB
// EXEC PGM=IEFBR14
//* 
//TESTJCL2 JOB
// JCLLIB ORDER='SYS1.PROCLIB'
// EXEC PGM=IEFBR14
//* 
//TESTJCL3 JOB
// JCLLIB ORDER=(SYS1.PROCLIB)
// EXEC PGM=IEFBR14
//* 
//TESTJCL4 JOB
// JCLLIB ORDER=('SYS1.PROCLIB')
// EXEC PGM=IEFBR14
//* 
//TESTJCL5 JOB
// JCLLIB ORDER=(SYS1.PROCLIB,USER.PROCLIB)
// EXEC PGM=IEFBR14
//* 
//TESTJCL6 JOB
// JCLLIB ORDER=('SYS1.PROCLIB',USER.PROCLIB)
// EXEC PGM=IEFBR14
//* 
//TESTJCL7 JOB
// JCLLIB ORDER=(SYS1.PROCLIB,'USER.PROCLIB')
// EXEC PGM=IEFBR14
//* 
//TESTJCL8 JOB
// JCLLIB ORDER=('SYS1.PROCLIB','USER.PROCLIB')
// EXEC PGM=IEFBR14
//* 
//TESTJCL9 JOB
// JCLLIB ORDER=(SYS1.PROCLIB,
//        USER.PROCLIB)
// EXEC PGM=IEFBR14
//* 
//TESTJCLA JOB
// JCLLIB ORDER=('SYS1.PROCLIB',
//        USER.PROCLIB)
// EXEC PGM=IEFBR14
//* 
//TESTJCLB JOB
// JCLLIB ORDER=(SYS1.PROCLIB,
//        'USER.PROCLIB')
// EXEC PGM=IEFBR14
//* 
//TESTJCLC JOB
// JCLLIB ORDER=('SYS1.PROCLIB',
//        'USER.PROCLIB')
// EXEC PGM=IEFBR14
//* 
//TESTJCLD JOB
// JCLLIB ORDER=('SYS1.PROCLIB',
//        'USER.PROCLIB',
//        '&SYSUID..PROCLIB')
// EXEC PGM=IEFBR14
//* 
//TESTJCL1 JOB
// JCLLIB ORDER=SYS1.PROCLIB  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCL2 JOB
// JCLLIB ORDER='SYS1.PROCLIB'  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCL3 JOB
// JCLLIB ORDER=(SYS1.PROCLIB)  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCL4 JOB
// JCLLIB ORDER=('SYS1.PROCLIB')  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCL5 JOB
// JCLLIB ORDER=(SYS1.PROCLIB,USER.PROCLIB)  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCL6 JOB
// JCLLIB ORDER=('SYS1.PROCLIB',USER.PROCLIB)  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCL7 JOB
// JCLLIB ORDER=(SYS1.PROCLIB,'USER.PROCLIB')  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCL8 JOB
// JCLLIB ORDER=('SYS1.PROCLIB','USER.PROCLIB')  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCL9 JOB
// JCLLIB ORDER=(SYS1.PROCLIB,  comment
//        USER.PROCLIB)  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCLA JOB
// JCLLIB ORDER=('SYS1.PROCLIB',  comment
//        USER.PROCLIB)  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCLB JOB
// JCLLIB ORDER=(SYS1.PROCLIB,  comment
//        'USER.PROCLIB')  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCLC JOB
// JCLLIB ORDER=('SYS1.PROCLIB',  comment
//        'USER.PROCLIB')  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCLD JOB
// JCLLIB ORDER=('SYS1.PROCLIB',  comment
//        'USER.PROCLIB',  comment
//        '&SYSUID..PROCLIB') comment
// EXEC PGM=IEFBR14
//* 

