       Identification Division.
       Program-ID. HARTNELL.
       Data Division.
       Working-Storage Section.
       01  myname pic X(008) value 'HARTNELL'.
       Procedure Division.
           Display myname
           Goback.
#include <stdlib.h>
/*
embedded C
*/
main() {printf("Hello, World\n");}
       
