//REFDD JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  REFDD=*.DD
//DD000002 DD  REFDD=*.STEP.DD
//DD000003 DD  REFDD=*.STEP.PROCSTEP.DD
//DD000004 DD  DATA,REFDD=*.STEP.PROCSTEP.DD,DLM='$$'
//AEIOU JOB
$$
//DD000005 DD  REFDD=*.DD REFDD
//DD000006 DD  REFDD=*.STEP.DD REFDD
//DD000007 DD  REFDD=*.STEP.PROCSTEP.DD REFDD
//DD000008 DD  DATA,REFDD=*.STEP.PROCSTEP.DD,DLM='$$' REFDD
//AEIOU JOB
$$
//*
