//FCB JOB
//*
//STEP0001 EXEC PGM=OUTPUT
//DD000001 DD  FCB=1
//DD000002 DD  FCB=A
//DD000003 DD  FCB=@
//DD000004 DD  FCB=1A
//DD000005 DD  FCB=A1
//DD000006 DD  FCB=1@
//DD000007 DD  FCB=A#
//DD000008 DD  FCB=$1
//DD000009 DD  FCB=@A
//DD000010 DD  FCB=1111
//DD000011 DD  FCB=AAAA
//DD000012 DD  FCB=@#$@
//DD000013 DD  FCB=&FCB
//DD000014 DD  FCB=(ABCD,ALIGN)
//DD000015 DD  FCB=(1234,VERIFY)
//DD000016 DD  FCB=(&FCB,ALIGN)
//DD000017 DD  FCB=(&FCB,VERIFY)
//DD000018 DD  FCB=(12AB,&ZZ)
//DD000019 DD  FCB=(&FCB,&Q)
//DD000101 DD  FCB=1 FCB
//DD000102 DD  FCB=A FCB
//DD000103 DD  FCB=@ FCB
//DD000104 DD  FCB=1A FCB
//DD000105 DD  FCB=A1 FCB
//DD000106 DD  FCB=1@ FCB
//DD000107 DD  FCB=A# FCB
//DD000108 DD  FCB=$1 FCB
//DD000109 DD  FCB=@A FCB
//DD000110 DD  FCB=1111 FCB
//DD000111 DD  FCB=AAAA FCB
//DD000112 DD  FCB=@#$@ FCB
//DD000113 DD  FCB=&FCB FCB
//DD000114 DD  FCB=(ABCD,ALIGN) FCB
//DD000115 DD  FCB=(1234,VERIFY) FCB
//DD000116 DD  FCB=(&FCB,ALIGN) FCB
//DD000117 DD  FCB=(&FCB,VERIFY) FCB
//DD000118 DD  FCB=(12AB,&ZZ) FCB
//DD000119 DD  FCB=(&FCB,&Q) FCB

