//FLASH JOB
//*
//STEP0001 EXEC PGM=IEBGENER
//DD000001 DD  FLASH=NONE
//DD000002 DD  FLASH=1
//DD000003 DD  FLASH=A
//DD000004 DD  FLASH=@
//DD000005 DD  FLASH=1A
//DD000006 DD  FLASH=1#
//DD000007 DD  FLASH=A1
//DD000008 DD  FLASH=A$
//DD000009 DD  FLASH=1234
//DD000010 DD  FLASH=ABCD
//DD000011 DD  FLASH=@#$@
//DD000012 DD  FLASH=&FLASH
//DD000013 DD  FLASH=(1,1)
//DD000014 DD  FLASH=(A,1)
//DD000015 DD  FLASH=(@,1)
//DD000016 DD  FLASH=(1A,1)
//DD000017 DD  FLASH=(1#,1)
//DD000018 DD  FLASH=(A1,1)
//DD000019 DD  FLASH=(A$,1)
//DD000020 DD  FLASH=(1234,32767)
//DD000021 DD  FLASH=(ABCD,65535)
//DD000022 DD  FLASH=($#@$,255)
//DD000023 DD  FLASH=(&OVERLAY,99)
//DD000024 DD  FLASH=(@X#Y,&COUNT)
//DD000025 DD  FLASH=(&OVERLAY,&COUNT)
//DD000101 DD  FLASH=NONE ahAH
//DD000102 DD  FLASH=1 ahAH
//DD000103 DD  FLASH=A ahAH
//DD000104 DD  FLASH=@ ahAH
//DD000105 DD  FLASH=1A ahAH
//DD000106 DD  FLASH=1# ahAH
//DD000107 DD  FLASH=A1 ahAH
//DD000108 DD  FLASH=A$ ahAH
//DD000109 DD  FLASH=1234 ahAH
//DD000110 DD  FLASH=ABCD ahAH
//DD000111 DD  FLASH=@#$@ ahAH
//DD000112 DD  FLASH=&FLASH ahAH
//DD000113 DD  FLASH=(1,1) ahAH
//DD000114 DD  FLASH=(A,1) ahAH
//DD000115 DD  FLASH=(@,1) ahAH
//DD000116 DD  FLASH=(1A,1) ahAH
//DD000117 DD  FLASH=(1#,1) ahAH
//DD000118 DD  FLASH=(A1,1) ahAH
//DD000119 DD  FLASH=(A$,1) ahAH
//DD000120 DD  FLASH=(1234,32767) ahAH
//DD000121 DD  FLASH=(ABCD,65535) ahAH
//DD000122 DD  FLASH=($#@$,255) ahAH
//DD000123 DD  FLASH=(&OVERLAY,99) ahAH
//DD000124 DD  FLASH=(@X#Y,&COUNT) ahAH
//DD000125 DD  FLASH=(&OVERLAY,&COUNT) ahAH
