//PATHDISP JOB
//*
//STEP0001 EXEC PGM=BPXBATCH
//DD000001 DD  PATHDISP=KEEP
//DD000002 DD  PATHDISP=DELETE
//DD000003 DD  PATHDISP=(KEEP)
//DD000004 DD  PATHDISP=(DELETE)
//DD000005 DD  PATHDISP=(,KEEP)
//DD000006 DD  PATHDISP=(,DELETE)
//DD000007 DD  PATHDISP=(KEEP,KEEP)
//DD000008 DD  PATHDISP=(KEEP,DELETE)
//DD000009 DD  PATHDISP=(DELETE,KEEP)
//DD000010 DD  PATHDISP=(DELETE,DELETE)
//DD000011 DD  PATHDISP=&PATHDISP
//DD000012 DD  PATHDISP=(&PATHDISP)
//DD000013 DD  PATHDISP=(,&PATHDISP)
//DD000014 DD  PATHDISP=(&PATHDISP,&PATHDISP)
//DD000101 DD  PATHDISP=KEEP PATHDISP
//DD000102 DD  PATHDISP=DELETE PATHDISP
//DD000103 DD  PATHDISP=(KEEP) PATHDISP
//DD000104 DD  PATHDISP=(DELETE) PATHDISP
//DD000105 DD  PATHDISP=(,KEEP) PATHDISP
//DD000106 DD  PATHDISP=(,DELETE) PATHDISP
//DD000107 DD  PATHDISP=(KEEP,KEEP) PATHDISP
//DD000108 DD  PATHDISP=(KEEP,DELETE) PATHDISP
//DD000109 DD  PATHDISP=(DELETE,KEEP) PATHDISP
//DD000110 DD  PATHDISP=(DELETE,DELETE) PATHDISP
//DD000111 DD  PATHDISP=&PATHDISP PATHDISP
//DD000112 DD  PATHDISP=(&PATHDISP) PATHDISP
//DD000113 DD  PATHDISP=(,&PATHDISP) PATHDISP
//DD000114 DD  PATHDISP=(&PATHDISP,&PATHDISP) PATHDISP

