//LIKE JOB
//*
//STEP0001 EXEC PGM=IDCAMS
//DD000001 DD  LIKE=A
//DD000002 DD  LIKE=@
//DD000003 DD  LIKE=A#
//DD000004 DD  LIKE=$A
//DD000005 DD  LIKE=A1
//DD000006 DD  LIKE=@1
//DD000007 DD  LIKE=&DSNHLQ..&DSNQ2..&DSNQ3.AEIOU
