//PROTECT JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  PROTECT=YES
//DD000002 DD  PROTECT=Y
//DD000003 DD  PROTECT=&PROTECT
//DD000004 DD  PROTECT=YES PROTECT
//DD000005 DD  PROTECT=Y PROTECT
//DD000006 DD  PROTECT=&PROTECT PROTECT

