//SYMBOLS JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  *,SYMBOLS=CNVTSYS
//DD000002 DD  *,SYMBOLS=EXECSYS
//DD000003 DD  *,SYMBOLS=JCLONLY
//DD000004 DD  *,SYMBOLS=(CNVTSYS)
//DD000005 DD  *,SYMBOLS=(EXECSYS)
//DD000006 DD  *,SYMBOLS=(JCLONLY)
//DD000007 DD  *,SYMBOLS=(CNVTSYS,LOGDD)
//DD000008 DD  *,SYMBOLS=(EXECSYS,LOGDD)
//DD000009 DD  *,SYMBOLS=(JCLONLY,LOGDD)
//DD000010 DD  *,SYMBOLS=(CNVTSYS,CNVTSYS)
//DD000011 DD  *,SYMBOLS=(EXECSYS,EXECSYS)
//DD000012 DD  *,SYMBOLS=(JCLONLY,JCLONLY)
//DD000013 DD  *,SYMBOLS=(CNVTSYS,&SYMBOLS)
//DD000014 DD  *,SYMBOLS=(EXECSYS,&SYMBOLS)
//DD000015 DD  *,SYMBOLS=(JCLONLY,&SYMBOLS)
//DD000016 DD  *,SYMBOLS=(&CNVTSYS)
//DD000017 DD  *,SYMBOLS=(&EXECSYS)
//DD000018 DD  *,SYMBOLS=(&JCLONLY)
//DD000019 DD  *,SYMBOLS=(&CNVTSYS,CNVTSYS)
//DD000020 DD  *,SYMBOLS=(&EXECSYS,EXECSYS)
//DD000021 DD  *,SYMBOLS=(&JCLONLY,JCLONLY)
//DD000022 DD  *,SYMBOLS=(&CNVTSYS,&CNVTSYS)
//DD000023 DD  *,SYMBOLS=(&EXECSYS,&EXECSYS)
//DD000024 DD  *,SYMBOLS=(&JCLONLY,&JCLONLY)
//DD000025 DD  *,SYMBOLS=&CNVTSYS
//DD000026 DD  *,SYMBOLS=&EXECSYS
//DD000027 DD  *,SYMBOLS=&JCLONLY
//DD000101 DD  *,SYMBOLS=CNVTSYS SYMBOLS
//DD000102 DD  *,SYMBOLS=EXECSYS SYMBOLS
//DD000103 DD  *,SYMBOLS=JCLONLY SYMBOLS
//DD000104 DD  *,SYMBOLS=(CNVTSYS) SYMBOLS
//DD000105 DD  *,SYMBOLS=(EXECSYS) SYMBOLS
//DD000106 DD  *,SYMBOLS=(JCLONLY) SYMBOLS
//DD000107 DD  *,SYMBOLS=(CNVTSYS,LOGDD) SYMBOLS
//DD000108 DD  *,SYMBOLS=(EXECSYS,LOGDD) SYMBOLS
//DD000109 DD  *,SYMBOLS=(JCLONLY,LOGDD) SYMBOLS
//DD000110 DD  *,SYMBOLS=(CNVTSYS,CNVTSYS) SYMBOLS
//DD000111 DD  *,SYMBOLS=(EXECSYS,EXECSYS) SYMBOLS
//DD000112 DD  *,SYMBOLS=(JCLONLY,JCLONLY) SYMBOLS
//DD000113 DD  *,SYMBOLS=(CNVTSYS,&SYMBOLS) SYMBOLS
//DD000114 DD  *,SYMBOLS=(EXECSYS,&SYMBOLS) SYMBOLS
//DD000115 DD  *,SYMBOLS=(JCLONLY,&SYMBOLS) SYMBOLS
//DD000116 DD  *,SYMBOLS=(&CNVTSYS) SYMBOLS
//DD000117 DD  *,SYMBOLS=(&EXECSYS) SYMBOLS
//DD000118 DD  *,SYMBOLS=(&JCLONLY) SYMBOLS
//DD000119 DD  *,SYMBOLS=(&CNVTSYS,CNVTSYS) SYMBOLS
//DD000120 DD  *,SYMBOLS=(&EXECSYS,EXECSYS) SYMBOLS
//DD000121 DD  *,SYMBOLS=(&JCLONLY,JCLONLY) SYMBOLS
//DD000122 DD  *,SYMBOLS=(&CNVTSYS,&CNVTSYS) SYMBOLS
//DD000123 DD  *,SYMBOLS=(&EXECSYS,&EXECSYS) SYMBOLS
//DD000124 DD  *,SYMBOLS=(&JCLONLY,&JCLONLY) SYMBOLS
//DD000125 DD  *,SYMBOLS=&CNVTSYS SYMBOLS
//DD000126 DD  *,SYMBOLS=&EXECSYS SYMBOLS
//DD000127 DD  *,SYMBOLS=&JCLONLY SYMBOLS

