//HOLD JOB
//*
//STEP0001 EXEC PGM=PRINT
//DD000001 DD  HOLD=YES
//DD000002 DD  HOLD=NO
//DD000003 DD  HOLD=Y
//DD000004 DD  HOLD=N
//DD000005 DD  HOLD=&HOLD
//DD000101 DD  HOLD=YES HOLD
//DD000102 DD  HOLD=NO HOLD
//DD000103 DD  HOLD=Y HOLD
//DD000104 DD  HOLD=N HOLD
//DD000105 DD  HOLD=&HOLD HOLD

