//EDSEL JOB
//*
//STEP001  EXEC PGM=IEFBR14,ACCT=A,COND=EVEN,DYNAMNBR=12345,
// MEMLIMIT=1M
//STEP002  EXEC PGM=IEFBR14,PARM=X,ACCT='A',,COND=ONLY,
// DYNAMNBR=12345,MEMLIMIT=1G
//STEP002A EXEC PGM=IEFBR14,PARM=XX,ACCT=(A),COND=(4,GT,STEP001),
// DYNAMNBR=12345,MEMLIMIT=1T
//STEP002B EXEC PGM=IEFBR14,PARM=1,ACCT=('A'),
// COND=((16,GE),(90,LE,STEP001),ONLY),
// DYNAMNBR=&DYNAM1&DYNAM2&DYNAM3,MEMLIMIT=&MEMLIMIT
//STEP002C EXEC PGM=IEFBR14,PARM=12,ACCT=(A,B),MEMLIMIT=1T,
//   COND=((8,LT,STEP001),(8,GT,STEP001A)),DYNAMNBR=12345
//STEP002D EXEC PGM=IEFBR14,PARM=#,ACCT=('A',B),DYNAMNBR=12345,
// COND=((16,GE),(90,LE,STEP001),(31,EQ,STEP002B),EVEN),MEMLIMIT=1P
//STEP002E EXEC PGM=IEFBR14,PARM=#$,ACCT=(A,'B'),
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN),DYNAMNBR=12345,MEMLIMIT=1M
//STEP002F EXEC PGM=IEFBR14,PARM=X1,ACCT=A1,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN),
//  DYNAMNBR=12345,
//  MEMLIMIT=1G
//STEP002G EXEC PGM=IEFBR14,PARM=XX1,ACCT='A1',MEMLIMIT=1M,
// DYNAMNBR=12345,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002H EXEC PGM=IEFBR14,PARM=XX11,ACCT=(A1),MEMLIMIT=1G,
// DYNAMNBR=12345,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002I EXEC PGM=IEFBR14,PARM=1X,ACCT=('A1'),MEMLIMIT=1G,
// DYNAMNBR=12345,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002J EXEC PGM=IEFBR14,PARM=11X,ACCT=(A1,B2),MEMLIMIT=1G,
// DYNAMNBR=12345,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002K EXEC PGM=IEFBR14,PARM=11XX,ACCT=('A1',B2),MEMLIMIT=1G,
// DYNAMNBR=12345,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002L EXEC PGM=IEFBR14,PARM=X@,ACCT=(A1,'B2'),MEMLIMIT=&MEMLIMIT,
// DYNAMNBR=12345,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002M EXEC PGM=IEFBR14,PARM=XX@,ACCT=('A1','B2'),MEMLIMIT=1G,
// DYNAMNBR=12345,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP006  EXEC PGM=IEFBR14,PARM=&AB,COND=(4,LT),MEMLIMIT=&MEMLIMIT
//STEP007  EXEC PGM=IEFBR14,PARM=&A.1,COND=(0,NE),MEMLIMIT=&MEM&UNIT
//STEP008  EXEC PGM=IEFBR14,PARM=ZZ&A,COND=EVEN,MEMLIMIT=1T
//STEP009  EXEC PGM=IEFBR14,PARM=ZZ&A.1,MEMLIMIT=&MEM1&MEM2&MEM3
//STEP010  EXEC PGM=IEFBR14,PARM='AND A ONE AND A TWO AND
//       A THREE AND A FOUR',MEMLIMIT=&MEMLIMIT,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN),DYNAMNBR=12345
//STEP011  EXEC PGM=IEFBR14,PARM=(A,B,C,D,E,F,G),MEMLIMIT=77T
//STEP012  EXEC PGM=IEFBR14,PARM=(A,              PARM 1
//  B,                                            PARM 2
//    C,                                          PARM 3
// D,                                             PARM 4
//         E,                                     PARM 5
//      F,                                        PARM 6
//        G),MEMLIMIT=&MEMLIMIT,                  PARM 7
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN),DYNAMNBR=12345
//STEP013  EXEC PGM=IEFBR14,
// PARM=(A,
// B,
// C,
// D,
// E,F,
//         G),MEMLIMIT=4G,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN),DYNAMNBR=12345
//STEP014  EXEC PGM=IEFBR14,PARM=('ABC',&A,7,'BLAH
//  BLAH BLAH'),COND=(333,EQ,STEP011),DYNAMNBR=12345,MEMLIMIT=5T
//STEP015  EXEC PGM=IEFBR14,PARM=X,COND=ONLY,MEMLIMIT=3P moo
