//MESSAGE JOB
/*MESSAGE A MESSAGE... SINCE BEFORE YOUR SUN BURNED HOT IN SPACE I
/*MESSAGE HAVE WAITED FOR... A MESSAGE
/*NETACCT 271828182845904523536028747135266249775724709369996
/*NOTIFY GORRAM/DREN
/*PRIORITY 9
// EXEC PGM=IEFBR14

