//ROACCESS JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  ROACCESS=ALLOW
//DD000002 DD  ROACCESS=DISALLOW
//DD000003 DD  ROACCESS=(ALLOW)
//DD000004 DD  ROACCESS=(DISALLOW)
//DD000005 DD  ROACCESS=(ALLOW,EXTLOCK)
//DD000006 DD  ROACCESS=(ALLOW,TRKLOCK)
//DD000007 DD  ROACCESS=&SYMBOLIC
//DD000008 DD  ROACCESS=(&SYMBOLIC)
//DD000009 DD  ROACCESS=(ALLOW,&SYMBOLIC)
//DD000010 DD  ROACCESS=(&SYMBOLIC,EXTLOCK)
//DD000011 DD  ROACCESS=(&ROACCESS,TRKLOCK)
//DD000012 DD  ROACCESS=(&RQST,&LOCK)
//DD000101 DD  ROACCESS=ALLOW ROACCESS
//DD000102 DD  ROACCESS=DISALLOW ROACCESS
//DD000103 DD  ROACCESS=(ALLOW) ROACCESS
//DD000104 DD  ROACCESS=(DISALLOW) ROACCESS
//DD000105 DD  ROACCESS=(ALLOW,EXTLOCK) ROACCESS
//DD000106 DD  ROACCESS=(ALLOW,TRKLOCK) ROACCESS
//DD000107 DD  ROACCESS=&SYMBOLIC ROACCESS
//DD000108 DD  ROACCESS=(&SYMBOLIC) ROACCESS
//DD000109 DD  ROACCESS=(ALLOW,&SYMBOLIC) ROACCESS
//DD000110 DD  ROACCESS=(&SYMBOLIC,EXTLOCK) ROACCESS
//DD000111 DD  ROACCESS=(&ROACCESS,TRKLOCK) ROACCESS
//DD000112 DD  ROACCESS=(&RQST,&LOCK) ROACCESS

