//KEYENCD2 JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  KEYENCD2=L
//DD000002 DD  KEYENCD2=H
//DD000003 DD  KEYENCD2=&KEYENCD2
//DD000101 DD  KEYENCD2=L KEYENCD2
//DD000102 DD  KEYENCD2=H KEYENCD2
//DD000103 DD  KEYENCD2=&KEYENCD2 KEYENCD2
