//DDAMP JOB 
//*
//STEP0001 EXEC PGM=IDCAMS
//DD0001   DD  AMP='AMORG,ACCBIAS=USER'
//DD0002   DD  AMP='AMORG,ACCBIAS=SYSTEM,RMODE31=ALL'
//DD0003   DD  AMP=('AMORG,ACCBIAS=SYSTEM,RMODE31=ALL')
//DD0004   DD  AMP=('AMORG',
// 'ACCBIAS=SYSTEM',
// 'RECFM=VB',
// 'BUFSP=200,RMODE31=ALL')
//DD0005   DD  AMP=AMORG
//DD0006   DD  AMP=(AMORG)
//DD0007   DD  AMP='AMORG'
//DD0008   DD  AMP=('AMORG')
//DD0011   DD  AMP='AMORG,ACCBIAS=USER' AMP
//DD0012   DD  AMP='AMORG,ACCBIAS=SYSTEM,RMODE31=ALL' AMP
//DD0013   DD  AMP=('AMORG,ACCBIAS=SYSTEM,RMODE31=ALL') AMP
//DD0014   DD  AMP=('AMORG', AMORG
// 'ACCBIAS=SYSTEM', ACCBIAS
// 'RECFM=VB', RECFM
// 'BUFSP=200,RMODE31=ALL') BUFSP RMODE31
//DD0015   DD  AMP=AMORG     AMORG
//DD0016   DD  AMP=(AMORG)   AMORG
//DD0017   DD  AMP='AMORG'   AMORG
//DD0018   DD  AMP=('AMORG') AMORG
//DD0019   DD  AMP=(TRACE=(HOOK=(1)))
//DD0020   DD  AMP=('TRACE=(HOOK=(1,2,3,4,5,6,7,8,9)',
//            'ECODE=ANY',
//            'KEY=F1F2F3F4F5F6',
//            'PARM1=A1B2C3D4E5F6',
//            'PARM2=F1E2D3C4B5A6)')

