//DSNAME JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  DSN=A1
//DD000002 DD  DSN=AB
//DD000003 DD  DSN=ABC
//DD000004 DD  DSN=ABCD
//DD000005 DD  DSN=ABCDE
//DD000006 DD  DSN=ABCDEF
//DD000007 DD  DSN=ABCDEFG
//DD000008 DD  DSN=ABCDEFGH
//DD000011 DD  DSN=A.A
//DD000012 DD  DSN=AB.AB
//DD000013 DD  DSN=ABC.ABC
//DD000014 DD  DSN=ABCD.ABCD
//DD000015 DD  DSN=ABCDE.ABCDE
//DD000016 DD  DSN=ABCDEF.ABCDEF
//DD000017 DD  DSN=ABCDEFG.ABCDEFG
//DD000018 DD  DSN=ABCDEFGH.ABCDEFGH
//DD000021 DD  DSN=@1
//DD000022 DD  DSN=@B
//DD000023 DD  DSN=@BC
//DD000024 DD  DSN=@BCD
//DD000025 DD  DSN=@BCDE
//DD000026 DD  DSN=@BCDEF
//DD000027 DD  DSN=@BCDEFG
//DD000028 DD  DSN=@BCDEFGH
//DD000031 DD  DSN=A.#
//DD000032 DD  DSN=AB.#B
//DD000033 DD  DSN=ABC.#BC
//DD000034 DD  DSN=ABCD.#BCD
//DD000035 DD  DSN=ABCDE.#BCDE
//DD000036 DD  DSN=ABCDEF.#BCDEF
//DD000037 DD  DSN=ABCDEFG.#BCDEFG
//DD000038 DD  DSN=ABCDEFGH.#BCDEFGH
//DD000039 DD  DSN=&DSN
//DD000040 DD  DSN=&DSNQ1..&DSNQ2..&DSNQ3
//DD000041 DD  DSN=&Q1.A.&Q2.B.&Q3.C
//DD000042 DD  DSN=A.&B..C
//DD000043 DD  DSN=&SYSUID..JCL.CNTL(ZZZ)
//DD000044 DD  DSN=PROD.ACCT(0)
//DD000045 DD  DSN=PROD.ACCT(+1)
//DD000046 DD  DSN=PROD.ACCT(-1)
//DD000047 DD  DSN=PROD.ACCT.G0099V00
//DD000048 DD  DSN=&&DSN
//DD000049 DD  DSN=&&DSN(MEM)
//DD000050 DD  DSN=*.DD
//DD000051 DD  DSN=*.STEP.DD
//DD000052 DD  DSN=*.STEP.PROCSTEP.DD
//DD000053 DD  DSN=NULLFILE
//DD000054 DD  DSN='THIS IS VALID'
//DD000055 DD  DSN=A-B.C-D.@@##$$00
//DD000101 DD  DSNAME=A1
//DD000102 DD  DSNAME=AB
//DD000103 DD  DSNAME=ABC
//DD000104 DD  DSNAME=ABCD
//DD000105 DD  DSNAME=ABCDE
//DD000106 DD  DSNAME=ABCDEF
//DD000107 DD  DSNAME=ABCDEFG
//DD000108 DD  DSNAME=ABCDEFGH
//DD000111 DD  DSNAME=A.A
//DD000112 DD  DSNAME=AB.AB
//DD000113 DD  DSNAME=ABC.ABC
//DD000114 DD  DSNAME=ABCD.ABCD
//DD000115 DD  DSNAME=ABCDE.ABCDE
//DD000116 DD  DSNAME=ABCDEF.ABCDEF
//DD000117 DD  DSNAME=ABCDEFG.ABCDEFG
//DD000118 DD  DSNAME=ABCDEFGH.ABCDEFGH
//DD000121 DD  DSNAME=@1
//DD000122 DD  DSNAME=@B
//DD000123 DD  DSNAME=@BC
//DD000124 DD  DSNAME=@BCD
//DD000125 DD  DSNAME=@BCDE
//DD000126 DD  DSNAME=@BCDEF
//DD000127 DD  DSNAME=@BCDEFG
//DD000128 DD  DSNAME=@BCDEFGH
//DD000131 DD  DSNAME=A.#
//DD000132 DD  DSNAME=AB.#B
//DD000133 DD  DSNAME=ABC.#BC
//DD000134 DD  DSNAME=ABCD.#BCD
//DD000135 DD  DSNAME=ABCDE.#BCDE
//DD000136 DD  DSNAME=ABCDEF.#BCDEF
//DD000137 DD  DSNAME=ABCDEFG.#BCDEFG
//DD000138 DD  DSNAME=ABCDEFGH.#BCDEFGH
//DD000139 DD  DSNAME=&DSN
//DD000140 DD  DSNAME=&DSNQ1..&DSNQ2..&DSNQ3
//DD000141 DD  DSNAME=&Q1.A.&Q2.B.&Q3.C
//DD000142 DD  DSNAME=A.&B..C
//DD000143 DD  DSNAME=&SYSUID..JCL.CNTL(ZZZ)
//DD000144 DD  DSNAME=PROD.ACCT(0)
//DD000145 DD  DSNAME=PROD.ACCT(+1)
//DD000146 DD  DSNAME=PROD.ACCT(-1)
//DD000147 DD  DSNAME=PROD.ACCT.G0099V00
//DD000148 DD  DSNAME=&&DSN
//DD000149 DD  DSNAME=&&DSN(MEM)
//DD000150 DD  DSNAME=*.DD
//DD000151 DD  DSNAME=*.STEP.DD
//DD000152 DD  DSNAME=*.STEP.PROCSTEP.DD
//DD000153 DD  DSNAME=NULLFILE
//DD000154 DD  DSNAME='THIS IS VALID'
//DD000155 DD  DSNAME=A-B.C-D.@@##$$00
//DD000001 DD  DSN=A1  COMMENT
//DD000202 DD  DSN=AB  COMMENT
//DD000203 DD  DSN=ABC  COMMENT
//DD000204 DD  DSN=ABCD  COMMENT
//DD000205 DD  DSN=ABCDE  COMMENT
//DD000206 DD  DSN=ABCDEF  COMMENT
//DD000207 DD  DSN=ABCDEFG  COMMENT
//DD000208 DD  DSN=ABCDEFGH  COMMENT
//DD000211 DD  DSN=A.A  COMMENT
//DD000212 DD  DSN=AB.AB  COMMENT
//DD000213 DD  DSN=ABC.ABC  COMMENT
//DD000214 DD  DSN=ABCD.ABCD  COMMENT
//DD000215 DD  DSN=ABCDE.ABCDE  COMMENT
//DD000216 DD  DSN=ABCDEF.ABCDEF  COMMENT
//DD000217 DD  DSN=ABCDEFG.ABCDEFG  COMMENT
//DD000218 DD  DSN=ABCDEFGH.ABCDEFGH  COMMENT
//DD000221 DD  DSN=@1  COMMENT
//DD000222 DD  DSN=@B  COMMENT
//DD000223 DD  DSN=@BC  COMMENT
//DD000224 DD  DSN=@BCD  COMMENT
//DD000225 DD  DSN=@BCDE  COMMENT
//DD000226 DD  DSN=@BCDEF  COMMENT
//DD000227 DD  DSN=@BCDEFG  COMMENT
//DD000228 DD  DSN=@BCDEFGH  COMMENT
//DD000231 DD  DSN=A.#  COMMENT
//DD000232 DD  DSN=AB.#B  COMMENT
//DD000233 DD  DSN=ABC.#BC  COMMENT
//DD000234 DD  DSN=ABCD.#BCD  COMMENT
//DD000235 DD  DSN=ABCDE.#BCDE  COMMENT
//DD000236 DD  DSN=ABCDEF.#BCDEF  COMMENT
//DD000237 DD  DSN=ABCDEFG.#BCDEFG  COMMENT
//DD000238 DD  DSN=ABCDEFGH.#BCDEFGH  COMMENT
//DD000239 DD  DSN=&DSN  COMMENT
//DD000240 DD  DSN=&DSNQ1..&DSNQ2..&DSNQ3  COMMENT
//DD000241 DD  DSN=&Q1.A.&Q2.B.&Q3.C  COMMENT
//DD000242 DD  DSN=A.&B..C  COMMENT
//DD000243 DD  DSN=&SYSUID..JCL.CNTL(ZZZ)  COMMENT
//DD000244 DD  DSN=PROD.ACCT(0)  COMMENT
//DD000245 DD  DSN=PROD.ACCT(+1)  COMMENT
//DD000246 DD  DSN=PROD.ACCT(-1)  COMMENT
//DD000247 DD  DSN=PROD.ACCT.G0099V00  COMMENT
//DD000248 DD  DSN=&&DSN  COMMENT
//DD000249 DD  DSN=&&DSN(MEM)  COMMENT
//DD000250 DD  DSN=*.DD  COMMENT
//DD000251 DD  DSN=*.STEP.DD  COMMENT
//DD000252 DD  DSN=*.STEP.PROCSTEP.DD  COMMENT
//DD000253 DD  DSN=NULLFILE  COMMENT
//DD000254 DD  DSN='THIS IS VALID'  COMMENT
//DD000255 DD  DSN=A-B.C-D.@@##$$00  COMMENT
//DD000301 DD  DSNAME=A1  COMMENT
//DD000302 DD  DSNAME=AB  COMMENT
//DD000303 DD  DSNAME=ABC  COMMENT
//DD000304 DD  DSNAME=ABCD  COMMENT
//DD000305 DD  DSNAME=ABCDE  COMMENT
//DD000306 DD  DSNAME=ABCDEF  COMMENT
//DD000307 DD  DSNAME=ABCDEFG  COMMENT
//DD000308 DD  DSNAME=ABCDEFGH  COMMENT
//DD000311 DD  DSNAME=A.A  COMMENT
//DD000312 DD  DSNAME=AB.AB  COMMENT
//DD000313 DD  DSNAME=ABC.ABC  COMMENT
//DD000314 DD  DSNAME=ABCD.ABCD  COMMENT
//DD000315 DD  DSNAME=ABCDE.ABCDE  COMMENT
//DD000316 DD  DSNAME=ABCDEF.ABCDEF  COMMENT
//DD000317 DD  DSNAME=ABCDEFG.ABCDEFG  COMMENT
//DD000318 DD  DSNAME=ABCDEFGH.ABCDEFGH  COMMENT
//DD000321 DD  DSNAME=@1  COMMENT
//DD000322 DD  DSNAME=@B  COMMENT
//DD000323 DD  DSNAME=@BC  COMMENT
//DD000324 DD  DSNAME=@BCD  COMMENT
//DD000325 DD  DSNAME=@BCDE  COMMENT
//DD000326 DD  DSNAME=@BCDEF  COMMENT
//DD000327 DD  DSNAME=@BCDEFG  COMMENT
//DD000328 DD  DSNAME=@BCDEFGH  COMMENT
//DD000331 DD  DSNAME=A.#  COMMENT
//DD000332 DD  DSNAME=AB.#B  COMMENT
//DD000333 DD  DSNAME=ABC.#BC  COMMENT
//DD000334 DD  DSNAME=ABCD.#BCD  COMMENT
//DD000335 DD  DSNAME=ABCDE.#BCDE  COMMENT
//DD000336 DD  DSNAME=ABCDEF.#BCDEF  COMMENT
//DD000337 DD  DSNAME=ABCDEFG.#BCDEFG  COMMENT
//DD000338 DD  DSNAME=ABCDEFGH.#BCDEFGH  COMMENT
//DD000339 DD  DSNAME=&DSN  COMMENT
//DD000340 DD  DSNAME=&DSNQ1..&DSNQ2..&DSNQ3  COMMENT
//DD000341 DD  DSNAME=&Q1.A.&Q2.B.&Q3.C  COMMENT
//DD000342 DD  DSNAME=A.&B..C  COMMENT
//DD000343 DD  DSNAME=&SYSUID..JCL.CNTL(ZZZ)  COMMENT
//DD000344 DD  DSNAME=PROD.ACCT(0)  COMMENT
//DD000345 DD  DSNAME=PROD.ACCT(+1)  COMMENT
//DD000346 DD  DSNAME=PROD.ACCT(-1)  COMMENT
//DD000347 DD  DSNAME=PROD.ACCT.G0099V00  COMMENT
//DD000348 DD  DSNAME=&&DSN  COMMENT
//DD000349 DD  DSNAME=&&DSN(MEM)  COMMENT
//DD000350 DD  DSNAME=*.DD  COMMENT
//DD000351 DD  DSNAME=*.STEP.DD  COMMENT
//DD000352 DD  DSNAME=*.STEP.PROCSTEP.DD  COMMENT
//DD000353 DD  DSNAME=NULLFILE  COMMENT
//DD000354 DD  DSNAME='THIS IS VALID'  COMMENT
//DD000355 DD  DSNAME=A-B.C-D.@@##$$00 COMMENT
