//SYMBOLS JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  *,SYMBOLS=CNVTSYS,LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000002 DD  *,SYMBOLS=EXECSYS,LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000003 DD  *,SYMBOLS=JCLONLY,LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000004 DD  *,SYMBOLS=(CNVTSYS),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000005 DD  *,SYMBOLS=(EXECSYS),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000006 DD  *,SYMBOLS=(JCLONLY),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000007 DD  *,SYMBOLS=(CNVTSYS,LOGDD),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000008 DD  *,SYMBOLS=(EXECSYS,LOGDD),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000009 DD  *,SYMBOLS=(JCLONLY,LOGDD),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000010 DD  *,SYMBOLS=(CNVTSYS,CNVTSYS),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000011 DD  *,SYMBOLS=(EXECSYS,EXECSYS),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000012 DD  *,SYMBOLS=(JCLONLY,JCLONLY),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000013 DD  *,SYMBOLS=(CNVTSYS,&SYMBOLS),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000014 DD  *,SYMBOLS=(EXECSYS,&SYMBOLS),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000015 DD  *,SYMBOLS=(JCLONLY,&SYMBOLS),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000016 DD  *,SYMBOLS=(&CNVTSYS),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000017 DD  *,SYMBOLS=(&EXECSYS),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000018 DD  *,SYMBOLS=(&JCLONLY),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000019 DD  *,SYMBOLS=(&CNVTSYS,CNVTSYS),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000020 DD  *,SYMBOLS=(&EXECSYS,EXECSYS),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000021 DD  *,SYMBOLS=(&JCLONLY,JCLONLY),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000022 DD  *,SYMBOLS=(&CNVTSYS,&CNVTSYS),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000023 DD  *,SYMBOLS=(&EXECSYS,&EXECSYS),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000024 DD  *,SYMBOLS=(&JCLONLY,&JCLONLY),LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000025 DD  *,SYMBOLS=&CNVTSYS,LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000026 DD  *,SYMBOLS=&EXECSYS,LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000027 DD  *,SYMBOLS=&JCLONLY,LRECL=80,DLM=$$
aeiou and sometimes y
$$
//DD000101 DD  *,SYMBOLS=CNVTSYS,LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000102 DD  *,SYMBOLS=EXECSYS,LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000103 DD  *,SYMBOLS=JCLONLY,LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000104 DD  *,SYMBOLS=(CNVTSYS),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000105 DD  *,SYMBOLS=(EXECSYS),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000106 DD  *,SYMBOLS=(JCLONLY),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000107 DD  *,SYMBOLS=(CNVTSYS,LOGDD),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000108 DD  *,SYMBOLS=(EXECSYS,LOGDD),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000109 DD  *,SYMBOLS=(JCLONLY,LOGDD),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000110 DD  *,SYMBOLS=(CNVTSYS,CNVTSYS),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000111 DD  *,SYMBOLS=(EXECSYS,EXECSYS),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000112 DD  *,SYMBOLS=(JCLONLY,JCLONLY),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000113 DD  *,SYMBOLS=(CNVTSYS,&SYMBOLS),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000114 DD  *,SYMBOLS=(EXECSYS,&SYMBOLS),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000115 DD  *,SYMBOLS=(JCLONLY,&SYMBOLS),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000116 DD  *,SYMBOLS=(&CNVTSYS),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000117 DD  *,SYMBOLS=(&EXECSYS),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000118 DD  *,SYMBOLS=(&JCLONLY),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000119 DD  *,SYMBOLS=(&CNVTSYS,CNVTSYS),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000120 DD  *,SYMBOLS=(&EXECSYS,EXECSYS),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000121 DD  *,SYMBOLS=(&JCLONLY,JCLONLY),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000122 DD  *,SYMBOLS=(&CNVTSYS,&CNVTSYS),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000123 DD  *,SYMBOLS=(&EXECSYS,&EXECSYS),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000124 DD  *,SYMBOLS=(&JCLONLY,&JCLONLY),LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000125 DD  *,SYMBOLS=&CNVTSYS,LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000126 DD  *,SYMBOLS=&EXECSYS,LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$
//DD000127 DD  *,SYMBOLS=&JCLONLY,LRECL=80,DLM=$$ SYMBOLS
aeiou and sometimes y
$$

