//RLS JOB
//*
//STEP0001 EXEC PGM=BATCH
//DD000001 DD  RLS=NRI
//DD000002 DD  RLS=CR
//DD000003 DD  RLS=CRE
//DD000004 DD  RLS=&RLS
//DD000005 DD  RLS=NRI RLS
//DD000006 DD  RLS=CR RLS
//DD000007 DD  RLS=CRE RLS
//DD000008 DD  RLS=&RLS RLS

