//THEQUAD PROC A=4,  FOUR
//           B=8,   EIGHT
//           C=15,  FIFTEEN
//           D=16,  SIXTEEN
//           E=23,  TWENTY-THREE
//           F=42   FORTY-TWO
// EXEC PGM=IEFBR14

