//ROUTE JOB
/*ROUTE PRINT RMT17
/*ROUTE PRINT QRESH:CSCHNEID
/*ROUTE PRINT WESTERLY/CSCHNEID
/*ROUTE PRINT LEITH.CSCHNEID
/*ROUTE PRINT ARKYN(CSCHNEID)
/*ROUTE PUNCH RMT11
/*ROUTE PUNCH QRESH:CSCHNEID
/*ROUTE PUNCH WESTERLY/CSCHNEID
/*ROUTE PUNCH LEITH.CSCHNEID
/*ROUTE PUNCH ARKYN(CSCHNEID)
/*ROUTE XEQ N0
/*ROUTE XEQ QRESH:CSCHNEID
/*ROUTE XEQ WESTERLY/CSCHNEID
/*ROUTE XEQ LEITH.CSCHNEID
/*ROUTE XEQ ARKYN(CSCHNEID)
// EXEC PGM=IEFBR14
