//AEIOU JOB
//*
//STEP001  EXEC PGM=IEFBR14
//STEP002  EXEC PGM=IEFBR14,PARM=X
//STEP002A EXEC PGM=IEFBR14,PARM=XX
//STEP002B EXEC PGM=IEFBR14,PARM=1
//STEP002C EXEC PGM=IEFBR14,PARM=12
//STEP002D EXEC PGM=IEFBR14,PARM=#
//STEP002E EXEC PGM=IEFBR14,PARM=#$
//STEP002F EXEC PGM=IEFBR14,PARM=X1
//STEP002G EXEC PGM=IEFBR14,PARM=XX1
//STEP002H EXEC PGM=IEFBR14,PARM=XX11
//STEP002I EXEC PGM=IEFBR14,PARM=1X
//STEP002J EXEC PGM=IEFBR14,PARM=11X
//STEP002K EXEC PGM=IEFBR14,PARM=11XX
//STEP002L EXEC PGM=IEFBR14,PARM=X@
//STEP002M EXEC PGM=IEFBR14,PARM=XX@
//STEP002N EXEC PGM=IEFBR14,PARM=XX@@
//STEP002O EXEC PGM=IEFBR14,PARM=1@
//STEP002P EXEC PGM=IEFBR14,PARM=11@
//STEP002Q EXEC PGM=IEFBR14,PARM=11@@
//STEP002R EXEC PGM=IEFBR14,PARM=X1@
//STEP002S EXEC PGM=IEFBR14,PARM=XX1@
//STEP002T EXEC PGM=IEFBR14,PARM=XX11@
//STEP002U EXEC PGM=IEFBR14,PARM=XX11@@
//STEP002V EXEC PGM=IEFBR14,PARM=1X@
//STEP003  EXEC PGM=IEFBR14,PARM='X'
//STEP004  EXEC PGM=IEFBR14,PARM='A1@/STGRPT(ON)'
//STEP005  EXEC PGM=IEFBR14,PARM=&A
//STEP006  EXEC PGM=IEFBR14,PARM=&AB
//STEP007  EXEC PGM=IEFBR14,PARM=&A.1
//STEP008  EXEC PGM=IEFBR14,PARM=ZZ&A
//STEP009  EXEC PGM=IEFBR14,PARM=ZZ&A.1
//STEP010  EXEC PGM=IEFBR14,PARM='AND A ONE AND A TWO AND
//       A THREE AND A FOUR'
//STEP011  EXEC PGM=IEFBR14,PARM=(A,B,C,D,E,F,G)
//STEP012  EXEC PGM=IEFBR14,PARM=(A,              PARM 1
//  B,                                            PARM 2
//    C,                                          PARM 3
// D,                                             PARM 4
//         E,                                     PARM 5
//      F,                                        PARM 6
//        G)                                      PARM 7
//STEP013  EXEC PGM=IEFBR14,
// PARM=(A,
// B,
// C,
// D,
// E,F,
//         G)
//STEP014  EXEC PGM=IEFBR14,PARM=('ABC',&A,7,'BLAH
//  BLAH BLAH')
//STEP015  EXEC PGM=IEFBR14,PARM=X moo
//STEP016  EXEC IAYEAYE,PARM.STEPA=X
//STEP017  EXEC IAYEAYE,PARM.STEPA=X,PARM.STEPB=Y
//STEP018  EXEC IAYEAYE,
// PARM.STEPA=(A,B,C),
// PARM.STEPB=(D,E,F)
//STEP019  EXEC IAYEAYE,
// PARM.STEPA=(&A1,&B2,&C3),
// PARM.STEPB=(&D4,&E5,&F6)
//STEP020  EXEC IAYEAYE,
// PARM.STEPA=(&A1,&B2,&C3),
// PARM.STEPB=(&D4,&E5,&F6),
// PARM.STEPC=(&A1,&B2,&C3,&D4),
// PARM.STEPD=(&A1,
// &B2,&C3,&D4,&E5,&F6)
