//MAXGENS JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  MAXGENS=1
//DD000002 DD  MAXGENS=255
//DD000003 DD  MAXGENS=9999
//DD000004 DD  MAXGENS=&MAXGENS
//DD000011 DD  MAXGENS=1 MAXGENS
//DD000012 DD  MAXGENS=255 MAXGENS
//DD000013 DD  MAXGENS=9999 MAXGENS
//DD000014 DD  MAXGENS=&MAXGENS MAXGENS

