//FILEDATA JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  FILEDATA=BINARY
//DD000002 DD  FILEDATA=RECORD
//DD000003 DD  FILEDATA=TEXT
//DD000004 DD  FILEDATA=&FILEDATA
//DD000101 DD  FILEDATA=BINARY FILEDATA
//DD000102 DD  FILEDATA=RECORD FILEDATA
//DD000103 DD  FILEDATA=TEXT FILEDATA
//DD000104 DD  FILEDATA=&FILEDATA FILEDATA

