//DATA JOB
//*
//STEP0001 EXEC PGM=IEBGENER
//DD000001 DD  DATA
EGGS
/*
//DD000002 DD  DATA
BACON
/*
//*
//DD000003 DD  DATA
HAM
AND
EGGS
/*
//DD000004 DD  DATA,DLM=$$
//AJOB JOB
//STEPA EXEC PGM=IEFBR14
/*
$$
//DD000005 DD  DATA
ABC
/*
//         DD  DATA
DEF
/*
//DD000006 DD  DATA,DLM='!!'
QRS
!!
//         DD  DATA,DLM='@@'
TUV
@@
//DD000101 DD  DATA DATA
EGGS
/*
//DD000102 DD  DATA DATA
BACON
/*
//*
//DD000103 DD  DATA DATA
HAM
AND
EGGS
/*
//DD000104 DD  DATA,DLM='$$' DLM
//AJOB JOB
//STEPA EXEC PGM=IEFBR14
/*
$$
//DD000105 DD  DATA DATA
ABC
/*
//         DD  DATA DATA
DEF
/*
//DD000106 DD  DATA,DLM='!!' DLM
QRS
!!
//         DD  DATA,DLM='@@' DLM
TUV
@@
