//OUTPUT JOB
//* comment
//@0000001 OUTPUT ADDRESS='1234 Triskelion' comment
//@0000002 OUTPUT ADDRESS=('1234 Triskelion') comment
//@0000003 OUTPUT ADDRESS=ENTERPRISE comment
//@0000004 OUTPUT ADDRESS=(ENTERPRISE) comment
//@0000005 OUTPUT ADDRESS=('1234 Triskelion','Gamester Way') comment
//@0000006 OUTPUT ADDRESS=('The old house at the end of the lane', comm
//             'With no windows','and no doors save for the one', comme
//             'leading into the cellar from which no one returns') com
//@0000007 OUTPUT AFPPARMS=PROD.SYS.AFPPARMS comment
//@0000008 OUTPUT AFPPARMS=&DSNHLQ..AFPPARMS comment
//@0000009 OUTPUT AFPSTATS=YES comment
//@0000010 OUTPUT AFPSTATS=Y comment
//@0000011 OUTPUT AFPSTATS=NO comment
//@0000012 OUTPUT AFPSTATS=N comment
//@0000013 OUTPUT AFPSTATS=&AFPSTATS comment
//@0000014 OUTPUT BUILDING=/-+&*.ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789 c
//@0000015 OUTPUT BUILDING='/-+&*.ABCDEFGHIJKLMNOPQRSTUVWXYZ01234567' c
//@0000016 OUTPUT BUILDING='O''Brian Center for Science' comment
//@0000017 OUTPUT BUILDING=&BUILDING comment
//@0000018 OUTPUT BURST=YES comment
//@0000019 OUTPUT BURST=Y comment
//@0000020 OUTPUT BURST=NO comment
//@0000021 OUTPUT BURST=N comment
//@0000022 OUTPUT BURST=&BURST comment
//@0000023 OUTPUT CHARS=STD comment
//@0000024 OUTPUT CHARS=DUMP comment
//@0000025 OUTPUT CHARS=@#$1 comment
//@0000026 OUTPUT CHARS=A comment
//@0000027 OUTPUT CHARS=A1 comment
//@0000028 OUTPUT CHARS=A#1 comment
//@0000029 OUTPUT CHARS=(A,B,C,D) comment
//@0000030 OUTPUT CHARS=(DUMP,1,2,3) comment
//@0000031 OUTPUT CHARS=(DUMP,STD) comment
//@0000032 OUTPUT CHARS=(STD) comment
//@0000033 OUTPUT CHARS=(DUMP) comment
//@0000034 OUTPUT CHARS=(@#$1) comment
//@0000035 OUTPUT CHARS=(A) comment
//@0000036 OUTPUT CHARS=(A1) comment
//@0000037 OUTPUT CHARS=(A#1) comment
//@0000038 OUTPUT CHARS=&CHARS comment
//@0000039 OUTPUT CHARS=(&CHARS1,&CHARS2,&CHARS3,&CHARS4) comment
//@0000040 OUTPUT CKPTLINE=1 comment
//@0000041 OUTPUT CKPTLINE=32767 comment
//@0000042 OUTPUT CKPTLINE=&CKPTLINE comment
//@0000043 OUTPUT CKPTPAGE=1 comment
//@0000044 OUTPUT CKPTPAGE=32767 comment
//@0000045 OUTPUT CKPTPAGE=&CKPTPAGE comment
//@0000046 OUTPUT CKPTSEC=1 comment
//@0000047 OUTPUT CKPTSEC=32767 comment
//@0000048 OUTPUT CKPTSEC=&CKPTSEC comment
//@0000049 OUTPUT CLASS=A comment
//@0000050 OUTPUT CLASS=0 comment
//@0000051 OUTPUT CLASS=* comment
//@0000052 OUTPUT CLASS='B' comment
//@0000053 OUTPUT CLASS='9' comment
//@0000054 OUTPUT CLASS='*' comment
//@0000055 OUTPUT CLASS= comment
//@0000056 OUTPUT CLASS=&CLASS comment
//@0000057 OUTPUT COLORMAP=A comment
//@0000058 OUTPUT COLORMAP=$ comment
//@0000059 OUTPUT COLORMAP=#0000001 comment
//@0000060 OUTPUT COLORMAP=&COLORMAP comment
//@0000061 OUTPUT COMSETUP=A comment
//@0000062 OUTPUT COMSETUP=@ comment
//@0000063 OUTPUT COMSETUP=A1 comment
//@0000064 OUTPUT COMSETUP=#1 comment
//@0000065 OUTPUT COMSETUP=$#@123XY comment
//@0000066 OUTPUT COMSETUP=&COMSETUP comment
//@0000067 OUTPUT CONTROL=PROGRAM comment
//@0000068 OUTPUT CONTROL=SINGLE comment
//@0000069 OUTPUT CONTROL=DOUBLE comment
//@0000070 OUTPUT CONTROL=TRIPLE comment
//@0000071 OUTPUT CONTROL=&CONTROL comment
//@0000072 OUTPUT COPIES=5 comment
//@0000073 OUTPUT COPIES=(5) comment
//@0000074 OUTPUT COPIES=&COPIES comment
//@0000075 OUTPUT COPIES=(&COPIES) comment
//@0000076 OUTPUT COPIES=(5,(2,3)) comment
//@0000077 OUTPUT COPIES=(255,(255,255,255,255,255,255,255,255)) commen
//@0000078 OUTPUT COPIES=(&COPIES,(&G1,&G2,&G3)) comment
//@0000079 OUTPUT COPIES=(,(77)) comment
//@0000080 OUTPUT COPIES=(,(1,2,3,4)) comment
//@0000081 OUTPUT COPYCNT=1 comment
//@0000082 OUTPUT COPYCNT=2147483647 comment
//@0000083 OUTPUT COPYCNT=&COPYCNT comment
//@0000084 OUTPUT DATACK=BLOCK comment
//@0000085 OUTPUT DATACK=UNBLOCK comment
//@0000086 OUTPUT DATACK=BLKCHAR comment
//@0000087 OUTPUT DATACK=BLKPOS comment
//@0000088 OUTPUT DATACK=&DATACK comment
//@0000089 OUTPUT DDNAME=DDNAME comment
//@0000090 OUTPUT DDNAME=JSTEP.DDNAME comment
//@0000091 OUTPUT DDNAME=PSTEP.DDNAME comment
//@0000092 OUTPUT DDNAME=JSTEP.PSTEP.DDNAME comment
//@0000093 OUTPUT DDNAME=&DDNAME comment
//@0000094 OUTPUT DEFAULT=YES comment
//@0000095 OUTPUT DEFAULT=Y comment
//@0000096 OUTPUT DEFAULT=NO comment
//@0000097 OUTPUT DEFAULT=N comment
//@0000098 OUTPUT DEFAULT=&DEFAULT comment
//@0000099 OUTPUT DEPT=/-+&*.ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789 comme
//@0000100 OUTPUT DEPT='Department of Silly Test Cases' comment
//@0000101 OUTPUT DEPT=&DEPT comment
//@0000102 OUTPUT DEST=LOCAL comment
//@0000103 OUTPUT DEST=ANYLOCAL comment
//@0000104 OUTPUT DEST=RMT17 comment
//@0000105 OUTPUT DEST=N12345 comment
//@0000106 OUTPUT DEST=N1R12345 comment
//@0000107 OUTPUT DEST=N12R1234 comment
//@0000108 OUTPUT DEST=N123R123 comment
//@0000109 OUTPUT DEST=N1234R12 comment
//@0000110 OUTPUT DEST=N12345R1 comment
//@0000111 OUTPUT DEST=(LONDON.CICSUSR) comment
//@0000112 OUTPUT DEST=U1 comment
//@0000113 OUTPUT DEST=CSCHNEID comment
//@0000114 OUTPUT DEST=&DEST comment
//@0000115 OUTPUT DEST=(&NODE.&USER) comment
//@0000116 OUTPUT DPAGELBL=YES comment
//@0000117 OUTPUT DPAGELBL=Y comment
//@0000118 OUTPUT DPAGELBL=NO comment
//@0000119 OUTPUT DPAGELBL=N comment
//@0000120 OUTPUT DPAGELBL=&DPAGELBL comment
//@0000121 OUTPUT DUPLEX=NO comment
//@0000122 OUTPUT DUPLEX=N comment
//@0000123 OUTPUT DUPLEX=NORMAL comment
//@0000124 OUTPUT DUPLEX=TUMBLE comment
//@0000125 OUTPUT DUPLEX=&DUPLEX comment
//@0000126 OUTPUT FCB=STD comment
//@0000127 OUTPUT FCB=1234 comment
//@0000128 OUTPUT FCB=A comment
//@0000129 OUTPUT FCB=$ comment
//@0000130 OUTPUT FCB=ABCD comment
//@0000131 OUTPUT FCB=$$$$ comment
//@0000132 OUTPUT FCB=&FCB comment
//@0000133 OUTPUT FLASH=STD comment
//@0000134 OUTPUT FLASH=NONE comment
//@0000135 OUTPUT FLASH=1 comment
//@0000136 OUTPUT FLASH=A comment
//@0000137 OUTPUT FLASH=$ comment
//@0000138 OUTPUT FLASH=(,255) comment
//@0000139 OUTPUT FLASH=($$,255) comment
//@0000140 OUTPUT FLASH=&FLASH comment
//@0000141 OUTPUT FLASH=(&OVERLAY,&COUNT) comment
//@0000142 OUTPUT FORMDEF=1 comment
//@0000143 OUTPUT FORMDEF=A comment
//@0000144 OUTPUT FORMDEF=# comment
//@0000145 OUTPUT FORMDEF=&FORMDEF comment
//@0000146 OUTPUT FORMLEN=1IN comment
//@0000147 OUTPUT FORMLEN=1CM comment
//@0000148 OUTPUT FORMLEN=1.1IN comment
//@0000149 OUTPUT FORMLEN=1.001CM comment
//@0000150 OUTPUT FORMLEN=&FORMLEN comment
//@0000151 OUTPUT FORMS=@001$002 comment
//@0000152 OUTPUT FORMS=&FORMS comment
//@0000153 OUTPUT FSSDATA=A1@.+-/ comment
//@0000154 OUTPUT FSSDATA='ABCDEFGHIJKLMNOPQRSTUVWXYZ1234567890' commen
//@0000155 OUTPUT FSSDATA=&FSSDATA comment
//@0000156 OUTPUT GROUPID=A comment
//@0000157 OUTPUT GROUPID=&GROUPID comment
//@0000158 OUTPUT INDEX=1 comment
//@0000159 OUTPUT INDEX=&INDEX comment
//@0000160 OUTPUT INTRAY=1 comment
//@0000161 OUTPUT INTRAY=&INTRAY comment
//@0000162 OUTPUT JESDS=ALL comment
//@0000163 OUTPUT JESDS=JCL comment
//@0000164 OUTPUT JESDS=LOG comment
//@0000165 OUTPUT JESDS=MSG comment
//@0000166 OUTPUT JESDS=&JESDS comment
//@0000167 OUTPUT LINDEX=1 comment
//@0000168 OUTPUT LINDEX=&LINDEX comment
//@0000169 OUTPUT LINECT=1 comment
//@0000170 OUTPUT LINECT=&LINECT comment
//@0000171 OUTPUT MAILBCC=ABC@EXAMPLE.COM comment
//@0000172 OUTPUT MAILBCC=(ABC@EXAMPLE.COM) comment
//@0000173 OUTPUT MAILBCC=(ABC@EXAMPLE.COM,DEF@EXAMPLE.COM) comment
//@0000174 OUTPUT MAILBCC='abc@example.com' comment
//@0000175 OUTPUT MAILBCC=('abc@example.com') comment
//@0000176 OUTPUT MAILBCC=('abc@example.com','def@example.com') comment
//@0000177 OUTPUT MAILBCC=(QUENTIN.COLDWATER@EXAMPLE.COM, comment
//             ALICE.QUINN@EXAMPLE.COM, comment
//             JULIA.WICKER@EXAMPLE.COM, comment
//             ELIOT.WAUGH@EXAMPLE.COM, comment
//             MARGO.HANSON@EXAMPLE.COM, comment
//             PENNY.ADIYODI@EXAMPLE.COM, comment
//             KADY.ORLOFF-DIAZ@EXAMPLE.COM) comment
//@0000178 OUTPUT MAILBCC=('quentin.coldwater@example.com', comment
//             'alice.quinn@example.com', comment
//             'julia.wicker@example.com', comment
//             'eliot.waugh@example.com', comment
//             'margo.hanson@example.com', comment
//             'penny.adiyodi@example.com', comment
//             'kady.orloff-diaz@example.com') comment
//@0000179 OUTPUT MAILCC=ABC@EXAMPLE.COM comment
//@0000180 OUTPUT MAILCC=(ABC@EXAMPLE.COM) comment
//@0000181 OUTPUT MAILCC=(ABC@EXAMPLE.COM,DEF@EXAMPLE.COM) comment
//@0000182 OUTPUT MAILCC='abc@example.com' comment
//@0000183 OUTPUT MAILCC=('abc@example.com') comment
//@0000184 OUTPUT MAILCC=('abc@example.com','def@example.com') comment
//@0000185 OUTPUT MAILCC=(QUENTIN.COLDWATER@EXAMPLE.COM, comment
//             ALICE.QUINN@EXAMPLE.COM, comment
//             JULIA.WICKER@EXAMPLE.COM, comment
//             ELIOT.WAUGH@EXAMPLE.COM, comment
//             MARGO.HANSON@EXAMPLE.COM, comment
//             PENNY.ADIYODI@EXAMPLE.COM, comment
//             KADY.ORLOFF-DIAZ@EXAMPLE.COM) comment
//@0000186 OUTPUT MAILCC=('quentin.coldwater@example.com', comment
//             'alice.quinn@example.com', comment
//             'julia.wicker@example.com', comment
//             'eliot.waugh@example.com', comment
//             'margo.hanson@example.com', comment
//             'penny.adiyodi@example.com', comment
//             'kady.orloff-diaz@example.com') comment
//@0000187 OUTPUT MAILBCC=&MAILBCC comment
//@0000188 OUTPUT MAILBCC=(&MAILBCC) comment
//@0000189 OUTPUT MAILBCC=(&MAILBCC,DEF@EXAMPLE.COM) comment
//@0000190 OUTPUT MAILBCC=(&MAILBCC, comment
//             DEF@EXAMPLE.COM) comment
//@0000191 OUTPUT MAILBCC=(ABC@EXAMPLE.COM,&MAILBCC) comment
//@0000192 OUTPUT MAILBCC=(ABC@EXAMPLE.COM, comment
//             &MAILBCC) comment
//@0000193 OUTPUT MAILBCC=(&MAILBCC,'def@example.com') comment
//@0000194 OUTPUT MAILBCC=(&MAILBCC, comment
//             'def@example.com') comment
//@0000195 OUTPUT MAILBCC=('abc@example.com',&MAILBCC) comment
//@0000196 OUTPUT MAILBCC=('abc@example.com', comment
//             &MAILBCC) comment
//@0000197 OUTPUT MAILCC=&MAILCC comment
//@0000198 OUTPUT MAILCC=(&MAILCC) comment
//@0000199 OUTPUT MAILCC=(&MAILCC,DEF@EXAMPLE.COM) comment
//@0000200 OUTPUT MAILCC=(&MAILCC, comment
//             DEF@EXAMPLE.COM) comment
//@0000201 OUTPUT MAILCC=(ABC@EXAMPLE.COM,&MAILCC) comment
//@0000202 OUTPUT MAILCC=(ABC@EXAMPLE.COM, comment
//             &MAILCC) comment
//@0000203 OUTPUT MAILCC=(&MAILCC,'def@example.com') comment
//@0000204 OUTPUT MAILCC=(&MAILCC, comment
//             'def@example.com') comment
//@0000205 OUTPUT MAILCC=('abc@example.com',&MAILCC) comment
//@0000206 OUTPUT MAILCC=('abc@example.com', comment
//             &MAILCC) comment
//@0000207 OUTPUT MAILFILE=LATEST-RESULTS comment
//@0000208 OUTPUT MAILFILE='Latest Results' comment
//@0000209 OUTPUT MAILFILE=&MAILFILE comment
//@0000210 OUTPUT MAILFROM=PRODUCTION.REPORT.DISTRIBUTION comment
//@0000211 OUTPUT MAILFROM='Production Report Distribution' comment
//@0000212 OUTPUT MAILFROM=&MAILFROM comment
//@0000213 OUTPUT MAILTO=ABC@EXAMPLE.COM comment
//@0000214 OUTPUT MAILTO=(ABC@EXAMPLE.COM) comment
//@0000215 OUTPUT MAILTO=(ABC@EXAMPLE.COM,DEF@EXAMPLE.COM) comment
//@0000216 OUTPUT MAILTO='abc@example.com' comment
//@0000217 OUTPUT MAILTO=('abc@example.com') comment
//@0000218 OUTPUT MAILTO=('abc@example.com','def@example.com') comment
//@0000219 OUTPUT MAILTO=(QUENTIN.COLDWATER@EXAMPLE.COM, comment
//             ALICE.QUINN@EXAMPLE.COM, comment
//             JULIA.WICKER@EXAMPLE.COM, comment
//             ELIOT.WAUGH@EXAMPLE.COM, comment
//             MARGO.HANSON@EXAMPLE.COM, comment
//             PENNY.ADIYODI@EXAMPLE.COM, comment
//             KADY.ORLOFF-DIAZ@EXAMPLE.COM) comment
//@0000220 OUTPUT MAILTO=('quentin.coldwater@example.com', comment
//             'alice.quinn@example.com', comment
//             'julia.wicker@example.com', comment
//             'eliot.waugh@example.com', comment
//             'margo.hanson@example.com', comment
//             'penny.adiyodi@example.com', comment
//             'kady.orloff-diaz@example.com') comment
//@0000221 OUTPUT MAILTO=&MAILTO comment
//@0000222 OUTPUT MAILTO=(&MAILTO) comment
//@0000223 OUTPUT MAILTO=(&MAILTO,DEF@EXAMPLE.COM) comment
//@0000224 OUTPUT MAILTO=(&MAILTO, comment
//             DEF@EXAMPLE.COM) comment
//@0000225 OUTPUT MAILTO=(ABC@EXAMPLE.COM,&MAILTO) comment
//@0000226 OUTPUT MAILTO=(ABC@EXAMPLE.COM, comment
//             &MAILTO) comment
//@0000227 OUTPUT MAILTO=(&MAILTO,'def@example.com') comment
//@0000228 OUTPUT MAILTO=(&MAILTO, comment
//             'def@example.com') comment
//@0000229 OUTPUT MAILTO=('abc@example.com',&MAILTO) comment
//@0000230 OUTPUT MAILTO=('abc@example.com', comment
//             &MAILTO) comment
//@0000231 OUTPUT MERGE=YES comment
//@0000232 OUTPUT MERGE=Y comment
//@0000233 OUTPUT MERGE=NO comment
//@0000234 OUTPUT MERGE=N comment
//@0000235 OUTPUT MERGE=&MERGE comment
//@0000236 OUTPUT MODIFY=1 comment
//@0000237 OUTPUT MODIFY=A#1$ comment
//@0000238 OUTPUT MODIFY=(MOD1) comment
//@0000239 OUTPUT MODIFY=(MOD1,1) comment
//@0000240 OUTPUT MODIFY=(,2) comment
//@0000241 OUTPUT MODIFY=&MODIFY comment
//@0000242 OUTPUT MODIFY=(&MODIFY) comment
//@0000243 OUTPUT MODIFY=(&MODIFY,&TRC) comment
//@0000244 OUTPUT MODIFY=(,&TRC) comment
//@0000245 OUTPUT NAME=ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789@#$ comment
//@0000246 OUTPUT NAME='Charlie Jade' comment
//@0000247 OUTPUT NAME=&NAME comment
//@0000248 OUTPUT NOTIFY=CSCHNEID comment
//@0000249 OUTPUT NOTIFY=(CSCHNEID) comment
//@0000250 OUTPUT NOTIFY=NEWYORK.CSCHNEID comment
//@0000251 OUTPUT NOTIFY=(NEWYORK.CSCHNEID) comment
//@0000252 OUTPUT NOTIFY=(NEWYORK.IBMUSER1,LONDON.IBMUSER2) comment
//@0000253 OUTPUT NOTIFY=(NEWYORK.IBMUSER1, comment
//             LONDON.IBMUSER2, comment
//             PARIS.IBMUSER3, comment
//             MUNICH.IBMUSER4) comment
//@0000254 OUTPUT NOTIFY=&NOTIFY1 comment
//@0000255 OUTPUT NOTIFY=(&NOTIFY1) comment
//@0000256 OUTPUT NOTIFY=(&NOTIFY1,&NOTIFY2) comment
//@0000257 OUTPUT NOTIFY=(&NOTIFY1, comment
//             &NOTIFY2, comment
//             &NOTIFY3, comment
//             &NOTIFY4) comment
//@0000258 OUTPUT NOTIFY=(&NODE..&USER) comment
//@0000259 OUTPUT NOTIFY=(&NOTIFY,CSCHNEID) comment
//@0000260 OUTPUT NOTIFY=(CSCHNEID,&NOTIFY) comment
//@0000261 OUTPUT OFFSETXB=1234.567IN comment
//@0000262 OUTPUT OFFSETXB=1234.567CM comment
//@0000263 OUTPUT OFFSETXB=1234.567MM comment
//@0000264 OUTPUT OFFSETXB=1234.567PELS comment
//@0000265 OUTPUT OFFSETXB=1234.567POINTS comment
//@0000266 OUTPUT OFFSETXB=&OFFSETXB comment
//@0000267 OUTPUT OFFSETXF=1234.567IN comment
//@0000268 OUTPUT OFFSETXF=1234.567CM comment
//@0000269 OUTPUT OFFSETXF=1234.567MM comment
//@0000270 OUTPUT OFFSETXF=1234.567PELS comment
//@0000271 OUTPUT OFFSETXF=1234.567POINTS comment
//@0000272 OUTPUT OFFSETXF=&OFFSETXF comment
//@0000273 OUTPUT OFFSETYB=1234.567IN comment
//@0000274 OUTPUT OFFSETYB=1234.567CM comment
//@0000275 OUTPUT OFFSETYB=1234.567MM comment
//@0000276 OUTPUT OFFSETYB=1234.567PELS comment
//@0000277 OUTPUT OFFSETYB=1234.567POINTS comment
//@0000278 OUTPUT OFFSETYB=&OFFSETYB comment
//@0000279 OUTPUT OFFSETYF=1234.567IN comment
//@0000280 OUTPUT OFFSETYF=1234.567CM comment
//@0000281 OUTPUT OFFSETYF=1234.567MM comment
//@0000282 OUTPUT OFFSETYF=1234.567PELS comment
//@0000283 OUTPUT OFFSETYF=1234.567POINTS comment
//@0000284 OUTPUT OFFSETYF=&OFFSETYF comment
//@0000285 OUTPUT OUTBIN=1 comment
//@0000286 OUTPUT OUTBIN=&OUTBIN comment
//@0000287 OUTPUT OUTDISP=WRITE comment
//@0000288 OUTPUT OUTDISP=HOLD comment
//@0000289 OUTPUT OUTDISP=KEEP comment
//@0000290 OUTPUT OUTDISP=LEAVE comment
//@0000291 OUTPUT OUTDISP=PURGE comment
//@0000292 OUTPUT OUTDISP=(WRITE) comment
//@0000293 OUTPUT OUTDISP=(HOLD) comment
//@0000294 OUTPUT OUTDISP=(KEEP) comment
//@0000295 OUTPUT OUTDISP=(LEAVE) comment
//@0000296 OUTPUT OUTDISP=(PURGE) comment
//@0000297 OUTPUT OUTDISP=(WRITE,WRITE) comment
//@0000298 OUTPUT OUTDISP=(HOLD,WRITE) comment
//@0000299 OUTPUT OUTDISP=(KEEP,WRITE) comment
//@0000300 OUTPUT OUTDISP=(LEAVE,WRITE) comment
//@0000301 OUTPUT OUTDISP=(PURGE,WRITE) comment
//@0000302 OUTPUT OUTDISP=(WRITE,HOLD) comment
//@0000303 OUTPUT OUTDISP=(HOLD,HOLD) comment
//@0000304 OUTPUT OUTDISP=(KEEP,HOLD) comment
//@0000305 OUTPUT OUTDISP=(LEAVE,HOLD) comment
//@0000306 OUTPUT OUTDISP=(PURGE,HOLD) comment
//@0000307 OUTPUT OUTDISP=(WRITE,KEEP) comment
//@0000308 OUTPUT OUTDISP=(HOLD,KEEP) comment
//@0000309 OUTPUT OUTDISP=(KEEP,KEEP) comment
//@0000310 OUTPUT OUTDISP=(LEAVE,KEEP) comment
//@0000311 OUTPUT OUTDISP=(PURGE,KEEP) comment
//@0000312 OUTPUT OUTDISP=(WRITE,LEAVE) comment
//@0000313 OUTPUT OUTDISP=(HOLD,LEAVE) comment
//@0000314 OUTPUT OUTDISP=(KEEP,LEAVE) comment
//@0000315 OUTPUT OUTDISP=(LEAVE,LEAVE) comment
//@0000316 OUTPUT OUTDISP=(PURGE,LEAVE) comment
//@0000317 OUTPUT OUTDISP=(WRITE,PURGE) comment
//@0000318 OUTPUT OUTDISP=(HOLD,PURGE) comment
//@0000319 OUTPUT OUTDISP=(KEEP,PURGE) comment
//@0000320 OUTPUT OUTDISP=(LEAVE,PURGE) comment
//@0000321 OUTPUT OUTDISP=(PURGE,PURGE) comment
//@0000322 OUTPUT OUTDISP=(,WRITE) comment
//@0000323 OUTPUT OUTDISP=(,HOLD) comment
//@0000324 OUTPUT OUTDISP=(,KEEP) comment
//@0000325 OUTPUT OUTDISP=(,LEAVE) comment
//@0000326 OUTPUT OUTDISP=(,PURGE) comment
//@0000327 OUTPUT OUTDISP=&OUTDISP comment
//@0000328 OUTPUT OUTDISP=(&OUTDISP) comment
//@0000329 OUTPUT OUTDISP=(,&OUTDISP) comment
//@0000330 OUTPUT OUTDISP=(WRITE,&OUTDISP) comment
//@0000331 OUTPUT OUTDISP=(HOLD,&OUTDISP) comment
//@0000332 OUTPUT OUTDISP=(KEEP,&OUTDISP) comment
//@0000333 OUTPUT OUTDISP=(LEAVE,&OUTDISP) comment
//@0000334 OUTPUT OUTDISP=(PURGE,&OUTDISP) comment
//@0000335 OUTPUT OUTDISP=(&OUTDISP,WRITE) comment
//@0000336 OUTPUT OUTDISP=(&OUTDISP,HOLD) comment
//@0000337 OUTPUT OUTDISP=(&OUTDISP,KEEP) comment
//@0000338 OUTPUT OUTDISP=(&OUTDISP,LEAVE) comment
//@0000339 OUTPUT OUTDISP=(&OUTDISP,PURGE) comment
//@0000340 OUTPUT OUTDISP=(&OUTDISP,&OUTDISP) comment
//@0000341 OUTPUT OVERLAYB=A123 comment
//@0000342 OUTPUT OVERLAYB=#ABC comment
//@0000343 OUTPUT OVERLAYB=&OVERLAYB comment
//@0000344 OUTPUT OVERLAYF=A123 comment
//@0000345 OUTPUT OVERLAYF=#ABC comment
//@0000346 OUTPUT OVERLAYF=&OVERLAYB comment
//@0000347 OUTPUT OVFL=ON comment
//@0000348 OUTPUT OVFL=OFF comment
//@0000349 OUTPUT OVFL=&OVFL comment
//@0000350 OUTPUT PAGEDEF=123456 comment
//@0000351 OUTPUT PAGEDEF=ABCDEF comment
//@0000352 OUTPUT PAGEDEF=@#$@#$ comment
//@0000353 OUTPUT PAGEDEF=&PAGEDEF comment
//@0000354 OUTPUT PIMSG=YES comment
//@0000355 OUTPUT PIMSG=NO comment
//@0000356 OUTPUT PIMSG=(YES) comment
//@0000357 OUTPUT PIMSG=(NO) comment
//@0000358 OUTPUT PIMSG=(YES,4) comment
//@0000359 OUTPUT PIMSG=(NO,8) comment
//@0000360 OUTPUT PIMSG=&PIMSG comment
//@0000361 OUTPUT PIMSG=(&PIMSG) comment
//@0000362 OUTPUT PIMSG=(&PIMSG,15) comment
//@0000363 OUTPUT PIMSG=(&PIMSG,&COUNT) comment
//@0000364 OUTPUT PORTNO=65535 comment
//@0000365 OUTPUT PORTNO=&PORTNO comment
//@0000366 OUTPUT PRMODE=LINE comment
//@0000367 OUTPUT PRMODE=PAGE comment
//@0000368 OUTPUT PRMODE=ABCDEFGH comment
//@0000369 OUTPUT PRMODE=&PRMODE comment
//@0000370 OUTPUT PRTATTRS='serenity=firefly,moya=leviathan' comment
//@0000371 OUTPUT PRTATTRS=&PRTATTRS comment
//@0000372 OUTPUT PRTERROR=DEFAULT comment
//@0000373 OUTPUT PRTERROR=QUIT comment
//@0000374 OUTPUT PRTERROR=HOLD comment
//@0000375 OUTPUT PRTERROR=&PRTERROR comment
//@0000376 OUTPUT PRTOPTNS=ABLEBAKER comment
//@0000377 OUTPUT PRTOPTNS='4-8-15-16-23-42' comment
//@0000378 OUTPUT PRTOPTNS=&PRTOPTNS comment
//@0000379 OUTPUT PRTQUEUE='123456789A123456789B123456789C123456789D
//             123456789E123456789F123456789G123456789H123456789I' comm
//@0000380 OUTPUT PRTQUEUE=123 comment
//@0000381 OUTPUT PRTQUEUE=&PRTQUEUE comment
//@0000382 OUTPUT PRTY=255 comment
//@0000383 OUTPUT PRTY=&PRTY comment
//@0000384 OUTPUT REPLYTO=ELIOT.WAUGH@EXAMPLE.COM comment
//@0000385 OUTPUT REPLYTO='yalena.yardeen@example.com' comment
//@0000386 OUTPUT REPLYTO=&REPLYTO comment
//@0000387 OUTPUT RESFMT=P240 comment
//@0000388 OUTPUT RESFMT=P300 comment
//@0000389 OUTPUT RESFMT=&RESFMT comment
//@0000390 OUTPUT RETAINS='9999:99:99' comment
//@0000391 OUTPUT RETAINS=FOREVER comment
//@0000392 OUTPUT RETAINS=&RETAINS comment
//@0000393 OUTPUT RETAINF='9999:99:99' comment
//@0000394 OUTPUT RETAINF=FOREVER comment
//@0000395 OUTPUT RETAINF=&RETAINF comment
//@0000396 OUTPUT RETRYT='9999:99:99' comment
//@0000397 OUTPUT RETRYT=&RETRYT comment
//@0000398 OUTPUT RETRYL=32767 comment
//@0000399 OUTPUT RETRYL=&RETRYL comment
//@0000400 OUTPUT ROOM=201B comment
//@0000401 OUTPUT ROOM='You know, that one room, down the hall?' commen
//@0000402 OUTPUT ROOM=&ROOM comment
//@0000403 OUTPUT SYSAREA=YES comment
//@0000404 OUTPUT SYSAREA=Y comment
//@0000405 OUTPUT SYSAREA=NO comment
//@0000406 OUTPUT SYSAREA=N comment
//@0000407 OUTPUT SYSAREA=&SYSAREA comment
//@0000408 OUTPUT THRESHLD=99999999 comment
//@0000409 OUTPUT THRESHLD=&THRESHLD comment
//@0000410 OUTPUT TITLE=TITLETEXT comment
//@0000411 OUTPUT TITLE='This is the title text, such as it is' comment
//@0000412 OUTPUT TITLE=&TITLE comment
//@0000413 OUTPUT TRC=YES comment
//@0000414 OUTPUT TRC=Y comment
//@0000415 OUTPUT TRC=NO comment
//@0000416 OUTPUT TRC=N comment
//@0000417 OUTPUT TRC=&TRC comment
//@0000418 OUTPUT UCS=RN comment
//@0000419 OUTPUT UCS=&UCS comment
//@0000420 OUTPUT USERDATA=SLEESTAK comment
//@0000421 OUTPUT USERDATA=(SLEESTAK) comment
//@0000422 OUTPUT USERDATA='Sleestak' comment
//@0000423 OUTPUT USERDATA=('Sleestak') comment
//@0000424 OUTPUT USERDATA=&USERDATA comment
//@0000425 OUTPUT USERDATA=(&USERDATA) comment
//@0000426 OUTPUT USERDATA=('Serenity','Roscinante','Moya') comment
//@0000427 OUTPUT USERDATA=(&USERDATA,'Roscinante','Moya') comment
//@0000428 OUTPUT USERDATA=('Serenity',&USERDATA,'Moya') comment
//@0000429 OUTPUT USERDATA=('Serenity','Roscinante',&USERDATA) comment
//@0000430 OUTPUT USERDATA=('Serenity', comment
//             'Roscinante', comment
//             'Moya') comment
//@0000431 OUTPUT USERDATA=(&USERDATA, comment
//             'Roscinante', comment
//             'Moya') comment
//@0000432 OUTPUT USERDATA=('Serenity', comment
//             &USERDATA, comment
//             'Moya') comment
//@0000433 OUTPUT USERDATA=('Serenity', comment
//             'Roscinante', comment
//             &USERDATA) comment
//@0000434 OUTPUT USERLIB=&SYSUID..USERLIB comment
//@0000435 OUTPUT USERLIB=(&SYSUID..USERLIB,PROD.USERLIB) comment
//@0000436 OUTPUT USERLIB=(&SYSUID..USERLIB, comment
//             QA.USERLIB, comment
//             PROD.USERLIB) comment
//@0000437 OUTPUT USERLIB='INT-TEST.USERLIB' comment
//@0000438 OUTPUT USERLIB=('INT-TEST.USERLIB') comment
//@0000439 OUTPUT USERLIB=('MY-TEST.USERLIB', comment
//             'INT-TEST.USERLIB', comment
//             'QA.USERLIB', comment
//             'PROD.USERLIB') comment
//@0000440 OUTPUT USERPATH=/USER/CSCHNEID/FONTS comment
//@0000441 OUTPUT USERPATH='/user/cschneid/fonts' comment
//@0000442 OUTPUT USERPATH=('/user/cschneid/fonts') comment
//@0000443 OUTPUT USERPATH=('/user/cschneid/fonts',/PROD/FONTS) comment
//@0000444 OUTPUT USERPATH=('/user/cschneid/fonts', comment
//             '/integration-test/fonts', comment
//             '/prod/fonts') comment
//@0000445 OUTPUT USERPATH=(&PATCH, comment
//             '/user/cschneid/fonts', comment
//             '/integration-test/fonts', comment
//             '/prod/fonts') comment
//@0000446 OUTPUT WRITER=$WRITER comment
//@0000447 OUTPUT WRITER=&WRITER comment
