//EDSEL JOB
//*
//STEP001  EXEC PGM=IEFBR14,ACCT=A,COND=EVEN,CCSID=1140
//STEP002  EXEC PGM=IEFBR14,PARM=X,ACCT='A',,COND=ONLY,CCSID=1140
//STEP002A EXEC PGM=IEFBR14,PARM=XX,ACCT=(A),COND=(4,GT,STEP001),
// CCSID=&CCSID
//STEP002B EXEC PGM=IEFBR14,PARM=1,ACCT=('A'),
// COND=((16,GE),(90,LE,STEP001),ONLY),CCSID=&CCSID1&CCSID2
//STEP002C EXEC PGM=IEFBR14,PARM=12,ACCT=(A,B),
//   COND=((8,LT,STEP001),(8,GT,STEP001A)),CCSID=1140
//STEP002D EXEC PGM=IEFBR14,PARM=#,ACCT=('A',B),
// COND=((16,GE),(90,LE,STEP001),(31,EQ,STEP002B),EVEN),CCSID=1140
//STEP002E EXEC PGM=IEFBR14,PARM=#$,ACCT=(A,'B'),
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN),CCSID=1140
//STEP002F EXEC PGM=IEFBR14,PARM=X1,ACCT=A1,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN),
//  CCSID=1140
//STEP002G EXEC PGM=IEFBR14,PARM=XX1,ACCT='A1',
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN),CCSID=1140
//STEP002H EXEC PGM=IEFBR14,PARM=XX11,ACCT=(A1),CCSID=1140,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002I EXEC PGM=IEFBR14,PARM=1X,ACCT=('A1'),CCSID=1140,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002J EXEC PGM=IEFBR14,PARM=11X,ACCT=(A1,B2),CCSID=1140,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002K EXEC PGM=IEFBR14,PARM=11XX,ACCT=('A1',B2),CCSID=1140,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002L EXEC PGM=IEFBR14,PARM=X@,ACCT=(A1,'B2'),CCSID=1140,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002M EXEC PGM=IEFBR14,PARM=XX@,ACCT=('A1','B2'),CCSID=1140,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002N EXEC PGM=IEFBR14,PARM=XX@@,ACCT='A1$',CCSID=1140,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002O EXEC PGM=IEFBR14,PARM=1@,ACCT=('A1$'),CCSID=1140,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002P EXEC PGM=IEFBR14,PARM=11@,ACCT=('A1$','B2+'),CCSID=1140,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP006  EXEC PGM=IEFBR14,PARM=&AB,COND=(4,LT),CCSID=1140
//STEP007  EXEC PGM=IEFBR14,PARM=&A.1,COND=(0,NE),CCSID=1140
//STEP008  EXEC PGM=IEFBR14,PARM=ZZ&A,COND=EVEN,CCSID=1140
//STEP009  EXEC PGM=IEFBR14,PARM=ZZ&A.1,COND=ONLY,CCSID=1140
//STEP010  EXEC PGM=IEFBR14,PARM='AND A ONE AND A TWO AND
//       A THREE AND A FOUR',CCSID=1140,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP011  EXEC PGM=IEFBR14,PARM=(A,B,C,D,E,F,G),COND=(7,NE),
//  CCSID=1140
//STEP012  EXEC PGM=IEFBR14,PARM=(A,              PARM 1
//  B,                                            PARM 2
//    C,                                          PARM 3
// D,                                             PARM 4
//         E,                                     PARM 5
//      F,                                        PARM 6
//        G),                                     PARM 7
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN),CCSID=1140
//STEP013  EXEC PGM=IEFBR14,
// PARM=(A,
// B,
// C,
// D,
// E,F,
//         G),CCSID=1140,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP014  EXEC PGM=IEFBR14,PARM=('ABC',&A,7,'BLAH
//  BLAH BLAH'),COND=(333,EQ,STEP011),CCSID=1140
//STEP015  EXEC PGM=IEFBR14,PARM=X,COND=ONLY,CCSID=&CCSID moo
