//AEIOU JOB
//*
//STEP001  EXEC PGM=IEFBR14,PARMDD=DD001
//STEP002  EXEC PGM=IEFBR14,PARMDD=#0001
//STEP002A EXEC PGM=IEFBR14,PARMDD=#
//STEP002B EXEC PGM=IEFBR14,PARMDD=$
//STEP002C EXEC PGM=IEFBR14,PARMDD=@
//STEP002C EXEC PGM=IEFBR14,PARMDD=@      A PARM DD
//STEP003  EXEC PGM=IEFBR14,PARMDD=PARMDD
//STEP004  EXEC PGM=IEFBR14,PARMDD=PARM1
