//DDSPLAT1 JOB
//*
//STEP0001 EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  DISP=SHR,DSN=VIMES.JCL.CNTL(NIGHT)
//SYSUT2   DD  DISP=(NEW,CATLG,DELETE),
//             DSN=CARROT.JCL.COPY1,
//             LRECL=80,RECFM=FB,SPACE=(TRK,1)
//SYSIN    DD  *
DO SOMETHING INTERESTING
//*
//STEP0002 EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=*
//SYSUT1   DD  DISP=SHR,DSN=VIMES.JCL.CNTL(WATCH)
//SYSUT2   DD  DISP=(NEW,CATLG,DELETE),
//             DSN=CARROT.JCL.COPY2,
//             LRECL=80,RECFM=FB,SPACE=(TRK,1)

PLEASE DO SOMETHING INTERESTING
FOR THIS IS THE TIME
//STEP0003 EXEC PGM=IEFBR14
//STEP0004 EXEC PROC=SAS
DATA _NULL_;
//STEP0005 EXEC PGM=IEFBR14
