//IF JOB
//*
//$0000001 IF RC > 4 & RC < 16 &
//           ^ABEND THEN
//$0000002 IF STEP1.ABEND | STEP2.ABEND = TRUE THEN
//$0000003 IF ^STEP1.ABEND & STEP2.ABEND = FALSE THEN
//$0000004 IF ^(STEP1.ABEND | STEP2.ABEND) THEN
//$0000005 IF STEP1.RUN & STEP1.ABEND = FALSE THEN
//$0000006 IF STEP1.PSTEP1.RUN &
//           STEP1.PSTEP1.ABEND = FALSE &
//           STEP1.PSTEP1.RC < 4 THEN
//$0000007 IF STEP1.PSTEP2.RUN &
//           (STEP1.PSTEP2.ABEND &
//           ((STEP1.PSTEP2.ABENDCC NE S0C4 &
//           STEP1.PSTEP2.ABENDCC NE S0C7) | 
//           (STEP1.PSTEP2.ABENDCC EQ U4038 |
//           STEP1.PSTEP2.ABENDCC EQ U887))) THEN
// ELSE STUFF
//ENDIF ENDIF STUFF
