//DDCNTL JOB
//*
//STEP0001 EXEC PGM=ZZ9PZA
//DD000001 DD  CNTL=*.PREVCNTL
//DD000002 DD  CNTL=*.STEPNAME.PREVCNTL
//DD000003 DD  CNTL=*.PROCSTEP.STEPNAME.PREVCNTL
//DD000101 DD  CNTL=*.PREVCNTL CNTL
//DD000102 DD  CNTL=*.STEPNAME.PREVCNTL CNTL
//DD000103 DD  CNTL=*.PROCSTEP.STEPNAME.PREVCNTL CNTL
