//EATTR JOB
//*
//STEP0001 EXEC PGM=AMSALLOC
//DD000001 DD  EATTR=OPT
//DD000002 DD  EATTR=NO
//DD000003 DD  EATTR=&EATTR
//DD000011 DD  EATTR=OPT EATTR
//DD000012 DD  EATTR=NO EATTR
//DD000013 DD  EATTR=&EATTR EATTR

