//FREEVOL JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  FREEVOL=END
//DD000002 DD  FREEVOL=EOV
//DD000003 DD  FREEVOL=&FREEVOL
//DD000101 DD  FREEVOL=END FREEVOL
//DD000102 DD  FREEVOL=EOV FREEVOL
//DD000103 DD  FREEVOL=&FREEVOL FREEVOL

