//CHARS JOB
//*
//STEP0001 EXEC PGM=IEBGENER
//DD000001 DD  CHARS=A
//DD000002 DD  CHARS=A1
//DD000003 DD  CHARS=1
//DD000004 DD  CHARS=1A
//DD000005 DD  CHARS=@
//DD000006 DD  CHARS=@1
//DD000007 DD  CHARS=@1A
//DD000008 DD  CHARS=A@
//DD000009 DD  CHARS=1@
//DD000010 DD  CHARS=@A
//DD000011 DD  CHARS=@#$
//DD000012 DD  CHARS=$#@A
//DD000013 DD  CHARS=#@$1
//DD000014 DD  CHARS=@1#2
//DD000015 DD  CHARS=A$11
//DD000016 DD  CHARS=DUMP
//DD000017 DD  CHARS=(A)
//DD000018 DD  CHARS=(1)
//DD000019 DD  CHARS=($)
//DD000020 DD  CHARS=(DUMP)
//DD000021 DD  CHARS=(A,B,C,D)
//DD000022 DD  CHARS=(1,2,3,4)
//DD000023 DD  CHARS=(@,#,$)
//DD000024 DD  CHARS=(DUMP,@,A,9)
//DD000025 DD  CHARS=(@1,#2,$3,A123)
//DD000026 DD  CHARS=(&F1,&F2,&F3,&F4)
//DD000101 DD  CHARS=A CHARS
//DD000102 DD  CHARS=A1 CHARS
//DD000103 DD  CHARS=1 CHARS
//DD000104 DD  CHARS=1A CHARS
//DD000105 DD  CHARS=@ CHARS
//DD000106 DD  CHARS=@1 CHARS
//DD000107 DD  CHARS=@1A CHARS
//DD000108 DD  CHARS=A@ CHARS
//DD000109 DD  CHARS=1@ CHARS
//DD000110 DD  CHARS=@A CHARS
//DD000111 DD  CHARS=@#$ CHARS
//DD000112 DD  CHARS=$#@A CHARS
//DD000113 DD  CHARS=#@$1 CHARS
//DD000114 DD  CHARS=@1#2 CHARS
//DD000115 DD  CHARS=A$11 CHARS
//DD000116 DD  CHARS=DUMP CHARS
//DD000117 DD  CHARS=(A) CHARS
//DD000118 DD  CHARS=(1) CHARS
//DD000119 DD  CHARS=($) CHARS
//DD000120 DD  CHARS=(DUMP) CHARS
//DD000121 DD  CHARS=(A,B,C,D) CHARS
//DD000122 DD  CHARS=(1,2,3,4) CHARS
//DD000123 DD  CHARS=(@,#,$) CHARS
//DD000124 DD  CHARS=(DUMP,@,A,9) CHARS
//DD000125 DD  CHARS=(@1,#2,$3,A123) CHARS
//DD000126 DD  CHARS=(&F1,&F2,&F3,&F4) CHARS
