//DATA JOB
//*
//STEP0001 EXEC PGM=IEBGENER
//DD000001 DD  DATA
EGGS
/* A COMMENT
//DD000002 DD  DATA
BACON
/* It is by will alone I set my mind in motion.
//*
//DD000003 DD  DATA
HAM
AND
EGGS
/* A COMMENT
//DD000004 DD  DATA,DLM=$$
//AJOB JOB
//STEPA EXEC PGM=IEFBR14
/*
$$ A COMMENT
//DD000005 DD  DATA
ABC
/* A COMMENT
//         DD  DATA
DEF
/* A COMMENT
//DD000006 DD  DATA,DLM='!!'
QRS
!! A COMMENT
//         DD  DATA,DLM='@@'
TUV
@@ A COMMENT
//DD000101 DD  DATA DATA
EGGS
/* A COMMENT
//DD000102 DD  DATA DATA
BACON
/* It is by will alone I set my mind in motion.
//*
//DD000103 DD  DATA DATA
HAM
AND
EGGS
/* A COMMENT
//DD000104 DD  DATA,DLM='$$' DLM
//AJOB JOB
//STEPA EXEC PGM=IEFBR14
/*
$$ A COMMENT
//DD000105 DD  DATA DATA
ABC
/* A COMMENT
//         DD  DATA DATA
DEF
/* A COMMENT
//DD000106 DD  DATA,DLM='!!' DLM
QRS
!! A COMMENT
//         DD  DATA,DLM='@@' DLM
TUV
@@ A COMMENT
