//AEIOU JOB
//*
//STEP001  EXEC PGM=IEFBR14
//STEP002  EXEC PGM=IEFBR14,TVSMSG=COMMIT
//STEP002A EXEC PGM=IEFBR14,TVSMSG=BACKOUT
//STEP002B EXEC PGM=IEFBR14,TVSMSG=ALL
//STEP002C EXEC PGM=IEFBR14,TVSMSG=&TVSMSG
//STEP002D EXEC PGM=IEFBR14,
// TVSMSG=COMMIT
//STEP002E EXEC PGM=IEFBR14,
// TVSMSG=BACKOUT
//STEP002F EXEC PGM=IEFBR14,
// TVSMSG=ALL
//STEP002G EXEC PGM=IEFBR14,
// TVSMSG=&TV
//STEP002  EXEC PGM=IEFBR14,TVSMSG=COMMIT TVSMSG
//STEP002A EXEC PGM=IEFBR14,TVSMSG=BACKOUT TVSMSG
//STEP002B EXEC PGM=IEFBR14,TVSMSG=ALL TVSMSG
//STEP002C EXEC PGM=IEFBR14,TVSMSG=&TVSMSG TVSMSG
//STEP002D EXEC PGM=IEFBR14,
// TVSMSG=COMMIT TVSMSG
//STEP002E EXEC PGM=IEFBR14,
// TVSMSG=BACKOUT TVSMSG
//STEP002F EXEC PGM=IEFBR14,
// TVSMSG=ALL TVSMSG
//STEP002G EXEC PGM=IEFBR14,
// TVSMSG=&TV TVSMSG
