//AVGREC JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  AVGREC=U
//DD000002 DD  AVGREC=K
//DD000003 DD  AVGREC=M
//DD000004 DD  AVGREC=&AVGREC
//DD000011 DD  AVGREC=U AVGREC
//DD000012 DD  AVGREC=K AVGREC
//DD000013 DD  AVGREC=M AVGREC
//DD000014 DD  AVGREC=&AVGREC AVGREC
