//SUBSYS JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  SUBSYS=A
//DD000002 DD  SUBSYS=#
//DD000003 DD  SUBSYS=A1
//DD000004 DD  SUBSYS=@A
//DD000005 DD  SUBSYS=A$
//DD000006 DD  SUBSYS=#1
//DD000007 DD  SUBSYS=A@#1
//DD000008 DD  SUBSYS=#123
//DD000009 DD  SUBSYS=(#1#2,ABCDEFGH)
//DD000010 DD  SUBSYS=(#1#2,'ABCDEFGH')
//DD000011 DD  SUBSYS=($2$3,AEIOU,XYZ)
//DD000012 DD  SUBSYS=($2$3,'AEIOU',XYZ)
//DD000013 DD  SUBSYS=($2$3,AEIOU,'XYZ')
//DD000014 DD  SUBSYS=($2$3,'AEIOU','XYZ')
//DD000015 DD  SUBSYS=($2$3,
// AEIOU,
// XYZ)
//DD000016 DD  SUBSYS=($2$3,
// 'AEIOU',
// XYZ)
//DD000017 DD  SUBSYS=($2$3,
// AEIOU,
// 'XYZ')
//DD000018 DD  SUBSYS=($2$3,
// 'AEIOU',
// 'XYZ')
//DD000101 DD  SUBSYS=A SUBSYS
//DD000102 DD  SUBSYS=# SUBSYS
//DD000103 DD  SUBSYS=A1 SUBSYS
//DD000104 DD  SUBSYS=@A SUBSYS
//DD000105 DD  SUBSYS=A$ SUBSYS
//DD000106 DD  SUBSYS=#1 SUBSYS
//DD000107 DD  SUBSYS=A@#1 SUBSYS
//DD000108 DD  SUBSYS=#123 SUBSYS
//DD000109 DD  SUBSYS=(#1#2,ABCDEFGH) SUBSYS
//DD000110 DD  SUBSYS=(#1#2,'ABCDEFGH') SUBSYS
//DD000111 DD  SUBSYS=($2$3,AEIOU,XYZ) SUBSYS
//DD000112 DD  SUBSYS=($2$3,'AEIOU',XYZ) SUBSYS
//DD000113 DD  SUBSYS=($2$3,AEIOU,'XYZ') SUBSYS
//DD000114 DD  SUBSYS=($2$3,'AEIOU','XYZ') SUBSYS
//DD000115 DD  SUBSYS=($2$3, SUBSYS
// AEIOU, SUBSYS
// XYZ) SUBSYS
//DD000116 DD  SUBSYS=($2$3, SUBSYS
// 'AEIOU', SUBSYS
// XYZ) SUBSYS
//DD000117 DD  SUBSYS=($2$3, SUBSYS
// AEIOU, SUBSYS
// 'XYZ') SUBSYS
//DD000118 DD  SUBSYS=($2$3, SUBSYS
// 'AEIOU', SUBSYS
// 'XYZ') SUBSYS

