//DDCONCAT JOB
//*
//STEP0002 EXEC PROC=APROC
//PSTEP01.DD000001 DD
//         DD
//         DD  DISP=SHR,DSN=OVERRIDE.LOADLIB
//         DD
//         DD  DISP=SHR,DSN=PATCH.LOADLIB
//PSTEP01.DD000002 DD  *
AEIOU
//         DD  DISP=SHR,DSN=CONTROL.CARDS(CARD0001)
//         DD  *
ABCDE
//         DD  DISP=(OLD,PASS),DSN=&&CARDS
//         DD  *
DAIKON
/*
