//AEIOU JOB
//*
//STEP001  EXEC PGM=IEFBR14,REGION=100K
//STEP002  EXEC PGM=IEFBR14,PARM=X,REGION=10M
//STEP002A EXEC PGM=IEFBR14,PARM=XX,REGION=10M
//STEP002B EXEC PGM=IEFBR14,PARM=1,REGION=&REGION
//STEP009  EXEC PGM=IEFBR14,PARM=ZZ&A.1,REGION=6M
//STEP010  EXEC PGM=IEFBR14,PARM='AND A ONE AND A TWO AND
//       A THREE AND A FOUR',REGION=6M
//STEP011  EXEC PGM=IEFBR14,PARM=(A,B,C,D,E,F,G),REGION=6M
//STEP012  EXEC PGM=IEFBR14,PARM=(A,              PARM 1
//  B,                                            PARM 2
//    C,                                          PARM 3
// D,                                             PARM 4
//         E,                                     PARM 5
//      F,                                        PARM 6
//        G),REGION=6M                          PARM 7
//STEP013  EXEC PGM=IEFBR14,
// PARM=(A,
// B,
// C,
// D,
// E,F,
//         G),REGION=6M
//STEP014  EXEC PGM=IEFBR14,PARM=('ABC',&A,7,'BLAH
//  BLAH BLAH'),REGION=6M
//STEP015  EXEC PGM=IEFBR14,PARM=X,REGION=6M moo
//STEP016  EXEC IAYEAYE,PARM.STEPA=X,REGION.STEPA=1K
//STEP017  EXEC IAYEAYE,PARM.STEPA=X,PARM.STEPB=Y,REGION.STEPC=1K
//STEP018  EXEC IAYEAYE,
// PARM.STEPA=(A,B,C),
// PARM.STEPB=(D,E,F),
// REGION.STEPC=1K
//STEP019  EXEC IAYEAYE,
// PARM.STEPA=(&A1,&B2,&C3),
// PARM.STEPB=(&D4,&E5,&F6),
// REGION.STEPC=&REGION
//STEP020  EXEC IAYEAYE,
// PARM.STEPA=(&A1,&B2,&C3),
// PARM.STEPB=(&D4,&E5,&F6),
// PARM.STEPC=(&A1,&B2,&C3,&D4),
// PARM.STEPD=(&A1,
// &B2,&C3,&D4,&E5,&F6),
// REGION.STEPE=&RGNSTEPE
