//DCB JOB ,USER=CSCHNEID
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  DCB=(BFALN=F)
//DD000002 DD  DCB=(BFALN=D)
//DD000003 DD  DCB=(BFALN=&BFALN)
//DD000004 DD  DCB=(BFTEK=F)
//DD000005 DD  DCB=(BFTEK=R)
//DD000006 DD  DCB=(BFTEK=D)
//DD000007 DD  DCB=(BFTEK=S)
//DD000008 DD  DCB=(BFTEK=A)
//DD000009 DD  DCB=(BFTEK=&BFTEK)
//DD000010 DD  DCB=(BLKSIZE=27998)
//DD000011 DD  DCB=(BLKSIZE=27K)
//DD000012 DD  DCB=(BLKSIZE=10M)
//DD000013 DD  DCB=(BLKSIZE=1G)
//DD000014 DD  DCB=(BLKSIZE=&BLKSIZE)
//DD000015 DD  DCB=(BUFIN=1)
//DD000016 DD  DCB=(BUFIN=65535)
//DD000017 DD  DCB=(BUFIN=&BUFIN)
//DD000018 DD  DCB=(BUFL=1)
//DD000019 DD  DCB=(BUFL=32760)
//DD000020 DD  DCB=(BUFL=&BUFL)
//DD000021 DD  DCB=(BUFMAX=2)
//DD000022 DD  DCB=(BUFMAX=15)
//DD000023 DD  DCB=(BUFMAX=255)
//DD000024 DD  DCB=(BUFMAX=&BUFMAX)
//DD000025 DD  DCB=(BUFNO=1)
//DD000026 DD  DCB=(BUFNO=255)
//DD000027 DD  DCB=(BUFNO=1000)
//DD000028 DD  DCB=(BUFNO=&BUFNO)
//DD000029 DD  DCB=(BUFOFF=0)
//DD000030 DD  DCB=(BUFOFF=7)
//DD000031 DD  DCB=(BUFOFF=99)
//DD000032 DD  DCB=(BUFOFF=L)
//DD000033 DD  DCB=(BUFOFF=&BUFOFF)
//DD000034 DD  DCB=(BUFOUT=1)
//DD000035 DD  DCB=(BUFOUT=15)
//DD000036 DD  DCB=(BUFOUT=32768)
//DD000037 DD  DCB=(BUFOUT=&BUFOUT)
//DD000038 DD  DCB=(BUFSIZE=1)
//DD000039 DD  DCB=(BUFSIZE=255)
//DD000040 DD  DCB=(BUFSIZE=65535)
//DD000041 DD  DCB=(BUFSIZE=&BUFSIZE)
//DD000042 DD  DCB=(CPRI=R)
//DD000043 DD  DCB=(CPRI=E)
//DD000044 DD  DCB=(CPRI=S)
//DD000045 DD  DCB=(CPRI=&CPRI)
//DD000046 DD  DCB=(CYLOFL=1)
//DD000047 DD  DCB=(CYLOFL=255)
//DD000048 DD  DCB=(CYLOFL=999999)
//DD000049 DD  DCB=(CYLOFL=&CYLOFL)
//DD000050 DD  DCB=(DEN=1)
//DD000051 DD  DCB=(DEN=2)
//DD000052 DD  DCB=(DEN=3)
//DD000053 DD  DCB=(DEN=4)
//DD000054 DD  DCB=(DEN=99)
//DD000055 DD  DCB=(DEN=&DEN)
//DD000056 DD  DCB=(DIAGNS=TRACE)
//DD000057 DD  DCB=(DSORG=PS)
//DD000058 DD  DCB=(DSORG=PSU)
//DD000059 DD  DCB=(DSORG=DA)
//DD000060 DD  DCB=(DSORG=DAU)
//DD000061 DD  DCB=(DSORG=PO)
//DD000062 DD  DCB=(DSORG=POU)
//DD000063 DD  DCB=(DSORG=CX)
//DD000064 DD  DCB=(DSORG=GS)
//DD000065 DD  DCB=(DSORG=&DSORG)
//DD000066 DD  DCB=(EROPT=ACC)
//DD000067 DD  DCB=(EROPT=SKP)
//DD000068 DD  DCB=(EROPT=ABE)
//DD000069 DD  DCB=(EROPT=&ERROPT)
//DD000079 DD  DCB=(FUNC=X)
//DD000080 DD  DCB=(FUNC=I)
//DD000081 DD  DCB=(FUNC=WT)
//DD000082 DD  DCB=(FUNC=RWT)
//DD000083 DD  DCB=(FUNC=RPWXT)
//DD000084 DD  DCB=(FUNC=PWX)
//DD000085 DD  DCB=(FUNC=R)
//DD000086 DD  DCB=(FUNC=RP)
//DD000087 DD  DCB=(FUNC=PW)
//DD000088 DD  DCB=(FUNC=RPWD)
//DD000089 DD  DCB=(FUNC=RPWX)
//DD000090 DD  DCB=(FUNC=P)
//DD000091 DD  DCB=(FUNC=RPD)
//DD000092 DD  DCB=(FUNC=PWXT)
//DD000093 DD  DCB=(FUNC=RWX)
//DD000094 DD  DCB=(FUNC=RWX)
//DD000095 DD  DCB=(FUNC=W)
//DD000096 DD  DCB=(FUNC=RW)
//DD000097 DD  DCB=(FUNC=RPW)
//DD000098 DD  DCB=(FUNC=RWXT)
//DD000099 DD  DCB=(FUNC=&FUNC)
//DD000100 DD  DCB=(GNCP=1)
//DD000101 DD  DCB=(GNCP=100)
//DD000102 DD  DCB=(GNCP=&GNCP)
//DD000103 DD  DCB=(INTVL=0)
//DD000104 DD  DCB=(INTVL=65535)
//DD000105 DD  DCB=(IPLTXID=THISONE)
//DD000106 DD  DCB=(IPLTXID=@3704#01)
//DD000107 DD  DCB=(IPLTXID=&IPLTXID)
//DD000108 DD  DCB=(KEYLEN=0)
//DD000109 DD  DCB=(KEYLEN=255)
//DD000110 DD  DCB=(KEYLEN=99999)
//DD000111 DD  DCB=(KEYLEN=&KEYLEN)
//DD000112 DD  DCB=(LIMCT=7)
//DD000113 DD  DCB=(LIMCT=4096)
//DD000114 DD  DCB=(LIMCT=&LIMCT)
//DD000115 DD  DCB=(LRECL=1)
//DD000116 DD  DCB=(LRECL=255)
//DD000117 DD  DCB=(LRECL=65535)
//DD000118 DD  DCB=(LRECL=16383K)
//DD000119 DD  DCB=(LRECL=X)
//DD000120 DD  DCB=(LRECL=&LRECL)
//DD000121 DD  DCB=(MODE=C)
//DD000122 DD  DCB=(MODE=E)
//DD000123 DD  DCB=(MODE=O)
//DD000124 DD  DCB=(MODE=R)
//DD000125 DD  DCB=(MODE=CO)
//DD000126 DD  DCB=(MODE=RC)
//DD000127 DD  DCB=(MODE=RE)
//DD000128 DD  DCB=(MODE=CEOR)
//DD000129 DD  DCB=(MODE=&MODE)
//DD000130 DD  DCB=(NCP=1)
//DD000131 DD  DCB=(NCP=255)
//DD000132 DD  DCB=(NCP=&NCP)
//DD000133 DD  DCB=(NTM=1)
//DD000134 DD  DCB=(NTM=255)
//DD000135 DD  DCB=(NTM=&NTM)
//DD000136 DD  DCB=(OPTCD=A)
//DD000137 DD  DCB=(OPTCD=C)
//DD000138 DD  DCB=(OPTCD=W)
//DD000139 DD  DCB=(OPTCD=AEFW)
//DD000140 DD  DCB=(OPTCD=B)
//DD000141 DD  DCB=(OPTCD=T)
//DD000142 DD  DCB=(OPTCD=ZCTBU)
//DD000143 DD  DCB=(OPTCD=&OPTCD)
//DD000144 DD  DCB=(PCI=N)
//DD000145 DD  DCB=(PCI=(N,N))
//DD000146 DD  DCB=(PCI=A)
//DD000147 DD  DCB=(PCI=(A))
//DD000148 DD  DCB=(PCI=(A,A))
//DD000149 DD  DCB=(PCI=&PCI)
//DD000150 DD  DCB=(PCI=(&PCI))
//DD000151 DD  DCB=(PCI=(&PCI1,R))
//DD000152 DD  DCB=(PCI=(R,&PCI2))
//DD000153 DD  DCB=(PCI=(&PCI1,&PCI2))
//DD000154 DD  DCB=(PRTSP=0)
//DD000155 DD  DCB=(PRTSP=1)
//DD000156 DD  DCB=(PRTSP=2)
//DD000157 DD  DCB=(PRTSP=3)
//DD000158 DD  DCB=(PRTSP=&PRTSP)
//DD000159 DD  DCB=(RECFM=F)
//DD000160 DD  DCB=(RECFM=FB)
//DD000161 DD  DCB=(RECFM=FBS)
//DD000162 DD  DCB=(RECFM=FBT)
//DD000163 DD  DCB=(RECFM=U)
//DD000164 DD  DCB=(RECFM=UTM)
//DD000165 DD  DCB=(RECFM=UA)
//DD000166 DD  DCB=(RECFM=VBS)
//DD000167 DD  DCB=(RECFM=FBA)
//DD000168 DD  DCB=(RECFM=VBA)
//DD000169 DD  DCB=(RECFM=DBSAUFMTV)
//DD000170 DD  DCB=(RECFM=&RECFM)
//DD000171 DD  DCB=(RESERVE=(0,0))
//DD000172 DD  DCB=(RESERVE=(255,255))
//DD000173 DD  DCB=(RESERVE=(&RESERVE,255))
//DD000174 DD  DCB=(RESERVE=(255,&RESERVE))
//DD000175 DD  DCB=(RESERVE=(&RESERVE1,&RESERVE2))
//DD000176 DD  DCB=(RKP=1)
//DD000177 DD  DCB=(RKP=255)
//DD000178 DD  DCB=(RKP=&RKP)
//DD000179 DD  DCB=(STACK=1)
//DD000180 DD  DCB=(STACK=2)
//DD000181 DD  DCB=(STACK=32768)
//DD000182 DD  DCB=(STACK=&STACK)
//DD000183 DD  DCB=(THRESH=0)
//DD000184 DD  DCB=(THRESH=255)
//DD000185 DD  DCB=(THRESH=&THRESH)
//DD000186 DD  DCB=(THRESH=95)
//DD000187 DD  DCB=(TRTCH=C)
//DD000188 DD  DCB=(TRTCH=E)
//DD000189 DD  DCB=(TRTCH=T)
//DD000190 DD  DCB=(TRTCH=ET)
//DD000191 DD  DCB=(TRTCH=COMP)
//DD000192 DD  DCB=(TRTCH=NOCOMP)
//DD000193 DD  DCB=(TRTCH=&TRTCH)
