//PROC JOB
//*
//QRESH PROC
// EXEC PGM=IEFBR14
// PEND
//WESTERLY PROC A=4
// EXEC PGM=IEFBR14
// PEND
//LEITH PROC A=4 COMMENTS GO HERE
// EXEC PGM=IEFBR14
// PEND
//ARKYN PROC A=4,
//           B=8,
//           C=15,
//           D=16,
//           E=23,
//           F=42
// EXEC PGM=IEFBR14
// PEND
//THEQUAD PROC A=4,  FOUR
//           B=8,   EIGHT
//           C=15,  FIFTEEN
//           D=16,  SIXTEEN
//           E=23,  TWENTY-THREE
//           F=42   FORTY-TWO
// EXEC PGM=IEFBR14
// PEND
//THEJ PROC A=4,B=8,C=15,D=16,E=23,F=42
// EXEC PGM=IEFBR14
// PEND

