//AEIOU JOB
//*
//STEP001  EXEC PGM=IEFBR14
//STEP002  EXEC PGM=IEFBR14,PARM=X,DYNAMNBR=1
//STEP002A EXEC PGM=IEFBR14,PARM=XX,DYNAMNBR=12
//STEP002B EXEC PGM=IEFBR14,PARM=1,DYNAMNBR=123
//STEP002C EXEC PGM=IEFBR14,PARM=12,DYNAMNBR=1234
//STEP002D EXEC PGM=IEFBR14,PARM=#,DYNAMNBR=12345
//STEP002E EXEC PGM=IEFBR14,PARM=#$,DYNAMNBR=&DYNAM1&DYNAM2
//STEP002F EXEC PGM=IEFBR14,PARM=X1,DYNAMNBR=12345
//STEP002G EXEC PGM=IEFBR14,PARM=XX1,DYNAMNBR=12345
//STEP002H EXEC PGM=IEFBR14,PARM=XX11,DYNAMNBR=12345
//STEP002I EXEC PGM=IEFBR14,PARM=1X,DYNAMNBR=12345
//STEP002J EXEC PGM=IEFBR14,PARM=11X,DYNAMNBR=12345
//STEP002K EXEC PGM=IEFBR14,PARM=11XX,DYNAMNBR=12345
//STEP002L EXEC PGM=IEFBR14,PARM=X@,DYNAMNBR=12345
//STEP002M EXEC PGM=IEFBR14,PARM=XX@,DYNAMNBR=12345
//STEP002N EXEC PGM=IEFBR14,PARM=XX@@,DYNAMNBR=12345
//STEP002O EXEC PGM=IEFBR14,PARM=1@,DYNAMNBR=12345
//STEP002P EXEC PGM=IEFBR14,PARM=11@,DYNAMNBR=12345
//STEP002Q EXEC PGM=IEFBR14,PARM=11@@,DYNAMNBR=12345
//STEP002R EXEC PGM=IEFBR14,PARM=X1@,DYNAMNBR=12345
//STEP002S EXEC PGM=IEFBR14,PARM=XX1@,DYNAMNBR=12345
//STEP002T EXEC PGM=IEFBR14,PARM=XX11@,DYNAMNBR=12345
//STEP002U EXEC PGM=IEFBR14,PARM=XX11@@,DYNAMNBR=12345
//STEP002V EXEC PGM=IEFBR14,PARM=1X@,DYNAMNBR=12345
//STEP003  EXEC PGM=IEFBR14,PARM='X',DYNAMNBR=12345
//STEP004  EXEC PGM=IEFBR14,PARM='A1@/STGRPT(ON)',DYNAMNBR=12345
//STEP005  EXEC PGM=IEFBR14,PARM=&A,DYNAMNBR=12345
//STEP006  EXEC PGM=IEFBR14,PARM=&AB,DYNAMNBR=12345
//STEP007  EXEC PGM=IEFBR14,PARM=&A.1,DYNAMNBR=12345
//STEP008  EXEC PGM=IEFBR14,PARM=ZZ&A,DYNAMNBR=12345
//STEP009  EXEC PGM=IEFBR14,PARM=ZZ&A.1,DYNAMNBR=12345
//STEP010  EXEC PGM=IEFBR14,PARM='AND A ONE AND A TWO AND
//       A THREE AND A FOUR',DYNAMNBR=12345
//STEP011  EXEC PGM=IEFBR14,PARM=(A,B,C,D,E,F,G),DYNAMNBR=12345
//STEP012  EXEC PGM=IEFBR14,PARM=(A,              PARM 1
//  B,                                            PARM 2
//    C,                                          PARM 3
// D,                                             PARM 4
//         E,                                     PARM 5
//      F,                                        PARM 6
//        G),DYNAMNBR=12345                       PARM 7
//STEP013  EXEC PGM=IEFBR14,
// PARM=(A,
// B,
// C,
// D,
// E,F,
//         G),
// DYNAMNBR=12345
//STEP014  EXEC PGM=IEFBR14,PARM=('ABC',&A,7,'BLAH
//  BLAH BLAH'),DYNAMNBR=12345
//STEP015  EXEC PGM=IEFBR14,PARM=X,DYNAMNBR=12345 moo
//STEP016  EXEC IAYEAYE,PARM.STEPA=X,DYNAMNBR.STEPA=12345
//STEP017  EXEC IAYEAYE,PARM.STEPA=X,PARM.STEPB=Y,
// DYNAMNBR.STEPA=&DYNAMNBR
//STEP018  EXEC IAYEAYE,
// PARM.STEPA=(A,B,C),
// PARM.STEPB=(D,E,F),
// DYNAMNBR.STEPA=12345
