//COMMAND JOB
//*
//COMMAND1 COMMAND 'F CICSPROD,SHUTD'
//COMMAND2 COMMAND 'F FILEHAND,PEND/DUMP'
//COMMAND3 COMMAND 'START MYTASK,PARM=''AERYN,CHIANA,CRICHTON,D''ARGO,M
//             OYA,PILOT,RYGEL,ZHANN'
//*                                                                     00000000
//COMMAND1 COMMAND 'F CICSPROD,SHUTD'                                   00000000
//COMMAND2 COMMAND 'F FILEHAND,PEND/DUMP'                               00000000
//COMMAND3 COMMAND 'START MYTASK,PARM=''AERYN,CHIANA,CRICHTON,D''ARGO,M 00000000
//             OYA,PILOT,RYGEL,ZHANN'                                   00000000

