//JOBPARM JOB
/*JOBPARM B=Y,M=1,C=1,N=1,F=STD,K=1,L=1,J,G=1,P=PROC1,E=Y,R=2,S=*,T=1
/*JOBPARM B=Y
/*JOBPARM M=1
/*JOBPARM C=1
/*JOBPARM N=1
/*JOBPARM F=STD
/*JOBPARM K=1
/*JOBPARM L=1
/*JOBPARM J
/*JOBPARM G=1
/*JOBPARM P=PROC1
/*JOBPARM E=Y
/*JOBPARM R=2
/*JOBPARM S=*
/*JOBPARM T=1
/*JOBPARM BURST=Y
/*JOBPARM BYTES=1
/*JOBPARM CARDS=1
/*JOBPARM COPIES=1
/*JOBPARM FORMS=STD
/*JOBPARM LINECT=1
/*JOBPARM LINES=1
/*JOBPARM NOLOG
/*JOBPARM PAGES=1
/*JOBPARM PROCLIB=PROC1
/*JOBPARM RESTART=Y
/*JOBPARM ROOM=2
/*JOBPARM SYSAFF=*
/*JOBPARM SYSAFF=(*)
/*JOBPARM SYSAFF=(*,IND)
/*JOBPARM SYSAFF=ANY
/*JOBPARM SYSAFF=(ANY)
/*JOBPARM SYSAFF=(ANY,IND)
/*JOBPARM SYSAFF=DREN
/*JOBPARM SYSAFF=(DREN)
/*JOBPARM SYSAFF=(DREN,IND)
/*JOBPARM SYSAFF=(DREN,FRAK)
/*JOBPARM SYSAFF=(DREN,FRAK,PROD)
/*JOBPARM SYSAFF=((DREN,FRAK,PROD),IND)
/*JOBPARM TIME=9999
// EXEC PGM=IEFBR14
