//MANYPROC JOB
//*
//JS01     EXEC PROC=PROCA001,PARM1=ABC
//*
//JS02     EXEC PGM=IEFBR14
//DD01     DD  DISP=(OLD,DELETE),DSN=CHARLES.EDWIN.CRYSTAL.NIKO
//*
