//ZEBULON JOB MSGLEVEL=(1,0),MSGCLASS=U,CLASS=P,NOTIFY=&SYSUID
//USER OUTPUT JESDS=ALL,DEFAULT=YES,CLASS='9'
// EXPORT SYMLIST=*
// SET X='THIS IS A LONG SYMBOL VALUE.'
//*
//S1 EXEC PGM=IEBGENER
//SYSPRINT DD SYSOUT=(,)
//SYSIN DD DUMMY
//SYSUT1 DD *,SYMBOLS=(CNVTSYS,LOGDD),DCB=LRECL=255 hi there
LOTS OF DATA TO FILL UP A LINE, FOLLOWED BY A LONG SYMBOL TO SEE &X
Extra line to make DD * variable record length
//SYSUT2 DD SYSOUT=(,)
//LOGDD  DD SYSOUT=(,)
