//SEGMENT JOB
//*
//STEP0001 EXEC PGM=IEBGENER
//DD000001 DD  SEGMENT=1
//DD000002 DD  SEGMENT=255
//DD000003 DD  SEGMENT=32767
//DD000004 DD  SEGMENT=&SEGMENT
//DD000011 DD  SEGMENT=1 SEGMENT
//DD000012 DD  SEGMENT=255 SEGMENT
//DD000013 DD  SEGMENT=32767 SEGMENT
//DD000014 DD  SEGMENT=&SEGMENT SEGMENT

