//ALPHA   JOB   123,TENSPOT,CLASS=F,MSGCLASS=A,MSGLEVEL=(1,1)
//ALPHA1  EXEC PGM=J8675309
//DD000001 DD  DISP=SHR,DSN=DATA.SET.NAME.#0000001
//DD000002 DD  DISP=SHR,DSN=DATA.SET.NAME.#0000002
//DD000003 DD  DISP=SHR,DSN=&DSNQ1.DATA.SET.NAME.#0000003
//DD000004 DD  DISP=SHR,DSN=DATA&DSNQ1..SET.NAME.#0000004
//DD000005 DD  DISP=SHR,DSN=&DSNQ1..SET.NAME.#0000001
//* 
//LOS     JOB   ,'I E STUFF',TIME=(4,30),MSGCLASS=W,MSGLEVEL=(2,0)
//LOS1 EXEC PGM=IEFBR14
//SYSIN DD DATA,DLM=$$
//FIRST LINE OF DD DATA
//SECOND LINE OF DD DATA
$$
//* 
//MART    JOB   1802,RESTART=STEP5 THIS IS THE THIRD JOB STATEMENT.
//JOBLIB   DD  DISP=SHR,DSN=SYS1.EXLIB
//         DD  DISP=SHR,DSN=SYS2.EXLIB
//P99 PROC  
//S0101 EXEC PGM=P99PGM,  
// PARM='ELBOWGREASE'  
// PEND  
//*
// EXEC PROC=P99
//* 
//UNDONE  JOB
// EXEC PGM=#0001,PARM=&ABC
//STEPLIB  DD  DISP=SHR,DSN=SYS1.EXLIB
//         DD  DISP=SHR,DSN=SYS2.EXLIB
//* 
//Z104    JOB   'D94,987',USER=SEC000,GROUP=B37,PASSWORD=YYZ
//TSO      EXEC PGM=IKJEFT01
//SYSTSIN  DD  * abc
 DSN SYSTEM(DB2P)
 RUN PROGRAM(X2UNLOAD) PLAN(X2UNLOAD)
//* 
//RUN1    JOB   'D8306P,B67,B1062J12,S=C','TOBE HOOPER',MSGCLASS=R,
//      MSGLEVEL=(1,1),CLASS=3,NOTIFY=B67TCH1, SIXTH JOB STATEMENT
//      COND=(8,LT)
// EXEC PGM=$#@111
//RUN1A   EXEC PGM=$1,COND=(4,EQ) INLINE COMMENT
//RUN1B   EXEC PGM=$2,COND=((0,EQ,RUN1A),(17,EQ,RUN1A))
//RUN1C   EXEC PGM=$3, GONNA CHECK THE COND NEXT
//        COND=((0,EQ,RUN1A), RUN1A GOTTA END OKAY
//         (0,EQ,RUN1B),      RUN1B GOTTA END OKAY TOO
//         EVEN)              AND THEN THERE'S THIS
//VSAMDS1  DD  AMP=('BUFSP=200,BUFND=2',     boo
//           'BUFNI=3,STRNO=4,SYNAD=ERROR')  
//VSAMDS2  DD  AMP=('BUFSP=200,BUFND=2,
//           BUFNI=3,STRNO=4,SYNAD=ERROR') 
//*  
//LONGJOB1 JOB '0A2B4C6D8E,F2G4H6I8J,K2L4M6N8OCP2Q4R6S8TDU2V4W6X8TEZ2AB
//             4B6C8D','A LONG ACCOUNTING STRING',CLASS=Q 
//X EXEC PGM=IEFBR14
//XD DD DISP=(NEW,CATLG,DELETE),DSN=ABC.DEF.GHI,
// AVGREC=K,LRECL=80,RECFM=FB,SPACE=(80,(10,10),RLSE)
//*    
//LONGJOB2 JOB 'ABCDEFGHIJ,KLMNOPQRS,TUVWXYZABCDEFGHIJKLMNOPQRSTUVWXYZ0
//             ABCDEF','A LONG ACCOUNTING STRING',CLASS=Q  
//Y EXEC PGM=IEFBR14
//VSAMDS3  DD  DSNAME=DSM.CLASS,DISP=SHR,AMP=('BUFSP=200,BUFND=2',
//           'BUFNI=3,STRNO=4,SYNAD=ERROR')
//STEPNAME EXEC PGM=ABC                                                 00000000
//*                                                                     00000000
