//KEYLABL1 JOB
//*
//STEP0001 EXEC PGM=IDCAMS
//DD000001 DD  KEYLABL1=1
//DD000002 DD  KEYLABL1=A
//DD000003 DD  KEYLABL1=$
//DD000004 DD  KEYLABL1=1A
//DD000005 DD  KEYLABL1=1@
//DD000006 DD  KEYLABL1=A1
//DD000007 DD  KEYLABL1=A#
//DD000008 DD  KEYLABL1=$1
//DD000009 DD  KEYLABL1=@A
//DD000010 DD  KEYLABL1=123456789A123456789B123456789C123456789D12345
//DD000011 DD  KEYLABL1=.
//DD000012 DD  KEYLABL1=1.2.3.4
//DD000013 DD  KEYLABL1=A.B.C.D
//DD000014 DD  KEYLABL1=&KEYLABL1
//DD000015 DD  KEYLABL1='!'
//DD000016 DD  KEYLABL1=''''
//DD000017 DD  KEYLABL1='********************
// *******************'
//DD000018 DD  KEYLABL1=....................
//DD000019 DD  KEYLABL1=&KEY1
//DD000101 DD  KEYLABL1=1 KEYLABL1
//DD000102 DD  KEYLABL1=A KEYLABL1
//DD000103 DD  KEYLABL1=$ KEYLABL1
//DD000104 DD  KEYLABL1=1A KEYLABL1
//DD000105 DD  KEYLABL1=1@ KEYLABL1
//DD000106 DD  KEYLABL1=A1 KEYLABL1
//DD000107 DD  KEYLABL1=A# KEYLABL1
//DD000108 DD  KEYLABL1=$1 KEYLABL1
//DD000109 DD  KEYLABL1=@A KEYLABL1
//DD000111 DD  KEYLABL1=. KEYLABL1
//DD000112 DD  KEYLABL1=1.2.3.4 KEYLABL1
//DD000113 DD  KEYLABL1=A.B.C.D KEYLABL1
//DD000114 DD  KEYLABL1=&KEYLABL1 KEYLABL1
//DD000115 DD  KEYLABL1='!' KEYLABL1
//DD000116 DD  KEYLABL1='''' KEYLABL1
//DD000118 DD  KEYLABL1=.................... KEYLABL1
//DD000119 DD  KEYLABL1=&KEY1 KEYLABL1

