//TERM JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  TERM=TS
//DD000002 DD  TERM=&TERM
//DD000003 DD  TERM=TS TERM
//DD000004 DD  TERM=&TERM TERM
