//CHKPT JOB
//*
//STEP0001 EXEC PGM=IEBDG
//DD000001 DD  CHKPT=EOV
//DD000002 DD  CHKPT=EOV CHKPT
//DD000003 DD  CHKPT=EOV
//         DD  CHKPT=EOV
//         DD  CHKPT=EOV
