//XMIT JOB
//*
//XMIT0002 XMIT DEST=VERSE.ALPHA
Charlie Jade
01 Boxer
//XMIT0003 XMIT SUBCHARS='!!'
Karl Lubinsky
//XMIT0004 XMIT DLM=$$
Sew Sew Tukarrs
//*
/*
//
$$
//XMIT0005 XMIT DEST=VERSE.BETA,SUBCHARS=@@,DLM=AEIOU
Jasmine
//
//*
/*
AEIOU
//XMIT0006 XMIT DEST=VERSE.BETA,
//             SUBCHARS=@@,
//             DLM=AEIOU
Essa Rompkin
//
//*
/*
AEIOU
//XMIT0007 XMIT DEST=VERSE.BETA,
//* embedded comment 1
//             SUBCHARS=@@,
//* embedded comment 2
//             DLM='AEIOU12345@#$'
Reena
//
//*
/*
AEIOU12345@#$
//XMIT0012 XMIT DEST=VERSE.ALPHA comment
Charlie Jade
01 Boxer
//XMIT0013 XMIT SUBCHARS='!!' comment
Karl Lubinsky
//XMIT0014 XMIT DLM=$$ comment
Sew Sew Tukarrs
//*
/*
//
$$
//XMIT0015 XMIT DEST=VERSE.BETA,SUBCHARS=@@,DLM=AEIOU comment
Jasmine
//
//*
/*
AEIOU
//XMIT0016 XMIT DEST=VERSE.BETA, comment1
//             SUBCHARS=@@, comment2
//             DLM=AEIOU comment3
Essa Rompkin
//
//*
/*
AEIOU
//XMIT0017 XMIT DEST=VERSE.BETA, comment 1
//* embedded comment 1
//             SUBCHARS=@@, comment 2
//* embedded comment 2
//             DLM='AEIOU12345@#$' comment 3
Reena
//
//*
/*
AEIOU12345@#$

