//DATACLAS JOB ,
//*
//STEP0001 EXEC PGM=BLERG
//DD000001 DD  DATACLAS=
//DD000002 DD  DATACLAS=1
//DD000003 DD  DATACLAS=A
//DD000004 DD  DATACLAS=@
//DD000005 DD  DATACLAS=1A
//DD000006 DD  DATACLAS=A1
//DD000007 DD  DATACLAS=1$
//DD000008 DD  DATACLAS=A#
//DD000009 DD  DATACLAS=1A@
//DD000010 DD  DATACLAS=A1#
//DD000011 DD  DATACLAS=$1A
//DD000012 DD  DATACLAS=&DATACLAS
//DD000101 DD  DATACLAS=  DATACLAS
//DD000102 DD  DATACLAS=1 DATACLAS
//DD000103 DD  DATACLAS=A DATACLAS
//DD000104 DD  DATACLAS=@ DATACLAS
//DD000105 DD  DATACLAS=1A DATACLAS
//DD000106 DD  DATACLAS=A1 DATACLAS
//DD000107 DD  DATACLAS=1$ DATACLAS
//DD000108 DD  DATACLAS=A# DATACLAS
//DD000109 DD  DATACLAS=1A@ DATACLAS
//DD000110 DD  DATACLAS=A1# DATACLAS
//DD000111 DD  DATACLAS=$1A DATACLAS
//DD000112 DD  DATACLAS=&DATACLAS DATACLAS

