//RECORG JOB
//*
//STEP0001 EXEC PGM=XVVSUB
//DD000001 DD  RECORG=KS
//DD000002 DD  RECORG=ES
//DD000003 DD  RECORG=RR
//DD000004 DD  RECORG=LS
//DD000005 DD  RECORG=&RECORG
//DD000006 DD  RECORG=KS RECORG
//DD000007 DD  RECORG=ES RECORG
//DD000008 DD  RECORG=RR RECORG
//DD000009 DD  RECORG=LS RECORG
//DD000010 DD  RECORG=&RECORG RECORG

