//OUTPUT JOB
/*OUTPUT   B=N,X=1,E=2,P=3,Z=4,N=5,G=6,D=7,C=8,O=9,Q=0,F=1,I=2,L=3
/*OUTPUT * K=4,Y=5,M=6,T=7
/*OUTPUT   B=N
/*OUTPUT * X=1
/*OUTPUT * E=2
/*OUTPUT * P=3
/*OUTPUT * Z=4
/*OUTPUT * N=5
/*OUTPUT * G=6
/*OUTPUT * D=7
/*OUTPUT * C=8
/*OUTPUT * O=9
/*OUTPUT * Q=0
/*OUTPUT * F=1
/*OUTPUT * I=2
/*OUTPUT * L=3
/*OUTPUT * K=4
/*OUTPUT * Y=5
/*OUTPUT * M=6
/*OUTPUT * T=7
/*OUTPUT   BURST=N
/*OUTPUT * CHARS=1
/*OUTPUT * CHARS=(1)
/*OUTPUT * CHARS=(1,2)
/*OUTPUT * CHARS=(1,2,3)
/*OUTPUT * CKPTLNS=2
/*OUTPUT * CKPTPGS=3
/*OUTPUT * COMPACT=4
/*OUTPUT * COPIES=5
/*OUTPUT * COPIES=(5)
/*OUTPUT * COPIES=(5,(6,7,8))
/*OUTPUT * COPYG=6
/*OUTPUT * COPYG=(6)
/*OUTPUT * COPYG=(6,7,8,9)
/*OUTPUT * DEST=NEWYORK
/*OUTPUT * DEST=(LONDON)
/*OUTPUT * DEST=(PARIS,MUNICH)
/*OUTPUT * FCB=8
/*OUTPUT * FLASH=ABCD
/*OUTPUT * FLASH=(ABCD)
/*OUTPUT * FLASH=(A,B,C,D)
/*OUTPUT * FLASH=NONE
/*OUTPUT * FLASHC=0
/*OUTPUT * FORMS=1
/*OUTPUT * INDEX=2
/*OUTPUT * LINDEX=3
/*OUTPUT * LINECT=4
/*OUTPUT * MODIFY=$123
/*OUTPUT * MODIFY=($123,ABC)
/*OUTPUT * MODTRC=6
/*OUTPUT * UCS=7
/*OUTPUT * BURST=N
/*OUTPUT   CHARS=1
/*OUTPUT   CHARS=(1)
/*OUTPUT   CHARS=(1,2)
/*OUTPUT   CHARS=(1,2,3)
/*OUTPUT   CKPTLNS=2
/*OUTPUT   CKPTPGS=3
/*OUTPUT   COMPACT=4
/*OUTPUT   COPIES=5
/*OUTPUT   COPIES=(5)
/*OUTPUT   COPIES=(5,(6,7,8))
/*OUTPUT   COPYG=6
/*OUTPUT   COPYG=(6)
/*OUTPUT   COPYG=(6,7,8,9)
/*OUTPUT   DEST=NEWYORK
/*OUTPUT   DEST=(LONDON)
/*OUTPUT   DEST=(PARIS,MUNICH)
/*OUTPUT   FCB=8
/*OUTPUT   FLASH=ABCD
/*OUTPUT   FLASH=(ABCD)
/*OUTPUT   FLASH=(A,B,C,D)
/*OUTPUT   FLASH=NONE
/*OUTPUT   FLASHC=0
/*OUTPUT   FORMS=1
/*OUTPUT   INDEX=2
/*OUTPUT   LINDEX=3
/*OUTPUT   LINECT=4
/*OUTPUT   MODIFY=$123
/*OUTPUT   MODIFY=($123,ABC)
/*OUTPUT   MODTRC=6
/*OUTPUT   UCS=7
// EXEC PGM=IEFBR14
