//GNCP JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  GNCP=1
//DD000002 DD  GNCP=255
//DD000003 DD  GNCP=&GNCP
//DD000101 DD  GNCP=1 GNCP
//DD000102 DD  GNCP=255 GNCP
//DD000103 DD  GNCP=&GNCP GNCP

