//CM01 JOB
//*
// SET X='AEIOU AND SOMETIMES Y'
// SET DSN=ABCDEF.JCL.LIBRARY
//*
//JS0103   EXEC PGM=IEFBR14,PARM='&X' THIS-INLINE-COMMENT-IS-CONTINUED X
// ON THE NEXT LINE VIA THE 'X' IN COLUMN 72.  IN FACT, THIS CAN       X
// CONTINUE OVER MULTIPLE LINES.  I AM SHOCKED AND APPALLED.
//JS0203   EXEC PGM=IEFBR14 WITH AN UNCONTINUED INLINE COMMENT
//DD01     DD  DISP=SHR,DSN=&DSN WITH A CONTINUED COMMENT EXTENDING OUT1
// FAR BEYOND WHERE SANITY WOULD ALLOW.  BUT THERE IT IS
//DD02     DD  DISP=(,PASS),                                           1
//             LRECL=80,                                               2
//             RECFM=FB,                                               3
//             SPACE=(80,(1000,1000),RLSE)
//JS0303   EXEC PGM=IEFBR14
//DD03 DD  DISP=(NEW,CATLG,DELETE),DCB=(LRECL=80,BLKSIZE=800,RECFM=FB),Z
// SPACE=(TRK,1)
