//LIMCT JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  LIMCT=1
//DD000002 DD  LIMCT=12
//DD000003 DD  LIMCT=123
//DD000004 DD  LIMCT=1234
//DD000005 DD  LIMCT=12345
//DD000006 DD  LIMCT=&LIMCT
//DD000101 DD  LIMCT=1 LIMCT
//DD000102 DD  LIMCT=12 LIMCT
//DD000103 DD  LIMCT=123 LIMCT
//DD000104 DD  LIMCT=1234 LIMCT
//DD000105 DD  LIMCT=12345 LIMCT
//DD000106 DD  LIMCT=&LIMCT LIMCT
//DD000201 DD  DCB=LIMCT=1
//DD000202 DD  DCB=LIMCT=12
//DD000203 DD  DCB=LIMCT=123
//DD000204 DD  DCB=LIMCT=1234
//DD000205 DD  DCB=LIMCT=12345
//DD000206 DD  DCB=LIMCT=&DCBLIMCT
//DD000301 DD  DCB=LIMCT=1 DCB=LIMCT
//DD000302 DD  DCB=LIMCT=12 DCB=LIMCT
//DD000303 DD  DCB=LIMCT=123 DCB=LIMCT
//DD000304 DD  DCB=LIMCT=1234 DCB=LIMCT
//DD000305 DD  DCB=LIMCT=12345 DCB=LIMCT
//DD000306 DD  DCB=LIMCT=&DCBLIMCT DCB=LIMCT
//DD000401 DD  DCB=(LIMCT=1)
//DD000402 DD  DCB=(LIMCT=12)
//DD000403 DD  DCB=(LIMCT=123)
//DD000404 DD  DCB=(LIMCT=1234)
//DD000405 DD  DCB=(LIMCT=12345)
//DD000406 DD  DCB=(LIMCT=&DCBLIMCT)
//DD000501 DD  DCB=(LIMCT=1) DCB=LIMCT
//DD000502 DD  DCB=(LIMCT=12) DCB=LIMCT
//DD000503 DD  DCB=(LIMCT=123) DCB=LIMCT
//DD000504 DD  DCB=(LIMCT=1234) DCB=LIMCT
//DD000505 DD  DCB=(LIMCT=12345) DCB=LIMCT
//DD000506 DD  DCB=(LIMCT=&DCBLIMCT) DCB=LIMCT
//DD000601 DD  DCB=(PCI=(A,A),LIMCT=1)
//DD000602 DD  DCB=(LIMCT=12,PCI=(A,A))
//DD000603 DD  DCB=(LRECL=X,LIMCT=123)
//DD000604 DD  DCB=(LIMCT=1234,LRECL=X)
//DD000605 DD  DCB=(FUNC=IR,LIMCT=12345)
//DD000606 DD  DCB=(LIMCT=&DCBLIMCT,FUNC=IR)
//DD000701 DD  DCB=(LIMCT=1,
// RESERVE=(0,0))
//DD000702 DD  DCB=(RESERVE=(0,0),
// LIMCT=12)
//DD000703 DD  DCB=(LIMCT=123,
// RESERVE=(0,0),PCI=(A,A))
//DD000704 DD  DCB=(PCI=(A,A),
// RESERVE=(0,0),LIMCT=1234)
//DD000705 DD  DCB=(MODE=CO,LIMCT=12345,OPTCD=C)
//DD000706 DD  DCB=(LIMCT=&DCBLIMCT,OPTCD=&OPTCD)
//DD000707 DD  DCB=(LRECL=X,
// LIMCT=255,
// BLKSIZE=80)
//DD000801 DD  DCB=(LIMCT=1, LIMCT
// RESERVE=(0,0)) RESERVE
//DD000802 DD  DCB=(RESERVE=(0,0), RESERVE
// LIMCT=12) LIMCT
//DD000803 DD  DCB=(LIMCT=123, LIMCT
// RESERVE=(0,0),PCI=(A,A)) RESERVE & PCI
//DD000804 DD  DCB=(PCI=(A,A), PCI
// RESERVE=(0,0),LIMCT=1234) RESERVE & LIMCT
//DD000805 DD  DCB=(MODE=CO,LIMCT=12345,OPTCD=C) DCB
//DD000806 DD  DCB=(LIMCT=&DCBLIMCT,OPTCD=&OPTCD) DCB
//DD000807 DD  DCB=(LRECL=X, LRECL
// LIMCT=255, LIMCT
// BLKSIZE=80) BLKSIZE
