//SIGNON JOB
/*SIGNON       CHICAGO01ABCDEFGH
/*SIGNON       MADISON01ABCDEFGH  IJKLMNOP
/*SIGNON       DULUTH001ABCDEFGH  IJKLMNOP                              QRSTUVWX
/*SIGNOFF 
/*SIGNON       X        A       
/*SIGNON       Y        A         I       
/*SIGNON       Z        A         I                                     Q       
/*XEQ N9
/*XEQ MONTANA.CSCHNEID
// EXEC PGM=IEFBR14

