//DLMSTMT1 JOB
//*
//JOOL     EXEC PGM=NORANTI
/*
//DLMSTMT2 JOB
//*
//MOYA     EXEC PGM=TALYN
/* It is by will alone I set my mind in motion.
//DLMSTMT3 JOB
//*
//CHIANA   EXEC PGM=SIKOZU
//*
