//GDGORDER JOB
//*
//STEP0001 EXEC PGM=IEBGENER
//DD000001 DD  GDGORDER=FIFO
//DD000002 DD  GDGORDER=LIFO
//DD000003 DD  GDGORDER=USECATLG
//DD000004 DD  GDGORDER=&GDGORDER
//DD000101 DD  GDGORDER=FIFO GDGORDER
//DD000102 DD  GDGORDER=LIFO GDGORDER
//DD000103 DD  GDGORDER=USECATLG GDGORDER
//DD000104 DD  GDGORDER=&GDGORDER GDGORDER

