//DCB JOB ,
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  BFALN=F
//DD000002 DD  BFALN=D
//DD000003 DD  BFALN=&BFALN
//DD000004 DD  BFTEK=F
//DD000005 DD  BFTEK=R
//DD000006 DD  BFTEK=D
//DD000007 DD  BFTEK=S
//DD000008 DD  BFTEK=A
//DD000009 DD  BFTEK=&BFTEK
//DD000010 DD  BLKSIZE=27998
//DD000011 DD  BLKSIZE=27K
//DD000012 DD  BLKSIZE=10M
//DD000013 DD  BLKSIZE=1G
//DD000014 DD  BLKSIZE=&BLKSIZE
//DD000015 DD  BUFIN=1
//DD000016 DD  BUFIN=65535
//DD000017 DD  BUFIN=&BUFIN
//DD000018 DD  BUFL=1
//DD000019 DD  BUFL=32760
//DD000020 DD  BUFL=&BUFL
//DD000021 DD  BUFMAX=2
//DD000022 DD  BUFMAX=15
//DD000023 DD  BUFMAX=255
//DD000024 DD  BUFMAX=&BUFMAX
//DD000025 DD  BUFNO=1
//DD000026 DD  BUFNO=255
//DD000027 DD  BUFNO=1000
//DD000028 DD  BUFNO=&BUFNO
//DD000029 DD  BUFOFF=0
//DD000030 DD  BUFOFF=7
//DD000031 DD  BUFOFF=99
//DD000032 DD  BUFOFF=L
//DD000033 DD  BUFOFF=&BUFOFF
//DD000034 DD  BUFOUT=1
//DD000035 DD  BUFOUT=15
//DD000036 DD  BUFOUT=32768
//DD000037 DD  BUFOUT=&BUFOUT
//DD000038 DD  BUFSIZE=1
//DD000039 DD  BUFSIZE=255
//DD000040 DD  BUFSIZE=65535
//DD000041 DD  BUFSIZE=&BUFSIZE
//DD000042 DD  CPRI=R
//DD000043 DD  CPRI=E
//DD000044 DD  CPRI=S
//DD000045 DD  CPRI=&CPRI
//DD000046 DD  CYLOFL=1
//DD000047 DD  CYLOFL=255
//DD000048 DD  CYLOFL=999999
//DD000049 DD  CYLOFL=&CYLOFL
//DD000050 DD  DEN=1
//DD000051 DD  DEN=2
//DD000052 DD  DEN=3
//DD000053 DD  DEN=4
//DD000054 DD  DEN=99
//DD000055 DD  DEN=&DEN
//DD000056 DD  DIAGNS=TRACE
//DD000057 DD  DSORG=PS
//DD000058 DD  DSORG=PSU
//DD000059 DD  DSORG=DA
//DD000060 DD  DSORG=DAU
//DD000061 DD  DSORG=PO
//DD000062 DD  DSORG=POU
//DD000063 DD  DSORG=CX
//DD000064 DD  DSORG=GS
//DD000065 DD  DSORG=&DSORG
//DD000066 DD  EROPT=ACC
//DD000067 DD  EROPT=SKP
//DD000068 DD  EROPT=ABE
//DD000069 DD  EROPT=&ERROPT
//DD000079 DD  FUNC=X
//DD000080 DD  FUNC=I
//DD000081 DD  FUNC=WT
//DD000082 DD  FUNC=RWT
//DD000083 DD  FUNC=RPWXT
//DD000084 DD  FUNC=PWX
//DD000085 DD  FUNC=R
//DD000086 DD  FUNC=RP
//DD000087 DD  FUNC=PW
//DD000088 DD  FUNC=RPWD     
//DD000089 DD  FUNC=RPWX
//DD000090 DD  FUNC=P
//DD000091 DD  FUNC=RPD
//DD000092 DD  FUNC=PWXT
//DD000093 DD  FUNC=RWX
//DD000094 DD  FUNC=RWX
//DD000095 DD  FUNC=W
//DD000096 DD  FUNC=RW
//DD000097 DD  FUNC=RPW
//DD000098 DD  FUNC=RWXT
//DD000099 DD  FUNC=&FUNC
//DD000100 DD  GNCP=1
//DD000101 DD  GNCP=100
//DD000102 DD  GNCP=&GNCP
//DD000103 DD  INTVL=0
//DD000104 DD  INTVL=65535
//DD000105 DD  IPLTXID=THISONE
//DD000106 DD  IPLTXID=@3704#01
//DD000107 DD  IPLTXID=&IPLTXID
//DD000108 DD  KEYLEN=0
//DD000109 DD  KEYLEN=255
//DD000110 DD  KEYLEN=99999
//DD000111 DD  KEYLEN=&KEYLEN
//DD000112 DD  LIMCT=7
//DD000113 DD  LIMCT=4096
//DD000114 DD  LIMCT=&LIMCT
//DD000115 DD  LRECL=1
//DD000116 DD  LRECL=255
//DD000117 DD  LRECL=65535
//DD000118 DD  LRECL=16383K
//DD000119 DD  LRECL=X
//DD000120 DD  LRECL=&LRECL
//DD000121 DD  MODE=C
//DD000122 DD  MODE=E
//DD000123 DD  MODE=O
//DD000124 DD  MODE=R
//DD000125 DD  MODE=CO
//DD000126 DD  MODE=RC
//DD000127 DD  MODE=RE
//DD000128 DD  MODE=CEOR
//DD000129 DD  MODE=&MODE
//DD000130 DD  NCP=1
//DD000131 DD  NCP=255
//DD000132 DD  NCP=&NCP
//DD000133 DD  NTM=1
//DD000134 DD  NTM=255
//DD000135 DD  NTM=&NTM
//DD000136 DD  OPTCD=A
//DD000137 DD  OPTCD=C
//DD000138 DD  OPTCD=W
//DD000139 DD  OPTCD=AEFW
//DD000140 DD  OPTCD=B
//DD000141 DD  OPTCD=T
//DD000142 DD  OPTCD=ZCTBU
//DD000143 DD  OPTCD=&OPTCD
//DD000144 DD  PCI=N
//DD000145 DD  PCI=(N,N)
//DD000146 DD  PCI=A
//DD000147 DD  PCI=(A)
//DD000148 DD  PCI=(A,A)
//DD000149 DD  PCI=&PCI
//DD000150 DD  PCI=(&PCI)
//DD000151 DD  PCI=(&PCI1,R)
//DD000152 DD  PCI=(R,&PCI2)
//DD000153 DD  PCI=(&PCI1,&PCI2)
//DD000154 DD  PRTSP=0
//DD000155 DD  PRTSP=1
//DD000156 DD  PRTSP=2
//DD000157 DD  PRTSP=3
//DD000158 DD  PRTSP=&PRTSP
//DD000159 DD  RECFM=F
//DD000160 DD  RECFM=FB
//DD000161 DD  RECFM=FBS
//DD000162 DD  RECFM=FBT
//DD000163 DD  RECFM=U
//DD000164 DD  RECFM=UTM
//DD000165 DD  RECFM=UA
//DD000166 DD  RECFM=VBS
//DD000167 DD  RECFM=FBA
//DD000168 DD  RECFM=VBA
//DD000169 DD  RECFM=DBSAUFMTV
//DD000170 DD  RECFM=&RECFM
//DD000171 DD  RESERVE=(0,0)
//DD000172 DD  RESERVE=(255,255)
//DD000173 DD  RESERVE=(&RESERVE,255)
//DD000174 DD  RESERVE=(255,&RESERVE)
//DD000175 DD  RESERVE=(&RESERVE1,&RESERVE2)
//DD000176 DD  RKP=1
//DD000177 DD  RKP=255
//DD000178 DD  RKP=&RKP
//DD000179 DD  STACK=1
//DD000180 DD  STACK=2
//DD000181 DD  STACK=32768
//DD000182 DD  STACK=&STACK
//DD000183 DD  THRESH=0
//DD000184 DD  THRESH=255
//DD000185 DD  THRESH=&THRESH
//DD000186 DD  THRESH=95
//DD000187 DD  TRTCH=C
//DD000188 DD  TRTCH=E
//DD000189 DD  TRTCH=T
//DD000190 DD  TRTCH=ET
//DD000191 DD  TRTCH=COMP
//DD000192 DD  TRTCH=NOCOMP
//DD000193 DD  TRTCH=&TRTCH
