//UHTRED JOB
//*
// JCLLIB PROCLIB=PROC00
//*
//UHTREDJR EXEC PROC=BBANBURG
//*
//TESTJCL1 JOB
// JCLLIB ORDER=SYS1.PROCLIB,PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCL2 JOB
// JCLLIB ORDER='SYS1.PROCLIB',PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCL3 JOB
// JCLLIB ORDER=(SYS1.PROCLIB),PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCL4 JOB
// JCLLIB ORDER=('SYS1.PROCLIB'),PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCL5 JOB
// JCLLIB ORDER=(SYS1.PROCLIB,USER.PROCLIB),PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCL6 JOB
// JCLLIB ORDER=('SYS1.PROCLIB',USER.PROCLIB),PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCL7 JOB
// JCLLIB ORDER=(SYS1.PROCLIB,'USER.PROCLIB'),PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCL8 JOB
// JCLLIB ORDER=('SYS1.PROCLIB','USER.PROCLIB'),PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCL9 JOB
// JCLLIB ORDER=(SYS1.PROCLIB,
//        USER.PROCLIB),PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCLA JOB
// JCLLIB ORDER=('SYS1.PROCLIB',
//        USER.PROCLIB),PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCLB JOB
// JCLLIB ORDER=(SYS1.PROCLIB,
//        'USER.PROCLIB'),PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCLC JOB
// JCLLIB ORDER=('SYS1.PROCLIB',
//        'USER.PROCLIB'),PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCLD JOB
// JCLLIB ORDER=('SYS1.PROCLIB',
//        'USER.PROCLIB',
//        '&SYSUID..PROCLIB'),PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCL1 JOB
// JCLLIB ORDER=SYS1.PROCLIB  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCL2 JOB
// JCLLIB ORDER='SYS1.PROCLIB'  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCL3 JOB
// JCLLIB ORDER=(SYS1.PROCLIB)  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCL4 JOB
// JCLLIB ORDER=('SYS1.PROCLIB')  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCL5 JOB
// JCLLIB ORDER=(SYS1.PROCLIB,USER.PROCLIB)  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCL6 JOB
// JCLLIB ORDER=('SYS1.PROCLIB',USER.PROCLIB)  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCL7 JOB
// JCLLIB ORDER=(SYS1.PROCLIB,'USER.PROCLIB')  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCL8 JOB
// JCLLIB ORDER=('SYS1.PROCLIB','USER.PROCLIB')  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCL9 JOB
// JCLLIB ORDER=(SYS1.PROCLIB,  comment
//        USER.PROCLIB)  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCLA JOB
// JCLLIB ORDER=('SYS1.PROCLIB',  comment
//        USER.PROCLIB)  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCLB JOB
// JCLLIB ORDER=(SYS1.PROCLIB,  comment
//        'USER.PROCLIB')  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCLC JOB
// JCLLIB ORDER=('SYS1.PROCLIB',  comment
//        'USER.PROCLIB')  comment
// EXEC PGM=IEFBR14
//* 
//TESTJCLD JOB
// JCLLIB ORDER=('SYS1.PROCLIB',  comment
//        'USER.PROCLIB',  comment
//        '&SYSUID..PROCLIB') comment
// EXEC PGM=IEFBR14
//* 
//TESTJCL1 JOB
// JCLLIB ORDER=SYS1.PROCLIB,
//        PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCL2 JOB
// JCLLIB ORDER='SYS1.PROCLIB',
//        PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCL3 JOB
// JCLLIB ORDER=(SYS1.PROCLIB),
//        PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCL4 JOB
// JCLLIB ORDER=('SYS1.PROCLIB'),
//        PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCL5 JOB
// JCLLIB ORDER=(SYS1.PROCLIB,USER.PROCLIB),
//        PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCL6 JOB
// JCLLIB ORDER=('SYS1.PROCLIB',USER.PROCLIB),
//        PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCL7 JOB
// JCLLIB ORDER=(SYS1.PROCLIB,'USER.PROCLIB'),
//        PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCL8 JOB
// JCLLIB ORDER=('SYS1.PROCLIB','USER.PROCLIB'),
//        PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCL9 JOB
// JCLLIB ORDER=(SYS1.PROCLIB,
//        USER.PROCLIB),
//        PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCLA JOB
// JCLLIB ORDER=('SYS1.PROCLIB',
//        USER.PROCLIB),
//        PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCLB JOB
// JCLLIB ORDER=(SYS1.PROCLIB,
//        'USER.PROCLIB'),
//        PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCLC JOB
// JCLLIB ORDER=('SYS1.PROCLIB',
//        'USER.PROCLIB'),
//        PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCLD JOB
// JCLLIB ORDER=('SYS1.PROCLIB',
//        'USER.PROCLIB',
//        '&SYSUID..PROCLIB'),
//        PROCLIB=PROC00
// EXEC PGM=IEFBR14
//* 
//TESTJCL1 JOB
// JCLLIB ORDER=SYS1.PROCLIB,
//        PROCLIB=PROC00,PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL2 JOB
// JCLLIB ORDER='SYS1.PROCLIB',
//        PROCLIB=PROC00,PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL3 JOB
// JCLLIB ORDER=(SYS1.PROCLIB),
//        PROCLIB=PROC00,PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL4 JOB
// JCLLIB ORDER=('SYS1.PROCLIB'),
//        PROCLIB=PROC00,PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL5 JOB
// JCLLIB ORDER=(SYS1.PROCLIB,USER.PROCLIB),
//        PROCLIB=PROC00,PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL6 JOB
// JCLLIB ORDER=('SYS1.PROCLIB',USER.PROCLIB),
//        PROCLIB=PROC00,PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL7 JOB
// JCLLIB ORDER=(SYS1.PROCLIB,'USER.PROCLIB'),
//        PROCLIB=PROC00,PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL8 JOB
// JCLLIB ORDER=('SYS1.PROCLIB','USER.PROCLIB'),
//        PROCLIB=PROC00,PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL9 JOB
// JCLLIB ORDER=(SYS1.PROCLIB,
//        USER.PROCLIB),
//        PROCLIB=PROC00,PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCLA JOB
// JCLLIB ORDER=('SYS1.PROCLIB',
//        USER.PROCLIB),
//        PROCLIB=PROC00,PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCLB JOB
// JCLLIB ORDER=(SYS1.PROCLIB,
//        'USER.PROCLIB'),
//        PROCLIB=PROC00,PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCLC JOB
// JCLLIB ORDER=('SYS1.PROCLIB',
//        'USER.PROCLIB'),
//        PROCLIB=PROC00,PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCLD JOB
// JCLLIB ORDER=('SYS1.PROCLIB',
//        'USER.PROCLIB',
//        '&SYSUID..PROCLIB'),
//        PROCLIB=PROC00,PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL1 JOB
// JCLLIB PROCLIB=PROC00,ORDER=SYS1.PROCLIB,
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL2 JOB
// JCLLIB PROCLIB=PROC00,ORDER='SYS1.PROCLIB',
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL3 JOB
// JCLLIB PROCLIB=PROC00,ORDER=(SYS1.PROCLIB),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL4 JOB
// JCLLIB PROCLIB=PROC00,ORDER=('SYS1.PROCLIB'),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL5 JOB
// JCLLIB PROCLIB=PROC00,ORDER=(SYS1.PROCLIB,USER.PROCLIB),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL6 JOB
// JCLLIB PROCLIB=PROC00,ORDER=('SYS1.PROCLIB',USER.PROCLIB),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL7 JOB
// JCLLIB PROCLIB=PROC00,ORDER=(SYS1.PROCLIB,'USER.PROCLIB'),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL8 JOB
// JCLLIB PROCLIB=PROC00,ORDER=('SYS1.PROCLIB','USER.PROCLIB'),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL9 JOB
// JCLLIB PROCLIB=PROC00,ORDER=(SYS1.PROCLIB,
//        USER.PROCLIB),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCLA JOB
// JCLLIB PROCLIB=PROC00,ORDER=('SYS1.PROCLIB',
//        USER.PROCLIB),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCLB JOB
// JCLLIB PROCLIB=PROC00,ORDER=(SYS1.PROCLIB,
//        'USER.PROCLIB'),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCLC JOB
// JCLLIB PROCLIB=PROC00,ORDER=('SYS1.PROCLIB',
//        'USER.PROCLIB'),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCLD JOB
// JCLLIB PROCLIB=PROC00,ORDER=('SYS1.PROCLIB',
//        'USER.PROCLIB',
//        '&SYSUID..PROCLIB'),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL1 JOB
// JCLLIB PROCLIB=PROC00,
//        ORDER=SYS1.PROCLIB,
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL2 JOB
// JCLLIB PROCLIB=PROC00,
//        ORDER='SYS1.PROCLIB',
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL3 JOB
// JCLLIB PROCLIB=PROC00,
//        ORDER=(SYS1.PROCLIB),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL4 JOB
// JCLLIB PROCLIB=PROC00,
//        ORDER=('SYS1.PROCLIB'),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL5 JOB
// JCLLIB PROCLIB=PROC00,
//        ORDER=(SYS1.PROCLIB,USER.PROCLIB),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL6 JOB
// JCLLIB PROCLIB=PROC00,
//        ORDER=('SYS1.PROCLIB',USER.PROCLIB),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL7 JOB
// JCLLIB PROCLIB=PROC00,
//        ORDER=(SYS1.PROCLIB,'USER.PROCLIB'),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL8 JOB
// JCLLIB PROCLIB=PROC00,
//        ORDER=('SYS1.PROCLIB','USER.PROCLIB'),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL9 JOB
// JCLLIB PROCLIB=PROC00,
//        ORDER=(SYS1.PROCLIB,
//        USER.PROCLIB),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCLA JOB
// JCLLIB PROCLIB=PROC00,
//        ORDER=('SYS1.PROCLIB',
//        USER.PROCLIB),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCLB JOB
// JCLLIB PROCLIB=PROC00,
//        ORDER=(SYS1.PROCLIB,
//        'USER.PROCLIB'),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCLC JOB
// JCLLIB PROCLIB=PROC00,
//        ORDER=('SYS1.PROCLIB',
//        'USER.PROCLIB'),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCLD JOB
// JCLLIB PROCLIB=PROC00,
//        ORDER=('SYS1.PROCLIB',
//        'USER.PROCLIB',
//        '&SYSUID..PROCLIB'),
//        PROCLIB=PROC01
// EXEC PGM=IEFBR14
//* 
//TESTJCL1 JOB
// JCLLIB PROCLIB=PROC00, comment
//        ORDER=SYS1.PROCLIB, comment
//        PROCLIB=PROC01 comment
// EXEC PGM=IEFBR14 comment
//* 
//TESTJCL2 JOB
// JCLLIB PROCLIB=PROC00, comment
//        ORDER='SYS1.PROCLIB', comment
//        PROCLIB=PROC01 comment
// EXEC PGM=IEFBR14 comment
//* 
//TESTJCL3 JOB
// JCLLIB PROCLIB=PROC00, comment
//        ORDER=(SYS1.PROCLIB), comment
//        PROCLIB=PROC01 comment
// EXEC PGM=IEFBR14 comment
//* 
//TESTJCL4 JOB
// JCLLIB PROCLIB=PROC00, comment
//        ORDER=('SYS1.PROCLIB'), comment
//        PROCLIB=PROC01 comment
// EXEC PGM=IEFBR14 comment
//* 
//TESTJCL5 JOB
// JCLLIB PROCLIB=PROC00, comment
//        ORDER=(SYS1.PROCLIB,USER.PROCLIB), comment
//        PROCLIB=PROC01 comment
// EXEC PGM=IEFBR14 comment
//* 
//TESTJCL6 JOB
// JCLLIB PROCLIB=PROC00, comment
//        ORDER=('SYS1.PROCLIB',USER.PROCLIB), comment
//        PROCLIB=PROC01 comment
// EXEC PGM=IEFBR14 comment
//* 
//TESTJCL7 JOB
// JCLLIB PROCLIB=PROC00, comment
//        ORDER=(SYS1.PROCLIB,'USER.PROCLIB'), comment
//        PROCLIB=PROC01 comment
// EXEC PGM=IEFBR14 comment
//* 
//TESTJCL8 JOB
// JCLLIB PROCLIB=PROC00, comment
//        ORDER=('SYS1.PROCLIB','USER.PROCLIB'), comment
//        PROCLIB=PROC01 comment
// EXEC PGM=IEFBR14 comment
//* 
//TESTJCL9 JOB
// JCLLIB PROCLIB=PROC00, comment
//        ORDER=(SYS1.PROCLIB, comment
//        USER.PROCLIB), comment
//        PROCLIB=PROC01 comment
// EXEC PGM=IEFBR14 comment
//* 
//TESTJCLA JOB
// JCLLIB PROCLIB=PROC00, comment
//        ORDER=('SYS1.PROCLIB', comment
//        USER.PROCLIB), comment
//        PROCLIB=PROC01 comment
// EXEC PGM=IEFBR14
//* 
//TESTJCLB JOB
// JCLLIB PROCLIB=PROC00, comment
//        ORDER=(SYS1.PROCLIB, comment
//        'USER.PROCLIB'), comment
//        PROCLIB=PROC01 comment
// EXEC PGM=IEFBR14 comment
//* 
//TESTJCLC JOB
// JCLLIB PROCLIB=PROC00, comment
//        ORDER=('SYS1.PROCLIB', comment
//        'USER.PROCLIB'), comment
//        PROCLIB=PROC01 comment
// EXEC PGM=IEFBR14 comment
//* 
//TESTJCLD JOB 
// JCLLIB PROCLIB=PROC00, comment
//        ORDER=('SYS1.PROCLIB', comment
//        'USER.PROCLIB', comment
//        '&SYSUID..PROCLIB'), comment
//        PROCLIB=PROC01 comment
// EXEC PGM=IEFBR14 comment
//* 

