//DISP JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  DISP=NEW
//DD000002 DD  DISP=OLD
//DD000003 DD  DISP=SHR
//DD000004 DD  DISP=MOD
//DD000005 DD  DISP=&DISP
//DD000006 DD  DISP=(,CATLG)
//DD000007 DD  DISP=(,DELETE)
//DD000008 DD  DISP=(,KEEP)
//DD000009 DD  DISP=(,UNCATLG)
//DD000010 DD  DISP=(,PASS)
//DD000011 DD  DISP=(,&DISP2)
//DD000012 DD  DISP=(NEW,CATLG)
//DD000013 DD  DISP=(NEW,DELETE)
//DD000014 DD  DISP=(NEW,KEEP)
//DD000015 DD  DISP=(NEW,UNCATLG)
//DD000016 DD  DISP=(NEW,PASS)
//DD000017 DD  DISP=(NEW,&DISP2)
//DD000018 DD  DISP=(OLD,CATLG)
//DD000019 DD  DISP=(OLD,DELETE)
//DD000020 DD  DISP=(OLD,KEEP)
//DD000021 DD  DISP=(OLD,UNCATLG)
//DD000022 DD  DISP=(OLD,PASS)
//DD000023 DD  DISP=(OLD,&DISP2)
//DD000024 DD  DISP=(SHR,CATLG)
//DD000025 DD  DISP=(SHR,DELETE)
//DD000026 DD  DISP=(SHR,KEEP)
//DD000027 DD  DISP=(SHR,UNCATLG)
//DD000028 DD  DISP=(SHR,PASS)
//DD000029 DD  DISP=(SHR,&DISP2)
//DD000030 DD  DISP=(MOD,CATLG)
//DD000031 DD  DISP=(MOD,DELETE)
//DD000032 DD  DISP=(MOD,KEEP)
//DD000033 DD  DISP=(MOD,UNCATLG)
//DD000034 DD  DISP=(MOD,PASS)
//DD000035 DD  DISP=(MOD,&DISP2)
//DD000036 DD  DISP=(&DEST,CATLG)
//DD000037 DD  DISP=(&DEST,DELETE)
//DD000038 DD  DISP=(&DEST,KEEP)
//DD000039 DD  DISP=(&DEST,UNCATLG)
//DD000040 DD  DISP=(&DEST,PASS)
//DD000041 DD  DISP=(&DEST,&DISP2)
//DD000106 DD  DISP=(,,CATLG)
//DD000107 DD  DISP=(,,DELETE)
//DD000108 DD  DISP=(,,KEEP)
//DD000109 DD  DISP=(,,UNCATLG)
//DD000110 DD  DISP=(,,PASS)
//DD000111 DD  DISP=(,,&DISP2)
//DD000112 DD  DISP=(NEW,,CATLG)
//DD000113 DD  DISP=(NEW,,DELETE)
//DD000114 DD  DISP=(NEW,,KEEP)
//DD000115 DD  DISP=(NEW,,UNCATLG)
//DD000116 DD  DISP=(NEW,,PASS)
//DD000117 DD  DISP=(NEW,,&DISP2)
//DD000118 DD  DISP=(OLD,,CATLG)
//DD000119 DD  DISP=(OLD,,DELETE)
//DD000120 DD  DISP=(OLD,,KEEP)
//DD000121 DD  DISP=(OLD,,UNCATLG)
//DD000122 DD  DISP=(OLD,,PASS)
//DD000123 DD  DISP=(OLD,,&DISP2)
//DD000124 DD  DISP=(SHR,,CATLG)
//DD000125 DD  DISP=(SHR,,DELETE)
//DD000126 DD  DISP=(SHR,,KEEP)
//DD000127 DD  DISP=(SHR,,UNCATLG)
//DD000128 DD  DISP=(SHR,,PASS)
//DD000129 DD  DISP=(SHR,,&DISP2)
//DD000130 DD  DISP=(MOD,,CATLG)
//DD000131 DD  DISP=(MOD,,DELETE)
//DD000132 DD  DISP=(MOD,,KEEP)
//DD000133 DD  DISP=(MOD,,UNCATLG)
//DD000134 DD  DISP=(MOD,,PASS)
//DD000135 DD  DISP=(MOD,,&DISP2)
//DD000136 DD  DISP=(&DEST,,CATLG)
//DD000137 DD  DISP=(&DEST,,DELETE)
//DD000138 DD  DISP=(&DEST,,KEEP)
//DD000139 DD  DISP=(&DEST,,UNCATLG)
//DD000140 DD  DISP=(&DEST,,PASS)
//DD000141 DD  DISP=(&DEST,,&DISP2)
//DD000206 DD  DISP=(,CATLG,CATLG)
//DD000207 DD  DISP=(,DELETE,CATLG)
//DD000208 DD  DISP=(,KEEP,CATLG)
//DD000209 DD  DISP=(,UNCATLG,CATLG)
//DD000210 DD  DISP=(,PASS,CATLG)
//DD000211 DD  DISP=(,&DISP2,CATLG)
//DD000212 DD  DISP=(NEW,CATLG,CATLG)
//DD000213 DD  DISP=(NEW,DELETE,CATLG)
//DD000214 DD  DISP=(NEW,KEEP,CATLG)
//DD000215 DD  DISP=(NEW,UNCATLG,CATLG)
//DD000216 DD  DISP=(NEW,PASS,CATLG)
//DD000217 DD  DISP=(NEW,&DISP2,CATLG)
//DD000218 DD  DISP=(OLD,CATLG,CATLG)
//DD000219 DD  DISP=(OLD,DELETE,CATLG)
//DD000220 DD  DISP=(OLD,KEEP,CATLG)
//DD000221 DD  DISP=(OLD,UNCATLG,CATLG)
//DD000222 DD  DISP=(OLD,PASS,CATLG)
//DD000223 DD  DISP=(OLD,&DISP2,CATLG)
//DD000224 DD  DISP=(SHR,CATLG,CATLG)
//DD000225 DD  DISP=(SHR,DELETE,CATLG)
//DD000226 DD  DISP=(SHR,KEEP,CATLG)
//DD000227 DD  DISP=(SHR,UNCATLG,CATLG)
//DD000228 DD  DISP=(SHR,PASS,CATLG)
//DD000229 DD  DISP=(SHR,&DISP2,CATLG)
//DD000230 DD  DISP=(MOD,CATLG,CATLG)
//DD000231 DD  DISP=(MOD,DELETE,CATLG)
//DD000232 DD  DISP=(MOD,KEEP,CATLG)
//DD000233 DD  DISP=(MOD,UNCATLG,CATLG)
//DD000234 DD  DISP=(MOD,PASS,CATLG)
//DD000235 DD  DISP=(MOD,&DISP2,CATLG)
//DD000236 DD  DISP=(&DEST,CATLG,CATLG)
//DD000237 DD  DISP=(&DEST,DELETE,CATLG)
//DD000238 DD  DISP=(&DEST,KEEP,CATLG)
//DD000239 DD  DISP=(&DEST,UNCATLG,CATLG)
//DD000240 DD  DISP=(&DEST,PASS,CATLG)
//DD000241 DD  DISP=(&DEST,&DISP2,CATLG)
//DD000306 DD  DISP=(,CATLG,DELETE)
//DD000307 DD  DISP=(,DELETE,DELETE)
//DD000308 DD  DISP=(,KEEP,DELETE)
//DD000309 DD  DISP=(,UNCATLG,DELETE)
//DD000310 DD  DISP=(,PASS,DELETE)
//DD000311 DD  DISP=(,&DISP2,DELETE)
//DD000312 DD  DISP=(NEW,CATLG,DELETE)
//DD000313 DD  DISP=(NEW,DELETE,DELETE)
//DD000314 DD  DISP=(NEW,KEEP,DELETE)
//DD000315 DD  DISP=(NEW,UNCATLG,DELETE)
//DD000316 DD  DISP=(NEW,PASS,DELETE)
//DD000317 DD  DISP=(NEW,&DISP2,DELETE)
//DD000318 DD  DISP=(OLD,CATLG,DELETE)
//DD000319 DD  DISP=(OLD,DELETE,DELETE)
//DD000320 DD  DISP=(OLD,KEEP,DELETE)
//DD000321 DD  DISP=(OLD,UNCATLG,DELETE)
//DD000322 DD  DISP=(OLD,PASS,DELETE)
//DD000323 DD  DISP=(OLD,&DISP2,DELETE)
//DD000324 DD  DISP=(SHR,CATLG,DELETE)
//DD000325 DD  DISP=(SHR,DELETE,DELETE)
//DD000326 DD  DISP=(SHR,KEEP,DELETE)
//DD000327 DD  DISP=(SHR,UNCATLG,DELETE)
//DD000328 DD  DISP=(SHR,PASS,DELETE)
//DD000329 DD  DISP=(SHR,&DISP2,DELETE)
//DD000330 DD  DISP=(MOD,CATLG,DELETE)
//DD000331 DD  DISP=(MOD,DELETE,DELETE)
//DD000332 DD  DISP=(MOD,KEEP,DELETE)
//DD000333 DD  DISP=(MOD,UNCATLG,DELETE)
//DD000334 DD  DISP=(MOD,PASS,DELETE)
//DD000335 DD  DISP=(MOD,&DISP2,DELETE)
//DD000336 DD  DISP=(&DEST,CATLG,DELETE)
//DD000337 DD  DISP=(&DEST,DELETE,DELETE)
//DD000338 DD  DISP=(&DEST,KEEP,DELETE)
//DD000339 DD  DISP=(&DEST,UNCATLG,DELETE)
//DD000340 DD  DISP=(&DEST,PASS,DELETE)
//DD000341 DD  DISP=(&DEST,&DISP2,DELETE)
//DD000406 DD  DISP=(,CATLG,KEEP)
//DD000407 DD  DISP=(,DELETE,KEEP)
//DD000408 DD  DISP=(,KEEP,KEEP)
//DD000409 DD  DISP=(,UNCATLG,KEEP)
//DD000410 DD  DISP=(,PASS,KEEP)
//DD000411 DD  DISP=(,&DISP2,KEEP)
//DD000412 DD  DISP=(NEW,CATLG,KEEP)
//DD000413 DD  DISP=(NEW,DELETE,KEEP)
//DD000414 DD  DISP=(NEW,KEEP,KEEP)
//DD000415 DD  DISP=(NEW,UNCATLG,KEEP)
//DD000416 DD  DISP=(NEW,PASS,KEEP)
//DD000417 DD  DISP=(NEW,&DISP2,KEEP)
//DD000418 DD  DISP=(OLD,CATLG,KEEP)
//DD000419 DD  DISP=(OLD,DELETE,KEEP)
//DD000420 DD  DISP=(OLD,KEEP,KEEP)
//DD000421 DD  DISP=(OLD,UNCATLG,KEEP)
//DD000422 DD  DISP=(OLD,PASS,KEEP)
//DD000423 DD  DISP=(OLD,&DISP2,KEEP)
//DD000424 DD  DISP=(SHR,CATLG,KEEP)
//DD000425 DD  DISP=(SHR,DELETE,KEEP)
//DD000426 DD  DISP=(SHR,KEEP,KEEP)
//DD000427 DD  DISP=(SHR,UNCATLG,KEEP)
//DD000428 DD  DISP=(SHR,PASS,KEEP)
//DD000429 DD  DISP=(SHR,&DISP2,KEEP)
//DD000430 DD  DISP=(MOD,CATLG,KEEP)
//DD000431 DD  DISP=(MOD,DELETE,KEEP)
//DD000432 DD  DISP=(MOD,KEEP,KEEP)
//DD000433 DD  DISP=(MOD,UNCATLG,KEEP)
//DD000434 DD  DISP=(MOD,PASS,KEEP)
//DD000435 DD  DISP=(MOD,&DISP2,KEEP)
//DD000436 DD  DISP=(&DEST,CATLG,KEEP)
//DD000437 DD  DISP=(&DEST,DELETE,KEEP)
//DD000438 DD  DISP=(&DEST,KEEP,KEEP)
//DD000439 DD  DISP=(&DEST,UNCATLG,KEEP)
//DD000440 DD  DISP=(&DEST,PASS,KEEP)
//DD000441 DD  DISP=(&DEST,&DISP2,KEEP)
//DD000506 DD  DISP=(,CATLG,UNCATLG)
//DD000507 DD  DISP=(,DELETE,UNCATLG)
//DD000508 DD  DISP=(,KEEP,UNCATLG)
//DD000509 DD  DISP=(,UNCATLG,UNCATLG)
//DD000510 DD  DISP=(,PASS,UNCATLG)
//DD000511 DD  DISP=(,&DISP2,UNCATLG)
//DD000512 DD  DISP=(NEW,CATLG,UNCATLG)
//DD000513 DD  DISP=(NEW,DELETE,UNCATLG)
//DD000514 DD  DISP=(NEW,KEEP,UNCATLG)
//DD000515 DD  DISP=(NEW,UNCATLG,UNCATLG)
//DD000516 DD  DISP=(NEW,PASS,UNCATLG)
//DD000517 DD  DISP=(NEW,&DISP2,UNCATLG)
//DD000518 DD  DISP=(OLD,CATLG,UNCATLG)
//DD000519 DD  DISP=(OLD,DELETE,UNCATLG)
//DD000520 DD  DISP=(OLD,KEEP,UNCATLG)
//DD000521 DD  DISP=(OLD,UNCATLG,UNCATLG)
//DD000522 DD  DISP=(OLD,PASS,UNCATLG)
//DD000523 DD  DISP=(OLD,&DISP2,UNCATLG)
//DD000524 DD  DISP=(SHR,CATLG,UNCATLG)
//DD000525 DD  DISP=(SHR,DELETE,UNCATLG)
//DD000526 DD  DISP=(SHR,KEEP,UNCATLG)
//DD000527 DD  DISP=(SHR,UNCATLG,UNCATLG)
//DD000528 DD  DISP=(SHR,PASS,UNCATLG)
//DD000529 DD  DISP=(SHR,&DISP2,UNCATLG)
//DD000530 DD  DISP=(MOD,CATLG,UNCATLG)
//DD000531 DD  DISP=(MOD,DELETE,UNCATLG)
//DD000532 DD  DISP=(MOD,KEEP,UNCATLG)
//DD000533 DD  DISP=(MOD,UNCATLG,UNCATLG)
//DD000534 DD  DISP=(MOD,PASS,UNCATLG)
//DD000535 DD  DISP=(MOD,&DISP2,UNCATLG)
//DD000536 DD  DISP=(&DEST,CATLG,UNCATLG)
//DD000537 DD  DISP=(&DEST,DELETE,UNCATLG)
//DD000538 DD  DISP=(&DEST,KEEP,UNCATLG)
//DD000539 DD  DISP=(&DEST,UNCATLG,UNCATLG)
//DD000540 DD  DISP=(&DEST,PASS,UNCATLG)
//DD000541 DD  DISP=(&DEST,&DISP2,UNCATLG)
//DD000606 DD  DISP=(,CATLG,PASS)
//DD000607 DD  DISP=(,DELETE,PASS)
//DD000608 DD  DISP=(,KEEP,PASS)
//DD000609 DD  DISP=(,UNCATLG,PASS)
//DD000610 DD  DISP=(,PASS,PASS)
//DD000611 DD  DISP=(,&DISP2,PASS)
//DD000612 DD  DISP=(NEW,CATLG,PASS)
//DD000613 DD  DISP=(NEW,DELETE,PASS)
//DD000614 DD  DISP=(NEW,KEEP,PASS)
//DD000615 DD  DISP=(NEW,UNCATLG,PASS)
//DD000616 DD  DISP=(NEW,PASS,PASS)
//DD000617 DD  DISP=(NEW,&DISP2,PASS)
//DD000618 DD  DISP=(OLD,CATLG,PASS)
//DD000619 DD  DISP=(OLD,DELETE,PASS)
//DD000620 DD  DISP=(OLD,KEEP,PASS)
//DD000621 DD  DISP=(OLD,UNCATLG,PASS)
//DD000622 DD  DISP=(OLD,PASS,PASS)
//DD000623 DD  DISP=(OLD,&DISP2,PASS)
//DD000624 DD  DISP=(SHR,CATLG,PASS)
//DD000625 DD  DISP=(SHR,DELETE,PASS)
//DD000626 DD  DISP=(SHR,KEEP,PASS)
//DD000627 DD  DISP=(SHR,UNCATLG,PASS)
//DD000628 DD  DISP=(SHR,PASS,PASS)
//DD000629 DD  DISP=(SHR,&DISP2,PASS)
//DD000630 DD  DISP=(MOD,CATLG,PASS)
//DD000631 DD  DISP=(MOD,DELETE,PASS)
//DD000632 DD  DISP=(MOD,KEEP,PASS)
//DD000633 DD  DISP=(MOD,UNCATLG,PASS)
//DD000634 DD  DISP=(MOD,PASS,PASS)
//DD000635 DD  DISP=(MOD,&DISP2,PASS)
//DD000636 DD  DISP=(&DEST,CATLG,PASS)
//DD000637 DD  DISP=(&DEST,DELETE,PASS)
//DD000638 DD  DISP=(&DEST,KEEP,PASS)
//DD000639 DD  DISP=(&DEST,UNCATLG,PASS)
//DD000640 DD  DISP=(&DEST,PASS,PASS)
//DD000641 DD  DISP=(&DEST,&DISP2,PASS)
//DD000706 DD  DISP=(,CATLG,&DISP)
//DD000707 DD  DISP=(,DELETE,&DISP)
//DD000708 DD  DISP=(,KEEP,&DISP)
//DD000709 DD  DISP=(,UNCATLG,&DISP)
//DD000710 DD  DISP=(,PASS,&DISP)
//DD000711 DD  DISP=(,&DISP2,&DISP)
//DD000712 DD  DISP=(NEW,CATLG,&DISP)
//DD000713 DD  DISP=(NEW,DELETE,&DISP)
//DD000714 DD  DISP=(NEW,KEEP,&DISP)
//DD000715 DD  DISP=(NEW,UNCATLG,&DISP)
//DD000716 DD  DISP=(NEW,PASS,&DISP)
//DD000717 DD  DISP=(NEW,&DISP2,&DISP)
//DD000718 DD  DISP=(OLD,CATLG,&DISP)
//DD000719 DD  DISP=(OLD,DELETE,&DISP)
//DD000720 DD  DISP=(OLD,KEEP,&DISP)
//DD000721 DD  DISP=(OLD,UNCATLG,&DISP)
//DD000722 DD  DISP=(OLD,PASS,&DISP)
//DD000723 DD  DISP=(OLD,&DISP2,&DISP)
//DD000724 DD  DISP=(SHR,CATLG,&DISP)
//DD000725 DD  DISP=(SHR,DELETE,&DISP)
//DD000726 DD  DISP=(SHR,KEEP,&DISP)
//DD000727 DD  DISP=(SHR,UNCATLG,&DISP)
//DD000728 DD  DISP=(SHR,PASS,&DISP)
//DD000729 DD  DISP=(SHR,&DISP2,&DISP)
//DD000730 DD  DISP=(MOD,CATLG,&DISP)
//DD000731 DD  DISP=(MOD,DELETE,&DISP)
//DD000732 DD  DISP=(MOD,KEEP,&DISP)
//DD000733 DD  DISP=(MOD,UNCATLG,&DISP)
//DD000734 DD  DISP=(MOD,PASS,&DISP)
//DD000735 DD  DISP=(MOD,&DISP2,&DISP)
//DD000736 DD  DISP=(&DEST,CATLG,&DISP)
//DD000737 DD  DISP=(&DEST,DELETE,&DISP)
//DD000738 DD  DISP=(&DEST,KEEP,&DISP)
//DD000739 DD  DISP=(&DEST,UNCATLG,&DISP)
//DD000740 DD  DISP=(&DEST,PASS,&DISP)
//DD000741 DD  DISP=(&DEST,&DISP2,&DISP)


