//GJOB001 GJOB FLUSHTYP=ALLFLUSH
//GJOB002 GJOB FLUSHTYP=ANYFLUSH
//JOB001  JOBSET FLUSHTYP=ALLFLUSH
//JOB002  JOBSET FLUSHTYP=ANYFLUSH
//SJOB001 SJOB
//ENDSET  ENDSET
//ENDGROUP ENDGROUP
//GJOB001 GJOB FLUSHTYP=ALLFLUSH comment
//GJOB002 GJOB FLUSHTYP=ANYFLUSH comment
//JOB001  JOBSET FLUSHTYP=ALLFLUSH comment
//JOB002  JOBSET FLUSHTYP=ANYFLUSH comment
//SJOB001 SJOB comment
//ENDSET  ENDSET comment
//ENDGROUP ENDGROUP comment
//GJOB JOB
