//STORCLAS JOB 
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  STORCLAS=
//DD000002 DD  STORCLAS=A
//DD000003 DD  STORCLAS=@
//DD000004 DD  STORCLAS=A1234567
//DD000005 DD  STORCLAS=#ABCDEFG
//DD000006 DD  STORCLAS=&STORCLAS
//DD000011 DD  STORCLAS= STORCLAS
//DD000012 DD  STORCLAS=A STORCLAS
//DD000013 DD  STORCLAS=@ STORCLAS
//DD000014 DD  STORCLAS=A1234567 STORCLAS
//DD000015 DD  STORCLAS=#ABCDEFG STORCLAS
//DD000016 DD  STORCLAS=&STORCLAS STORCLAS
