//EXPDT JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  EXPDT=92012
//DD000002 DD  EXPDT=2001/37
//DD000003 DD  EXPDT=&EXPDT
//DD000001 DD  EXPDT=92012 EXPDT
//DD000002 DD  EXPDT=2001/37 EXPDT
//DD000003 DD  EXPDT=&EXPDT EXPDT

