//TIMETEST JOB
//*
//JS01  EXEC PGM=IEFBR14,TIME=NOLIMIT
//JS02  EXEC PGM=IEFBR14,TIME=MAXIMUM
//JS03  EXEC PGM=IEFBR14,TIME=1440
//JS04  EXEC PGM=IEFBR14,TIME=1
//JS05  EXEC PGM=IEFBR14,TIME=12
//JS06  EXEC PGM=IEFBR14,TIME=123
//JS07  EXEC PGM=IEFBR14,TIME=1234
//JS08  EXEC PGM=IEFBR14,TIME=(1)
//JS09  EXEC PGM=IEFBR14,TIME=(1,1)
//JS10  EXEC PGM=IEFBR14,TIME=(,1)
//JS11  EXEC PGM=IEFBR14,TIME=&TIME
//JS12  EXEC PGM=IEFBR14,TIME=(&TIME)
//JS13  EXEC PGM=IEFBR14,TIME=(&TM1,&TM2)

