//UCS JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  UCS=A
//DD000002 DD  UCS=#
//DD000003 DD  UCS=B2
//DD000004 DD  UCS=$C3D
//DD000005 DD  UCS=&UCS
//DD000006 DD  UCS=(A)
//DD000007 DD  UCS=(#)
//DD000008 DD  UCS=(B2)
//DD000009 DD  UCS=($C3D)
//DD000010 DD  UCS=(&UCS)
//DD000011 DD  UCS=(A,FOLD)
//DD000012 DD  UCS=(#,FOLD)
//DD000013 DD  UCS=(B2,FOLD)
//DD000014 DD  UCS=($C3D,FOLD)
//DD000015 DD  UCS=(&UCS,FOLD)
//DD000016 DD  UCS=(A,&FOLD)
//DD000017 DD  UCS=(#,&FOLD)
//DD000018 DD  UCS=(B2,&FOLD)
//DD000019 DD  UCS=($C3D,&FOLD)
//DD000020 DD  UCS=(&UCS,&FOLD)
//DD000021 DD  UCS=(A,FOLD,VERIFY)
//DD000022 DD  UCS=(#,FOLD,VERIFY)
//DD000023 DD  UCS=(B2,FOLD,VERIFY)
//DD000024 DD  UCS=($C3D,FOLD,VERIFY)
//DD000025 DD  UCS=(&UCS,FOLD,VERIFY)
//DD000026 DD  UCS=(A,&FOLD,VERIFY)
//DD000027 DD  UCS=(#,&FOLD,VERIFY)
//DD000028 DD  UCS=(B2,&FOLD,VERIFY)
//DD000029 DD  UCS=($C3D,&FOLD,VERIFY)
//DD000030 DD  UCS=(&UCS,&FOLD,VERIFY)
//DD000031 DD  UCS=(A,FOLD,&VERIFY)
//DD000032 DD  UCS=(#,FOLD,&VERIFY)
//DD000033 DD  UCS=(B2,FOLD,&VERIFY)
//DD000034 DD  UCS=($C3D,FOLD,&VERIFY)
//DD000035 DD  UCS=(&UCS,FOLD,&VERIFY)
//DD000036 DD  UCS=(A,&FOLD,&VERIFY)
//DD000037 DD  UCS=(#,&FOLD,&VERIFY)
//DD000038 DD  UCS=(B2,&FOLD,&VERIFY)
//DD000039 DD  UCS=($C3D,&FOLD,&VERIFY)
//DD000040 DD  UCS=(&UCS,&FOLD,&VERIFY)
//DD000041 DD  UCS=(A,FOLD,VERIFY)
//DD000042 DD  UCS=(#,FOLD,VERIFY)
//DD000043 DD  UCS=(B2,FOLD,VERIFY)
//DD000044 DD  UCS=($C3D,FOLD,VERIFY)
//DD000045 DD  UCS=(&UCS,FOLD,VERIFY)
//DD000046 DD  UCS=(A,,VERIFY)
//DD000047 DD  UCS=(#,,VERIFY)
//DD000048 DD  UCS=(B2,,VERIFY)
//DD000049 DD  UCS=($C3D,,VERIFY)
//DD000050 DD  UCS=(&UCS,,VERIFY)
//DD000051 DD  UCS=(A,,&VERIFY)
//DD000052 DD  UCS=(#,,&VERIFY)
//DD000053 DD  UCS=(B2,,&VERIFY)
//DD000054 DD  UCS=($C3D,,&VERIFY)
//DD000055 DD  UCS=(&UCS,,&VERIFY)
//DD000056 DD  UCS=(A,,&VERIFY)
//DD000057 DD  UCS=(#,,&VERIFY)
//DD000058 DD  UCS=(B2,,&VERIFY)
//DD000059 DD  UCS=($C3D,,&VERIFY)
//DD000060 DD  UCS=(&UCS,,&VERIFY)
//DD000001 DD  UCS=A UCS
//DD000002 DD  UCS=# UCS
//DD000003 DD  UCS=B2 UCS
//DD000004 DD  UCS=$C3D UCS
//DD000005 DD  UCS=&UCS UCS
//DD000006 DD  UCS=(A) UCS
//DD000007 DD  UCS=(#) UCS
//DD000008 DD  UCS=(B2) UCS
//DD000009 DD  UCS=($C3D) UCS
//DD000010 DD  UCS=(&UCS) UCS
//DD000011 DD  UCS=(A,FOLD) UCS
//DD000012 DD  UCS=(#,FOLD) UCS
//DD000013 DD  UCS=(B2,FOLD) UCS
//DD000014 DD  UCS=($C3D,FOLD) UCS
//DD000015 DD  UCS=(&UCS,FOLD) UCS
//DD000016 DD  UCS=(A,&FOLD) UCS
//DD000017 DD  UCS=(#,&FOLD) UCS
//DD000018 DD  UCS=(B2,&FOLD) UCS
//DD000019 DD  UCS=($C3D,&FOLD) UCS
//DD000020 DD  UCS=(&UCS,&FOLD) UCS
//DD000021 DD  UCS=(A,FOLD,VERIFY) UCS
//DD000022 DD  UCS=(#,FOLD,VERIFY) UCS
//DD000023 DD  UCS=(B2,FOLD,VERIFY) UCS
//DD000024 DD  UCS=($C3D,FOLD,VERIFY) UCS
//DD000025 DD  UCS=(&UCS,FOLD,VERIFY) UCS
//DD000026 DD  UCS=(A,&FOLD,VERIFY) UCS
//DD000027 DD  UCS=(#,&FOLD,VERIFY) UCS
//DD000028 DD  UCS=(B2,&FOLD,VERIFY) UCS
//DD000029 DD  UCS=($C3D,&FOLD,VERIFY) UCS
//DD000030 DD  UCS=(&UCS,&FOLD,VERIFY) UCS
//DD000031 DD  UCS=(A,FOLD,&VERIFY) UCS
//DD000032 DD  UCS=(#,FOLD,&VERIFY) UCS
//DD000033 DD  UCS=(B2,FOLD,&VERIFY) UCS
//DD000034 DD  UCS=($C3D,FOLD,&VERIFY) UCS
//DD000035 DD  UCS=(&UCS,FOLD,&VERIFY) UCS
//DD000036 DD  UCS=(A,&FOLD,&VERIFY) UCS
//DD000037 DD  UCS=(#,&FOLD,&VERIFY) UCS
//DD000038 DD  UCS=(B2,&FOLD,&VERIFY) UCS
//DD000039 DD  UCS=($C3D,&FOLD,&VERIFY) UCS
//DD000040 DD  UCS=(&UCS,&FOLD,&VERIFY) UCS
//DD000041 DD  UCS=(A,FOLD,VERIFY) UCS
//DD000042 DD  UCS=(#,FOLD,VERIFY) UCS
//DD000043 DD  UCS=(B2,FOLD,VERIFY) UCS
//DD000044 DD  UCS=($C3D,FOLD,VERIFY) UCS
//DD000045 DD  UCS=(&UCS,FOLD,VERIFY) UCS
//DD000046 DD  UCS=(A,,VERIFY) UCS
//DD000047 DD  UCS=(#,,VERIFY) UCS
//DD000048 DD  UCS=(B2,,VERIFY) UCS
//DD000049 DD  UCS=($C3D,,VERIFY) UCS
//DD000050 DD  UCS=(&UCS,,VERIFY) UCS
//DD000051 DD  UCS=(A,,&VERIFY) UCS
//DD000052 DD  UCS=(#,,&VERIFY) UCS
//DD000053 DD  UCS=(B2,,&VERIFY) UCS
//DD000054 DD  UCS=($C3D,,&VERIFY) UCS
//DD000055 DD  UCS=(&UCS,,&VERIFY) UCS
//DD000056 DD  UCS=(A,,&VERIFY) UCS
//DD000057 DD  UCS=(#,,&VERIFY) UCS
//DD000058 DD  UCS=(B2,,&VERIFY) UCS
//DD000059 DD  UCS=($C3D,,&VERIFY) UCS
//DD000060 DD  UCS=(&UCS,,&VERIFY) UCS

