//DD001 JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  BURST=YES
//DD000002 DD  BURST=Y
//DD000003 DD  BURST=NO
//DD000004 DD  BURST=N
//DD000005 DD  BURST=&BURST
//DD000001 DD  BURST=YES BURST
//DD000002 DD  BURST=Y BURST
//DD000003 DD  BURST=NO BURST
//DD000004 DD  BURST=N BURST
//DD000005 DD  BURST=&BURST BURST
