//KEYLABL2 JOB
//*
//STEP0001 EXEC PGM=IDCAMS
//DD000001 DD  KEYLABL2=1
//DD000002 DD  KEYLABL2=A
//DD000003 DD  KEYLABL2=$
//DD000004 DD  KEYLABL2=1A
//DD000005 DD  KEYLABL2=1@
//DD000006 DD  KEYLABL2=A1
//DD000007 DD  KEYLABL2=A#
//DD000008 DD  KEYLABL2=$1
//DD000009 DD  KEYLABL2=@A
//DD000010 DD  KEYLABL2=123456789A123456789B123456789C123456789D12345
//DD000011 DD  KEYLABL2=.
//DD000012 DD  KEYLABL2=1.2.3.4
//DD000013 DD  KEYLABL2=A.B.C.D
//DD000014 DD  KEYLABL2=&KEYLABL2
//DD000015 DD  KEYLABL2='!'
//DD000016 DD  KEYLABL2=''''
//DD000017 DD  KEYLABL2='********************
// *******************'
//DD000018 DD  KEYLABL2=....................
//DD000019 DD  KEYLABL2=&KEY1&KEY2
//DD000101 DD  KEYLABL2=1 KEYLABL2
//DD000102 DD  KEYLABL2=A KEYLABL2
//DD000103 DD  KEYLABL2=$ KEYLABL2
//DD000104 DD  KEYLABL2=1A KEYLABL2
//DD000105 DD  KEYLABL2=1@ KEYLABL2
//DD000106 DD  KEYLABL2=A1 KEYLABL2
//DD000107 DD  KEYLABL2=A# KEYLABL2
//DD000108 DD  KEYLABL2=$1 KEYLABL2
//DD000109 DD  KEYLABL2=@A KEYLABL2
//DD000111 DD  KEYLABL2=. KEYLABL2
//DD000112 DD  KEYLABL2=1.2.3.4 KEYLABL2
//DD000113 DD  KEYLABL2=A.B.C.D KEYLABL2
//DD000114 DD  KEYLABL2=&KEYLABL2 KEYLABL2
//DD000115 DD  KEYLABL2='!' KEYLABL2
//DD000116 DD  KEYLABL2='''' KEYLABL2
//DD000118 DD  KEYLABL2=.................... KEYLABL2
//DD000119 DD  KEYLABL2=&KEY1&KEY2 KEYLABL2
