//EDSEL JOB
//*
//STEP001  EXEC PGM=IEFBR14,ACCT=A,COND=EVEN,DYNAMNBR=12345,
// PARMDD=#PARM
//STEP002  EXEC PGM=IEFBR14,PARM=X,ACCT='A',,COND=ONLY,
// DYNAMNBR=12345,PARMDD=$PARM
//STEP002A EXEC PGM=IEFBR14,PARM=XX,ACCT=(A),COND=(4,GT,STEP001),
// DYNAMNBR=12345,PARMDD=@PARM
//STEP002B EXEC PGM=IEFBR14,PARM=1,ACCT=('A'),
// COND=((16,GE),(90,LE,STEP001),ONLY),
// DYNAMNBR=&DYNAM1&DYNAM2&DYNAM3,PARMDD=STEPPARM
//STEP002C EXEC PGM=IEFBR14,PARM=12,ACCT=(A,B),PARMDD=@PARM,
//   COND=((8,LT,STEP001),(8,GT,STEP001A)),DYNAMNBR=12345
//STEP002D EXEC PGM=IEFBR14,PARM=#,ACCT=('A',B),DYNAMNBR=12345,
// COND=((16,GE),(90,LE,STEP001),(31,EQ,STEP002B),EVEN),PARMDD=PARM1
//STEP002E EXEC PGM=IEFBR14,PARM=#$,ACCT=(A,'B'),
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN),DYNAMNBR=12345,PARMDD=#PARM
//STEP002F EXEC PGM=IEFBR14,PARM=X1,ACCT=A1,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN),
//  DYNAMNBR=12345,
//  PARMDD=$PARM
//STEP002G EXEC PGM=IEFBR14,PARM=XX1,ACCT='A1',PARMDD=#PARM,
// DYNAMNBR=12345,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002H EXEC PGM=IEFBR14,PARM=XX11,ACCT=(A1),PARMDD=$PARM,
// DYNAMNBR=12345,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002I EXEC PGM=IEFBR14,PARM=1X,ACCT=('A1'),PARMDD=$PARM,
// DYNAMNBR=12345,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002J EXEC PGM=IEFBR14,PARM=11X,ACCT=(A1,B2),PARMDD=$PARM,
// DYNAMNBR=12345,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002K EXEC PGM=IEFBR14,PARM=11XX,ACCT=('A1',B2),PARMDD=$PARM,
// DYNAMNBR=12345,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002L EXEC PGM=IEFBR14,PARM=X@,ACCT=(A1,'B2'),PARMDD=STEPPARM,
// DYNAMNBR=12345,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP002M EXEC PGM=IEFBR14,PARM=XX@,ACCT=('A1','B2'),PARMDD=$PARM,
// DYNAMNBR=12345,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN)
//STEP006  EXEC PGM=IEFBR14,PARM=&AB,COND=(4,LT),PARMDD=STEPPARM
//STEP007  EXEC PGM=IEFBR14,PARM=&A.1,COND=(0,NE),PARMDD=PARMDD
//STEP008  EXEC PGM=IEFBR14,PARM=ZZ&A,COND=EVEN,PARMDD=@PARM
//STEP009  EXEC PGM=IEFBR14,PARM=ZZ&A.1,PARMDD=PARMDD
//STEP010  EXEC PGM=IEFBR14,PARM='AND A ONE AND A TWO AND
//       A THREE AND A FOUR',PARMDD=STEPPARM,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN),DYNAMNBR=12345
//STEP011  EXEC PGM=IEFBR14,PARM=(A,B,C,D,E,F,G),PARMDD=PARMDD
//STEP012  EXEC PGM=IEFBR14,PARM=(A,              PARM 1
//  B,                                            PARM 2
//    C,                                          PARM 3
// D,                                             PARM 4
//         E,                                     PARM 5
//      F,                                        PARM 6
//        G),PARMDD=STEPPARM,                  PARM 7
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN),DYNAMNBR=12345
//STEP013  EXEC PGM=IEFBR14,
// PARM=(A,
// B,
// C,
// D,
// E,F,
//         G),PARMDD=PARMDD,
// COND=((16,GE),
//  (90,LE,STEP001),
//  (31,EQ,STEP002B),
//  EVEN),DYNAMNBR=12345
//STEP014  EXEC PGM=IEFBR14,PARM=('ABC',&A,7,'BLAH
//  BLAH BLAH'),COND=(333,EQ,STEP011),DYNAMNBR=12345,PARMDD=PARMDD
//STEP015  EXEC PGM=IEFBR14,PARM=X,COND=ONLY,PARMDD=PARMDD moo
