//OUTLIM JOB
//*
//STEP0001 EXEC PGM=OUTPUT
//DD000001 DD  OUTLIM=1
//DD000002 DD  OUTLIM=16777215
//DD000003 DD  OUTLIM=&OUTLIM
//DD000011 DD  OUTLIM=1 OUTLIM
//DD000012 DD  OUTLIM=16777215 OUTLIM
//DD000013 DD  OUTLIM=&OUTLIM OUTLIM
//DD000021 DD  SYSOUT=*,OUTLIM=1
//DD000022 DD  SYSOUT=A,OUTLIM=16777215
//DD000023 DD  SYSOUT=D,OUTLIM=&OUTLIM
//DD000031 DD  OUTLIM=1,SYSOUT=*
//DD000032 DD  OUTLIM=16777215,SYSOUT=A
//DD000033 DD  OUTLIM=&OUTLIM,SYSOUT=1
//DD000041 DD  SYSOUT=*, SYSOUT
//             OUTLIM=1  OUTLIM
//DD000042 DD  SYSOUT=A, SYSOUT
//             OUTLIM=16777215 OUTLIM
//DD000043 DD  SYSOUT=D, SYSOUT
//             OUTLIM=&OUTLIM OUTLIM
//DD000051 DD  OUTLIM=1, OUTLIM
//             SYSOUT=*  SYSOUT
//DD000052 DD  OUTLIM=16777215, OUTLIM
//             SYSOUT=A SYSOUT
//DD000053 DD  OUTLIM=&OUTLIM, OUTLIM
//             SYSOUT=1 SYSOUT


