//KEYOFF JOB
//*
//STEP0001 EXEC PGM=TAPECOPY
//DD000001 DD  KEYOFF=1
//DD000002 DD  KEYOFF=255
//DD000003 DD  KEYOFF=32767
//DD000004 DD  KEYOFF=&KEYOFF
//DD000101 DD  KEYOFF=1 KEYOFF
//DD000102 DD  KEYOFF=255 KEYOFF
//DD000103 DD  KEYOFF=32767 KEYOFF
//DD000104 DD  KEYOFF=&KEYOFF KEYOFF

