//BLKSZLIM JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  BLKSZLIM=27998
//DD000002 DD  BLKSZLIM=27K
//DD000003 DD  BLKSZLIM=10M
//DD000004 DD  BLKSZLIM=1G
//DD000011 DD  BLKSZLIM=27998 BLKSZLIM
//DD000012 DD  BLKSZLIM=27K     BLKSZLIM
//DD000013 DD  BLKSZLIM=10M BLKSZLIM
//DD000014 DD  BLKSZLIM=1G     BLKSZLIM

