//MGMTCLAS JOB 
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  MGMTCLAS=
//DD000002 DD  MGMTCLAS=A
//DD000003 DD  MGMTCLAS=@
//DD000004 DD  MGMTCLAS=A1234567
//DD000005 DD  MGMTCLAS=#ABCDEFG
//DD000006 DD  MGMTCLAS=&MGMTCLAS
//DD000011 DD  MGMTCLAS= MGMTCLAS
//DD000012 DD  MGMTCLAS=A MGMTCLAS
//DD000013 DD  MGMTCLAS=@ MGMTCLAS
//DD000014 DD  MGMTCLAS=A1234567 MGMTCLAS
//DD000015 DD  MGMTCLAS=#ABCDEFG MGMTCLAS
//DD000016 DD  MGMTCLAS=&MGMTCLAS MGMTCLAS
