//DDAMP JOB 
//*
//STEP0001 EXEC PGM=IDCAMS
//DD0001   DD  AMP='AMORG,ACCBIAS=USER'
//DD0002   DD  AMP='AMORG,ACCBIAS=SYSTEM,RMODE31=ALL'
//DD0003   DD  AMP=('AMORG,ACCBIAS=SYSTEM,RMODE31=ALL')
//DD0004   DD  AMP=('AMORG',
// 'ACCBIAS=SYSTEM',
// 'RECFM=VB',
// 'BUFSP=200,RMODE31=ALL')
//DD0011   DD  AMP='AMORG,ACCBIAS=USER' AMP
//DD0012   DD  AMP='AMORG,ACCBIAS=SYSTEM,RMODE31=ALL' AMP
//DD0013   DD  AMP=('AMORG,ACCBIAS=SYSTEM,RMODE31=ALL') AMP
//DD0014   DD  AMP=('AMORG', AMORG
// 'ACCBIAS=SYSTEM', ACCBIAS
// 'RECFM=VB', RECFM
// 'BUFSP=200,RMODE31=ALL') BUFSP RMODE31
