//COMMAND JOB
//*
//COMMAND1 COMMAND 'F CICSPROD,SHUTD'
//COMMAND2 COMMAND 'F FILEHAND,PEND/DUMP'
//COMMAND3 COMMAND 'START MYTASK,PARM=''AERYN,CHIANA,CRICHTON,D''ARGO,M
//             OYA,PILOT,RYGEL,ZHANN'

