//BLKSIZE JOB
//*
//STEP0001 EXEC PGM=IEFBR14
//DD000001 DD  BLKSIZE=27998
//DD000002 DD  BLKSIZE=27K
//DD000003 DD  BLKSIZE=10M
//DD000004 DD  BLKSIZE=1G
//DD000011 DD  BLKSIZE=27998 BLKSIZE
//DD000012 DD  BLKSIZE=27K     BLKSIZE
//DD000013 DD  BLKSIZE=10M BLKSIZE
//DD000014 DD  BLKSIZE=1G     BLKSIZE

